{
  "pipeline_id": "0c125279-dc0d-4c41-8714-966b252641ac",
  "timestamp": "2025-08-30T23:22:48.144417",
  "current_step": "tts",
  "completed_steps": [
    "extraction",
    "titles",
    "premises",
    "scripts"
  ],
  "results": {
    "extraction": {
      "channel_info": {},
      "titles": [
        {
          "video_id": "G6wHEaLVhOc",
          "title": "MILIONÁRIO ENCONTRA MENINA DESCONHECIDA ESTUDANDO DEBAIXO DA MESA COM EMPREGADA",
          "description": "MILIONÁRIO ENCONTRA MENINA DESCONHECIDA ESTUDANDO DEBAIXO DA MESA DA COZINHA COM A EMPREGADA E SE EMOCIONA AO SABER QUEM ERA.\n\nVeja histórias fantásticas contadas de uma forma emocionante,...",
          "thumbnail": "",
          "duration": "4141.0s",
          "views": 1530,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=G6wHEaLVhOc"
        },
        {
          "video_id": "_oWfEg7dpsA",
          "title": "“Escolha Entre Eu Ou o Bebê!” Disse Noiva Do Milionário, Mas Ela Faz Algo Que o Deixa Em Choque",
          "description": "“Escolha Entre Mim Ou Esse Bebê!” Disse a Noiva Do Milionário, Mas o Que Ela Faz Ao Bebê Deixa o Coração Do Milionário Em Pedaços.\n\nVeja histórias fantásticas contadas de uma forma...",
          "thumbnail": "",
          "duration": "4641.0s",
          "views": 3339,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=_oWfEg7dpsA"
        },
        {
          "video_id": "hyqYjcDTR48",
          "title": "MILIONÁRIO LEVA GAROTA MENDIGA PARA SUA CASA E SE ESPANTA COM O QUE ELA FAZ COM SUA MÃE ACAMADA",
          "description": "MILIONÁRIO LEVA GAROTA MENDIGA PARA SUA CASA E SE ESPANTA COM O QUE ELA FAZ COM SUA MÃE ACAMADA.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram os...",
          "thumbnail": "",
          "duration": "3930.0s",
          "views": 2529,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=hyqYjcDTR48"
        },
        {
          "video_id": "T5rUnkoLRqs",
          "title": "MILIONÁRIO FICA EM CHOQUE AO VER OPERÁRIA IDÊNTICA A SUA FILHA PERDIDA",
          "description": "MILIONÁRIO FICA EM CHOQUE AO VER OPERÁRIA IDÊNTICA A SUA FILHA PERDIDA.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram os diversos lados da humanidade,...",
          "thumbnail": "",
          "duration": "3787.0s",
          "views": 12582,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=T5rUnkoLRqs"
        },
        {
          "video_id": "ugi0hYcXNjU",
          "title": "OS GÊMEOS DO MILIONÁRIO NÃO FALAVAM, MAS A FAXINEIRA FEZ O QUE NINGUÉM IMAGINOU",
          "description": "OS GÊMEOS DO MILIONÁRIO NÃO FALAVAM, MAS A FAXINEIRA FEZ O QUE NINGUÉM IMAGINOU.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram os diversos lados...",
          "thumbnail": "",
          "duration": "5775.0s",
          "views": 1682,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=ugi0hYcXNjU"
        },
        {
          "video_id": "rpz3lf4rsU4",
          "title": "GARÇONETE É PAGA PARA DESTRUIR O ENCONTRO ROMÂNTICO DE UM MILIONÁRIO, MAS ELE SE APAIXONA POR ELA",
          "description": "GARÇONETE É PAGA 100 REAIS PARA DESTRUIR O ENCONTRO ROMÂNTICO DE UM MILIONÁRIO, MAS JAMAIS IMAGINOU QUE ELE FICARIA ENCANTADO POR ELA.\n\nVeja histórias fantásticas contadas de uma forma...",
          "thumbnail": "",
          "duration": "4389.0s",
          "views": 1320,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=rpz3lf4rsU4"
        },
        {
          "video_id": "LIB7Jyqk8F0",
          "title": "MILIONÁRIO ENTRA EM ALA PEDIÁTRICA NO HOSPITAL E FICA PÁLIDO AO RECONHECER UMA CRIANÇA",
          "description": "MILIONÁRIO ENTRA EM ALA PEDIÁTRICA NO HOSPITAL E FICA PÁLIDO AO RECONHECER UMA CRIANÇA.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram os diversos...",
          "thumbnail": "",
          "duration": "4491.0s",
          "views": 2456,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=LIB7Jyqk8F0"
        },
        {
          "video_id": "hj1ztuKrUyY",
          "title": "MILIONÁRIO FALIDO DÁ CARONA PRA MORADORA DE RUA E SUA FILHA E É DEMITIDO, MAS ELA LHE DÁ UM PRESENTE",
          "description": "MILIONÁRIO FALIDO DÁ CARONA PARA MORADORA DE RUA E SEU FILHO E É DEMITIDO, MAS ELA LHE DÁ UM PRESENTE.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram...",
          "thumbnail": "",
          "duration": "3608.0s",
          "views": 16099,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=hj1ztuKrUyY"
        },
        {
          "video_id": "UPyiqBIjRXE",
          "title": "MILIONÁRIO REJEITOU TODAS AS PRETENDENTES, MAS SE ENCANTA QUANDO ENCONTRA ENTREGADORA MÃE SOLTEIRA",
          "description": "MILIONÁRIO REJEITOU TODAS AS PRETENDENTES, MAS SE ENCANTA QUANDO ENCONTRA ENTREGADORA MÃE SOLTEIRA.\n\nVeja histórias fantásticas contadas de uma forma emocionante, histórias que mostram...",
          "thumbnail": "",
          "duration": "4579.0s",
          "views": 25990,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=UPyiqBIjRXE"
        }
      ],
      "total_extracted": 9,
      "method_used": "yt-dlp",
      "extraction_time": "2025-08-30T23:18:08.553771"
    },
    "titles": {
      "generated_titles": [
        "Milionário Chocado: Faxineira Cura Doença Incurável de sua Filha!"
      ],
      "source_titles_count": 9,
      "provider_used": "gemini",
      "style": "viral",
      "generation_time": "2025-08-30T23:18:12.478488"
    },
    "premises": {
      "selected_title": "Milionário Chocado: Faxineira Cura Doença Incurável de sua Filha!",
      "premise": "Este vídeo, dirigido a um público que aprecia histórias inspiradoras de superação e milagres, conta a história comovente de Arthur, um milionário solitário e workaholic, cuja filha, Sofia, é diagnosticada com uma doença incurável.  Desesperado e sem opções, Arthur se fecha em sua riqueza, frustrado com a medicina tradicional.  Enquanto isso, Maria, uma faxineira humilde e de grande fé, que trabalha na mansão de Arthur, observa a tristeza do milionário. Maria, por sua vez, compartilha uma antiga receita caseira, passada por gerações de sua família, que acredita ter propriedades curativas.  Inicialmente cético e resistente, Arthur, pressionado pela gravidade do estado de Sofia, decide tentar o remédio de Maria como último recurso.  O vídeo acompanha a jornada de Arthur e Sofia, mostrando a transformação do milionário frio e distante em um pai amoroso e a incrível recuperação da filha.  O tom do vídeo será inspirador e emocionante, mesclando cenas dramáticas da luta contra a doença com momentos de esperança e fé.  Pontos-chave incluem: a relação inicialmente distante entre Arthur e Maria, a transformação de Arthur, a eficácia (ou não) do remédio, a importância da fé e da esperança, e a lição sobre a verdadeira riqueza da vida. O vídeo concluirá com uma reflexão sobre o valor da simplicidade e da generosidade humana, contrastando o mundo materialista de Arthur com a fé inabalável de Maria.\n",
      "word_count": 223,
      "provider_used": "gemini",
      "generation_time": "2025-08-30T23:18:15.772404"
    },
    "scripts": {
      "title": "Milionário Chocado: Faxineira Cura Doença Incurável de sua Filha!",
      "premise": "Este vídeo, dirigido a um público que aprecia histórias inspiradoras de superação e milagres, conta a história comovente de Arthur, um milionário solitário e workaholic, cuja filha, Sofia, é diagnosticada com uma doença incurável.  Desesperado e sem opções, Arthur se fecha em sua riqueza, frustrado com a medicina tradicional.  Enquanto isso, Maria, uma faxineira humilde e de grande fé, que trabalha na mansão de Arthur, observa a tristeza do milionário. Maria, por sua vez, compartilha uma antiga receita caseira, passada por gerações de sua família, que acredita ter propriedades curativas.  Inicialmente cético e resistente, Arthur, pressionado pela gravidade do estado de Sofia, decide tentar o remédio de Maria como último recurso.  O vídeo acompanha a jornada de Arthur e Sofia, mostrando a transformação do milionário frio e distante em um pai amoroso e a incrível recuperação da filha.  O tom do vídeo será inspirador e emocionante, mesclando cenas dramáticas da luta contra a doença com momentos de esperança e fé.  Pontos-chave incluem: a relação inicialmente distante entre Arthur e Maria, a transformação de Arthur, a eficácia (ou não) do remédio, a importância da fé e da esperança, e a lição sobre a verdadeira riqueza da vida. O vídeo concluirá com uma reflexão sobre o valor da simplicidade e da generosidade humana, contrastando o mundo materialista de Arthur com a fé inabalável de Maria.\n",
      "script": "TÍTULO: Milionário Chocado: Faxineira Cura Doença Incurável de sua Filha!\nPREMISSA: Este vídeo, dirigido a um público que aprecia histórias inspiradoras de superação e milagres, conta a história comovente de Arthur, um milionário solitário e workaholic, cuja filha, Sofia, é diagnosticada com uma doença incurável.  Desesperado e sem opções, Arthur se fecha em sua riqueza, frustrado com a medicina tradicional.  Enquanto isso, Maria, uma faxineira humilde e de grande fé, que trabalha na mansão de Arthur, observa a tristeza do milionário. Maria, por sua vez, compartilha uma antiga receita caseira, passada por gerações de sua família, que acredita ter propriedades curativas.  Inicialmente cético e resistente, Arthur, pressionado pela gravidade do estado de Sofia, decide tentar o remédio de Maria como último recurso.  O vídeo acompanha a jornada de Arthur e Sofia, mostrando a transformação do milionário frio e distante em um pai amoroso e a incrível recuperação da filha.  O tom do vídeo será inspirador e emocionante, mesclando cenas dramáticas da luta contra a doença com momentos de esperança e fé.  Pontos-chave incluem: a relação inicialmente distante entre Arthur e Maria, a transformação de Arthur, a eficácia (ou não) do remédio, a importância da fé e da esperança, e a lição sobre a verdadeira riqueza da vida. O vídeo concluirá com uma reflexão sobre o valor da simplicidade e da generosidade humana, contrastando o mundo materialista de Arthur com a fé inabalável de Maria.\n\nNÚMERO DE CAPÍTULOS: 12\nESTIMATIVA DE DURAÇÃO: 21 minutos\n\n(Inicia com uma cena rápida e dinâmica mostrando imagens de luxo: carros esportivos, iates, uma mansão imponente.  Música dramática e inspiradora de fundo.)\n\n**Narrador (Voz grave e confiante):**  Ele tinha tudo.  Fortuna incalculável, sucesso profissional sem precedentes.  Mas Arthur Miller, o magnata da tecnologia, estava sozinho.  Completamente sozinho.  Até que a doença invadiu sua vida, trazendo consigo um medo terrível que o dinheiro não podia comprar.\n\n(A câmera focaliza Arthur, um homem de meia idade, elegantemente vestido, mas com um olhar cansado e marcado pelas preocupações. Está sentado em sua enorme sala de jantar, sozinho, observando uma foto de uma menina doce e sorridente.)\n\n**Narrador:**  Sofia, sua filha, a luz de seus olhos, foi diagnosticada com uma doença incurável.  Os melhores médicos do mundo deram o mesmo veredito: poucas chances de sobrevivência.  A riqueza que Arthur tanto buscou se tornou um peso insuportável, um cruel lembrete de sua impotência diante da fragilidade da vida.\n\n(A cena muda para um corredor da mansão, mostrando Maria, uma mulher de meia idade, simples e de olhar sereno, limpando o chão com cuidado e dedicação.  Sua expressão é preocupada enquanto observa Arthur à distância.)\n\n**Narrador:**  Enquanto Arthur se afogava na dor e na frustração, Maria, a faxineira de sua mansão, observava tudo em silêncio.  Maria, uma mulher de fé inabalável, carregava em seu coração um segredo ancestral, uma antiga receita passada de geração em geração em sua família. Um remédio natural, capaz de realizar o que a medicina moderna não conseguia.\n\n(Close em Maria, mostrando suas mãos calejadas, mas firmes, segurando um pequeno frasco com ervas secas.  Música suave e emotiva de fundo.)\n\n**Narrador:** A relação entre Arthur e Maria era a mais pura formalidade, a distância entre dois mundos completamente diferentes.  O milionário frio e distante, o homem que construíra seu império com base em dados e algoritmos, e a mulher humilde que encontrava consolo na fé e na simplicidade.  Mas o destino, em sua cruel e inesperada generosidade, estava prestes a unir esses dois mundos de forma surpreendente.\n\n(A cena volta para Arthur, agora mais abatido do que antes, olhando fixamente para a foto de Sofia.  Sua face demonstra o peso da situação, a angústia de um pai impotente.)\n\n**Narrador:** A esperança de Arthur esvaía a cada dia.  A medicina moderna, com toda sua tecnologia e sofisticação, parecia se render diante da doença.  Ele se sentia perdido, preso em um labirinto de incertezas, sem saber para onde se virar.  Sua fortuna, seu sucesso, tudo parecia insignificante diante da iminência da perda.\n\n(A câmera se aproxima de Maria, que observa Arthur com compaixão.  Ela segura o frasco com as ervas, os olhos cheios de determinação.)\n\n**Narrador:** Maria sabia que tinha que fazer algo.  Sua fé, tão forte quanto suas mãos calejadas, a impulsionava.  Ela se aproximou de Arthur, pronta para compartilhar o segredo de sua família, mesmo sabendo que poderia ser rejeitada por um homem tão fechado em seu mundo de luxo e frieza.  Mas, no fundo, Maria acreditava no poder da esperança, na força da fé e no milagre da cura.  A jornada para romper a barreira entre esses dois mundos tão diferentes estava prestes a começar.  E este era apenas o início de uma história que mudaria para sempre a vida de um milionário e sua filha.\n\n\n[Cena 1: Mansão de Arthur - Dia]\n\nA câmera acompanha Maria enquanto ela limpa discretamente um canto da imensa sala de estar.  A expressão em seu rosto é de preocupação enquanto observa Arthur, sentado sozinho em uma poltrona de couro, encarando fixamente uma foto de Sofia.  Sua silhueta é envolta por uma aura de desespero.  O silêncio é quebrado apenas pelo suave ruído do aspirador.\n\nMaria se aproxima cautelosamente.  Hesita por um instante, mas finalmente, com um suspiro profundo, fala:\n\nMARIA:  Sr. Miller... eu sei que está sofrendo muito.  E... eu queria lhe oferecer algo.\n\nArthur a ignora, seu olhar fixo na foto.  Maria, com paciência, continua:\n\nMARIA:  É uma receita antiga, da minha família.  Passada de geração em geração.  Dizem que cura...  ajuda em casos como o da Sofia.\n\nArthur se vira bruscamente, um olhar de descrença e irritação em seus olhos.\n\nARTHUR: (voz rouca)  Cura?  A medicina moderna não conseguiu, uma receita de vovó vai resolver?  Não perca seu tempo, Maria.\n\nMARIA:  Não é só uma receita, Sr. Miller.  É... fé.  Esperança.  Não custa tentar, não é?  Imagine... se pudesse ajudar?\n\n[Cena 2: Quarto de Sofia - Dia]\n\nA câmera mostra Sofia na cama, pálida e fraca, conectada a diversos aparelhos médicos.  Seu olhar está cansado, mas um fio de esperança surge em seus olhos ao ver o pai entrar no quarto, pela primeira vez em dias, com um pequeno frasco na mão.\n\nARTHUR: (voz baixa e hesitante)  Sofia… eu… eu tenho algo aqui.  É um remédio… diferente.\n\n[Cena 3: Mansão de Arthur - Montagem]\n\nA montagem mostra a transformação gradual de Arthur.  As cenas intercalam momentos de dúvida e ceticismo com pequenos atos de carinho para com Sofia.  Ele está alimentando-a, lendo para ela, cantando cantigas de ninar.  A música de fundo é suave e inspiradora.  Maria observa tudo de longe, um sorriso discreto em seus lábios.\n\n[Cena 4: Quarto de Sofia - Noite]\n\nPassadas algumas semanas, Sofia está visivelmente melhor.  Seu semblante está mais radiante, suas bochechas coradas.  Arthur a abraça com força, as lágrimas escorrendo por seu rosto.\n\nARTHUR: (voz emocionada)  Obrigado, Maria.  Obrigado por não desistir de nós.\n\n[Cena 5: Jardim da Mansão - Dia]\n\nArthur e Maria conversam num banco do jardim, sob o sol da manhã.  Arthur, completamente transformado, parece mais leve e tranquilo.  Ele não é mais o homem frio e distante.\n\nARTHUR:  Eu nunca entendi… a verdadeira riqueza.  Pensava que era tudo isso… (gesticula em direção à mansão). Mas descobri que a verdadeira riqueza é a felicidade da minha filha, a amizade inesperada… e a esperança.\n\nMARIA: (sorriso sereno)  A fé move montanhas, Sr. Miller.  E às vezes, a simplicidade cura mais que qualquer remédio caro.\n\n[Cena 6: Close nos olhos de Sofia - Dia]\n\nSofia sorri para a câmera, forte e saudável. A música de fundo sobe em tom triunfal.\n\n[Cena 7: Arthur e Sofia juntos - Dia]\n\nPai e filha caminham de mãos dadas, rumo a um futuro incerto, mas cheio de esperança. A câmera faz um zoom para fora, mostrando-os como um ponto de luz em um mundo vasto e complexo. A cena final traz um close da receita de Maria, emoldurada, como um símbolo de fé e cura.\n\n\n[INÍCIO DO CAPÍTULO 3]\n\nA melhora de Sofia era gradual, mas inegável.  A cada dia, a pequena Sofia demonstrava mais energia, o sorriso voltava a iluminar seu rosto pálido, e a tosse insistente diminuía.  Arthur, que antes passava horas trancado em seu escritório, agora se encontrava ao lado da cama da filha, lendo histórias e brincando com seus brinquedos.  A frieza em seu olhar havia sido substituída por uma ternura profunda, revelando um pai que finalmente havia encontrado seu caminho de volta para o coração da filha.\n\nMaria, discretamente, observava a transformação de Arthur de seu canto da mansão.  Sua fé na receita ancestral havia sido recompensada, mas o que a enchia de uma alegria ainda maior era a mudança no coração do milionário.  Ela via em seus olhos não mais a dureza do trabalho incessante, mas a suave luz da paternidade e do amor.  A gratidão de Arthur era silenciosa, mas palpável.  Ele a tratava com um respeito que antes era inexistente, oferecendo presentes e palavras de apreço, mas a verdadeira riqueza para Maria era testemunhar a felicidade que havia trazido àquela família.\n\nUm dia, enquanto Sofia dormia tranquilamente, Arthur se aproximou de Maria, a expressão séria no rosto.  \"Maria,\" ele começou, sua voz carregada de emoção, \"eu não sei como agradecer.  Você salvou a minha filha, mas mais que isso, você me salvou também.  Eu estava perdido, cego pela minha ambição, pelo meu trabalho… eu não via o que realmente importava.\"\n\nMaria sorriu, suas mãos calejadas mostrando sinais de um trabalho árduo, mas seus olhos brilhavam com uma luz serena. \"Arthur,\" ela respondeu, \"a cura veio da fé e da esperança, mas também da sua disposição de abrir seu coração.  A verdadeira riqueza está na família, no amor, na generosidade... coisas que o dinheiro não pode comprar.\"\n\nArthur assentiu, seus olhos marejados. Ele a convidou para se sentar e conversaram por horas sobre a vida, sobre suas experiências, seus sonhos e seus arrependimentos.  Arthur compartilhou sua jornada, os altos e baixos de sua carreira, a solidão que o consumia, a culpa que sentia por não ter passado mais tempo com Sofia.  Maria ouvia atentamente, oferecendo palavras de conforto e sabedoria, sem julgamentos.\n\nDias se transformaram em semanas, e a saúde de Sofia se fortaleceu cada vez mais.  Ela voltou a correr e brincar, enchendo a mansão com sua alegria contagiante.  Arthur, por sua vez, se dedicava totalmente à filha, participando de suas atividades, criando memórias inesquecíveis.  Ele até mesmo começou a ajudar Maria em algumas tarefas domésticas, aprendendo a valorizar o esforço físico e o significado do trabalho manual.  A mansão, outrora símbolo de sua solidão e sucesso material, agora pulsava com a vida e o amor de uma família unida.\n\nA recuperação de Sofia não foi apenas física, mas também emocional. A relação pai e filha, antes distante e fria, se tornou um elo inquebrantável, fortalecido pela superação de uma adversidade que os aproximou.  A transformação de Arthur era visível para todos, um renascimento espiritual que o levou a rever seus valores e prioridades. Ele aprendeu que a verdadeira riqueza não estava nos números de sua conta bancária, mas no sorriso da filha e no calor de um abraço.  A receita caseira de Maria não foi apenas uma cura física, mas um catalisador para uma transformação completa e profunda na vida do milionário solitário e na sua visão de mundo.\n[FIM DO CAPÍTULO 3]\n\n\n[Cena 1: Ext. Jardim da Mansão – Dia]\n\nSofia corre livremente pelo jardim ensolarado, sua risada ecoando pelo espaço. Arthur, sentado em um banco de madeira, observa-a com um sorriso largo e emocionado. Ele segura uma bola, pronto para jogá-la para ela.  A imagem contrasta drasticamente com as cenas sombrias do início do vídeo.\n\nArthur: (voz suave) Corre, minha pequena. Corre o quanto quiser. Papai está aqui para te pegar.\n\nSofia corre até ele, seus braços abertos.  Arthur a abraça forte, sentindo a leveza e a saúde da filha em seus braços.\n\n[Cena 2: Int. Sala de Estar da Mansão – Dia]\n\nMaria limpa um vaso de flores, enquanto Arthur observa-a com respeito e gratidão. A mansão, antes imponente e fria, agora é aconchegante e cheia de vida.\n\nArthur: Maria, eu não sei como te agradecer. Você salvou a minha filha, você salvou a minha vida.\n\nMaria: (sorrindo)  Arthur, a gratidão é minha.  Ver a felicidade de Sofia me enche o coração.  A cura veio da fé, da esperança e de um pouco de ajuda da natureza.\n\nArthur:  Mas...eu era tão cego.  Tão obcecado com o meu trabalho, com a minha riqueza... Eu quase perdi tudo.\n\nMaria: A vida nos ensina, Arthur. As coisas materiais não são tudo.  A família, o amor, a fé... esses sim são os verdadeiros tesouros.\n\nArthur: Você está certa.  Eu quero ajudar outras famílias, Maria. Quero usar minha fortuna para apoiar pesquisas médicas, para ajudar outras crianças como Sofia. Quero criar uma fundação.\n\nMaria: Essa é uma ideia maravilhosa, Arthur.  Você está usando sua riqueza para fazer o bem, e isso é ainda mais valioso que o ouro.\n\n[Cena 3: Montagem – Várias cenas curtas]\n\nUma montagem rápida mostra Arthur participando de eventos beneficentes, visitando hospitais, e interagindo com crianças doentes. Mostra também Sofia crescendo, feliz e saudável, rodeada do amor de seu pai e de Maria.  Imagens intercaladas mostram Arthur sorrindo, ajudando os outros e abraçando sua filha.\n\n[Cena 4: Int. Sala de Estar da Mansão – Noite]\n\nArthur e Sofia estão sentados no sofá, assistindo a um filme.  Arthur acaricia os cabelos de Sofia, um gesto de carinho que antes era impensável.\n\nSofia: Papai, eu te amo.\n\nArthur: (com os olhos marejados) Eu também te amo, minha pequena.  Mais do que tudo neste mundo.\n\n[Cena 5: Int. Sala de Estar da Mansão – Noite]\n\nArthur está sozinho, contemplando o quadro familiar. A mansão, iluminada, agora reflete a paz e a alegria que reinam em seu interior. Ele sorri, sabendo que encontrou uma riqueza infinitamente maior do que qualquer fortuna material.  A câmera se concentra em seu rosto, expressando profunda gratidão e serenidade.  A música inspiradora soa ao fundo, enquanto o vídeo chega ao fim.\n\n\n(Cena: Um ano depois.  Imagens rápidas e vibrantes mostram Sofia brincando num parque, Arthur sorrindo e interagindo com ela, a família reunida em um jantar aconchegante.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que Sofia deu seus primeiros passos rumo à cura.  E a transformação em sua vida, e na vida de Arthur, foi profunda e irreversível.  A pequena Sofia, antes presa a um leito de hospital, hoje corre livremente, sua risada ecoando como um sinônimo de vitória sobre a adversidade.\n\n(Cena: Arthur e Maria conversam no jardim da mansão. Maria sorri, Arthur demonstra gratidão e afeto.)\n\nArthur: Maria, eu não sei como agradecer.  Você salvou a vida da minha filha.  Eu era um homem perdido, cego pela ambição, pela riqueza...  E você, com sua simplicidade e sua fé, me mostrou o verdadeiro caminho.\n\nMaria: (Sorrindo calmamente)  Arthur, a cura de Sofia foi um presente de Deus.  Eu apenas ajudei a abrir o caminho.  A sua fé e o seu amor por ela foram os verdadeiros milagres.\n\n(Cena: Montagem mostrando o trabalho da fundação criada por Arthur.  Crianças sorrindo, médicos atenciosos, Arthur envolvido em atividades da fundação.)\n\nNarrador:  A Fundação Sofia, criada em nome da filha, tornou-se um símbolo de esperança para centenas de crianças doentes.  Arthur, que antes só conhecia o mundo dos negócios, agora encontra realização em ajudar os outros.  Sua riqueza, antes uma prisão, se tornou uma ferramenta para transformar vidas.\n\n(Cena: Arthur visita Sofia no quarto dela. Ele a ajuda a fazer a lição de casa, mostrando ternura e cuidado.)\n\nArthur: (Lendo um livro com Sofia)  Você está crescendo tão rápido, minha pequena.  Sabe, antes, eu perdia todos esses momentos preciosos... esses sorrisos, essas pequenas conquistas.  Eu era um tolo.\n\nSofia: (Abraçando o pai) Eu te amo, papai.\n\n(Cena: Arthur em seu escritório, agora mais simples e acolhedor. Ele olha para uma foto de Sofia e Maria. Um sorriso sereno em seu rosto.)\n\nNarrador: A mansão imponente ainda existe, mas seu significado mudou.  Ela não mais representa solidão e vazio, mas um lar repleto de amor e gratidão.  Arthur aprendeu que a verdadeira riqueza não se encontra em contas bancárias, mas nos laços familiares, na generosidade e na fé inabalável em algo maior que nós mesmos.\n\n(Cena: Maria caminhando pelo jardim da mansão, ao pôr do sol.  A câmera foca em suas mãos, mostrando as rugas e as marcas do tempo, mas com uma expressão de paz e contentamento.)\n\nNarrador: Maria continua sua vida simples, mas carregando a sensação de ter plantado uma semente de esperança que floresceu num jardim de milagres.  Sua fé, sua generosidade, foram o catalisador de uma transformação incrível, provando que a verdadeira riqueza está nos corações bondosos e na capacidade de amar incondicionalmente.\n\n(Cena final: Arthur, Sofia e Maria juntos, sorrindo para a câmera.  Música inspiradora e mensagem final na tela: “A verdadeira riqueza está no amor e na fé. Nunca deixe de acreditar no poder da esperança.”)\n\n\n(Cena: Abertura com imagens de Sofia, radiante e brincando em um parque, intercaladas com cenas de Arthur trabalhando na Fundação Sofia, rodeado por crianças e voluntários sorridentes. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou… A pequena Sofia, que outrora lutava contra uma doença incurável, agora corre livremente, um símbolo de esperança e resiliência. A transformação em sua vida espelha a incrível jornada de seu pai, Arthur, o milionário solitário que descobriu o verdadeiro significado da riqueza.\n\n(Cena: Arthur, em seu escritório moderno, mas agora mais acolhedor, revisa relatórios da Fundação Sofia. Um sorriso sincero ilumina seu rosto.)\n\nNarrador: A Fundação Sofia, criada em homenagem à sua filha, se tornou o centro da vida de Arthur.  Ele investiu toda a sua fortuna – ou melhor, *parte* de sua fortuna – em pesquisas médicas, tratamento para crianças necessitadas e, acima de tudo, em proporcionar amor e esperança onde antes só havia desespero.\n\n(Cena: Maria, em sua casa simples e aconchegante, prepara um bolo. Um sorriso sereno em seus lábios.)\n\nNarrador: Maria, a faxineira que um dia compartilhou um segredo ancestral que salvou Sofia, continua sua vida simples e humilde.  Sua fé inabalável permanece seu maior tesouro. Ela visita Sofia e Arthur regularmente, compartilhando momentos de alegria e gratidão.  A relação entre eles transcendeu a de patrão e empregada, transformando-se numa profunda amizade baseada em respeito mútuo e amor incondicional.\n\n(Cena: Uma festa de aniversário de Sofia. Arthur brinca com a filha, Maria observa emocionada, e outros pacientes da Fundação Sofia estão presentes, todos sorrindo e interagindo.  A atmosfera é de pura alegria e esperança.)\n\nNarrador:  A celebração do primeiro aniversário de Sofia após sua recuperação é um marco inesquecível.  Nesse dia, Arthur percebe que a verdadeira riqueza não se mede em dígitos bancários, mas no calor de uma família unida, no amor incondicional e na satisfação de fazer a diferença na vida dos outros.\n\n(Cena: Arthur observa as crianças da Fundação Sofia, olhos marejados, enquanto um voluntário mostra um novo equipamento médico recém-adquirido graças a uma doação significativa de Arthur.)\n\nNarrador:  Arthur compreendeu que o vazio que sentia antes era fruto de sua própria incapacidade de ver além da riqueza material. Ele aprendeu que a verdadeira riqueza reside na generosidade, na capacidade de amar e de ser amado, na fé que move montanhas e na simplicidade de momentos genuínos.\n\n(Cena: Arthur e Maria sentados juntos, num jardim ensolarado, conversando serenamente. Sofia brinca perto deles.)\n\nNarrador:  A história de Arthur e Sofia é um poderoso lembrete: a vida é uma jornada, repleta de desafios e alegrias.  A fé, a esperança e o amor são os pilares que nos sustentam nos momentos mais difíceis, nos guiam em direção à luz e nos mostram que, mesmo em meio às maiores adversidades, a cura – física e espiritual – é possível.  A verdadeira riqueza não está nas coisas que possuímos, mas no impacto positivo que causamos no mundo e nas vidas daqueles que amamos.  A jornada deles nos inspira a buscar a verdadeira riqueza em nossos corações.\n\n(Cena final:  Imagens de Sofia, Arthur e Maria sorrindo para a câmera, com uma mensagem de esperança e gratidão na tela. Música inspiradora.)\n\n\n(Cena: Abertura com imagens de crianças brincando em um parque, sorrindo e interagindo em um ambiente vibrante e colorido.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou. A Fundação Sofia floresceu, se tornando um farol de esperança para inúmeras famílias.  A pequena Sofia, radiante e cheia de vida, corre livremente, um testemunho vivo do poder da fé e da generosidade humana. Mas a jornada de Arthur não parou na recuperação de sua filha.  \n\n(Cena: Arthur, visivelmente mais jovem e sereno, senta-se em seu antigo escritório, agora transformado em uma sala aconchegante, repleta de fotos de Sofia e das crianças da Fundação.  Ele observa um mapa do mundo, pontuado por pinos coloridos, representando os projetos da fundação.)\n\nNarrador: O peso da fortuna que outrora o aprisionava agora o impulsionava a fazer a diferença.  Arthur, um homem acostumado a fechar negócios multimilionários, agora negociava sorrisos de crianças e esperanças renovadas para famílias em sofrimento.\n\n(Cena:  Arthur visita um hospital infantil, interagindo carinhosamente com as crianças e seus pais.  Sua interação demonstra compaixão e afeto genuíno.)\n\nNarrador: A Fundação Sofia expandiu seus projetos para além das fronteiras do seu país.  Hospitais, centros de pesquisa e programas de apoio familiar foram implantados em regiões carentes do mundo, levando consigo não apenas recursos materiais, mas também a mensagem de esperança e resiliência que Arthur e Maria haviam aprendido.\n\n(Cena:  Arthur e Maria conversam em um jardim florido, compartilhando um momento de calma e reflexão. Maria sorri serenamente.)\n\nMaria:  Você mudou tanto, Arthur.  A riqueza que você possuía não era nada comparada ao tesouro que você encontrou.\n\nArthur: (sorrindo) Você tinha razão, Maria. A verdadeira riqueza está em cada sorriso de Sofia, em cada vida tocada pela Fundação.  É o amor, a fé... é o legado que quero deixar para o mundo.\n\n(Cena:  Imagens intercaladas de projetos da Fundação Sofia em diferentes partes do mundo, mostrando o impacto positivo em comunidades necessitadas.  Música emotiva e inspiradora.)\n\nNarrador:  Mas o caminho não foi sem desafios. A burocracia, a escassez de recursos em algumas regiões e o desespero de famílias desesperadas testaram a força de Arthur e sua equipe.  Entretanto, a lembrança do olhar esperançoso de Sofia, a força de Maria e a crença no poder da generosidade os mantiveram firmes.\n\n(Cena:  Arthur, em uma reunião da Fundação, discute estratégias para expandir os projetos e garantir a sustentabilidade da instituição.  Ele demonstra liderança e determinação.)\n\nNarrador:  A Fundação Sofia, alimentada pelo altruísmo de Arthur e pela sabedoria ancestral de Maria, continua a transformar vidas, a espalhar esperança e a provar que mesmo a doença mais incurável pode ser superada quando a fé, o amor e a generosidade se unem para vencer.  A história de Arthur e Sofia não é apenas uma história de milagre, mas um testemunho do poder transformador da compaixão humana.\n\n(Cena:  Finaliza com imagens de Sofia brincando com outras crianças na Fundação, Arthur sorrindo ao observá-la, e Maria com um olhar sereno de orgulho.  Música inspiradora e mensagem final na tela:  \"A verdadeira riqueza está em fazer a diferença.\")\n\n\n(Cena: Abertura com imagens aéreas de diferentes projetos da Fundação Sofia ao redor do mundo – crianças sorrindo, médicos atendendo, famílias reunidas. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que a pequena Sofia recebeu o milagre de sua cura.  Arthur, o milionário solitário, transformou-se num homem impulsionado por uma força maior do que qualquer riqueza material: o amor incondicional por sua filha.  Mas o caminho da Fundação Sofia não tem sido fácil…\n\n(Cena: Arthur em uma reunião tensa, debatendo com um grupo de executivos em ternos impecáveis.  A atmosfera é carregada.)\n\nExecutivo 1:  Sr. Blackwood, os números não estão batendo.  Precisamos cortar gastos.  A expansão para a África está inviável, no momento.\n\nArthur:  Mas as crianças na África precisam da nossa ajuda tanto quanto as crianças em Nova York!  Não podemos simplesmente desistir delas por causa de um déficit orçamentário.\n\nExecutivo 2:  Temos que ser realistas, Sr. Blackwood.  Os recursos são limitados.\n\n(Cena: Arthur caminha sozinho pelos corredores da Fundação, visivelmente frustrado. Ele pega o telefone e liga.)\n\nArthur (ao telefone):  Maria… preciso te ver.  Preciso de sua ajuda.\n\n(Cena: Arthur e Maria sentados em um jardim tranquilo. Maria sorri calmamente para ele.)\n\nMaria:  Arthur, você está cansado.  Você se esforça demais.\n\nArthur:  Eles querem cortar os projetos na África.  Eles dizem que não há recursos… eu… eu não sei mais o que fazer.  Comecei a sentir que estou falhando.\n\nMaria:  Arthur, lembre-se da lição da Sofia:  Fé.  Esperança.  A verdadeira riqueza não se encontra em números em uma planilha, mas nos corações que você toca.  A semente que você plantou está crescendo, mesmo que demore a florescer.\n\n(Cena: Montagem rápida mostrando os desafios da Fundação – burocracia, falta de recursos, mas também momentos de alegria e sucesso – crianças recuperadas, famílias agradecidas, avanços na pesquisa médica.)\n\nNarrador:  A jornada de Arthur era uma montanha-russa.  Momentos de desespero se misturavam com a imensa alegria de testemunhar a transformação de vidas.  A cada obstáculo, a fé inabalável de Maria o guiava.  Ela lhe lembrava que a verdadeira riqueza estava na generosidade e na compaixão.\n\n(Cena: Arthur participa de um evento beneficente da Fundação, cercado por crianças e famílias.  Seu rosto demonstra paz e realização.)\n\n(Cena: Arthur e Sofia em casa, jogando um jogo de tabuleiro.  Sofia abraça o pai.  A cena é serena e cheia de amor.)\n\nNarrador:  Arthur aprendeu que a riqueza material era apenas uma parte da história.  A verdadeira fortuna residia no impacto positivo que ele tinha sobre a vida dos outros, e na conexão inquebrantável com sua filha e com Maria.  Sua jornada inspirou outros a se unirem à causa, a doar seu tempo e suas riquezas, mostrando que a esperança e a compaixão podem realmente mudar o mundo, um coração de cada vez.  E ele sabia, no fundo do seu coração, que Sofia, Maria e a Fundação continuariam a espalhar a luz da esperança por muitos anos.\n\n\n(Cena: Abertura com imagens de Arthur, agora com um visual mais despojado, trabalhando em seu escritório, porém com um semblante mais leve e tranquilo.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde o milagre que curou Sofia. A Fundação Arthur, criada em nome da filha, enfrentava novos desafios. Executivos, preocupados com a saúde financeira, pressionavam por cortes de gastos, ameaçando projetos cruciais na África, justamente onde a necessidade era maior.  A pressão era imensa.\n\n(Cena: Arthur, visivelmente frustrado, caminha impacientemente pela sala de reuniões.  Imagens rápidas de gráficos e planilhas.)\n\nNarrador: Arthur sentia a angústia apertando seu peito.  A riqueza que antes lhe trazia segurança, agora parecia um peso insuportável. Ele se lembrava da lição de Maria, a faxineira que havia transformado sua vida.\n\n(Cena: Arthur dirigindo até a casa simples de Maria.  A música muda para um tom mais calmo e reflexivo.)\n\nNarrador:  Procurando consolo e sabedoria, ele busca Maria.  Encontrá-la, sentada em sua varanda, com um chá na mão e um sorriso sereno, era um bálsamo para sua alma perturbada.\n\n(Cena: Arthur e Maria conversando.  Close nos rostos, mostrando emoções genuínas.)\n\nArthur: Maria, eu não sei o que fazer.  A Fundação… está sendo ameaçada.  Eles querem cortar os projetos na África, dizem que não é viável financeiramente.\n\nMaria: (Sorrindo gentilmente) Arthur, lembre-se do que a vida lhe ensinou.  A verdadeira riqueza não se encontra em números em uma planilha.  Está no impacto que você causa no mundo, no sorriso de uma criança, na esperança que você acende no coração de alguém.\n\n(Cena: Montagem de imagens da Fundação Arthur trabalhando na África: crianças sorrindo, médicos atendendo, construção de poços.)\n\nNarrador: As palavras de Maria ecoavam em seus ouvidos.  Ele reconsiderou suas prioridades.  Não se tratava apenas de números, mas de vidas.  Com renovada determinação, Arthur confrontou os executivos da Fundação.\n\n(Cena: Arthur em uma reunião, com uma postura firme e convicta.  Imagens de executivos com expressões hesitantes.)\n\nArthur:  Podemos cortar custos em outros setores, mas os projetos na África são inegociáveis.  São vidas que dependem de nós.  O verdadeiro retorno de nossa Fundação não é financeiro, mas o impacto positivo em milhares de pessoas.\n\n(Cena: Montagem rápida mostrando o trabalho contínuo na África, combinado com notícias de novas doações à Fundação.)\n\nNarrador:  A decisão de Arthur teve consequências positivas.  Apesar dos desafios financeiros, a perseverança e a transparência da Fundação inspiraram novas doações, de pessoas comovidas pela história de Sofia e pelo comprometimento de Arthur com a causa.\n\n(Cena: Arthur e Sofia abraçados, contemplando o pôr do sol.  Música inspiradora retorna.)\n\nNarrador: A jornada de Arthur havia sido transformadora.  Ele aprendeu que a verdadeira riqueza reside no amor, na fé, na compaixão e no impacto positivo em vidas alheias.  A riqueza material era apenas um meio, nunca o fim.  E a lição mais importante?  Às vezes, a cura para a alma vem em um simples chá, compartilhado com uma fé inabalável.\n\n\n(Cena: Um escritório amplo e moderno, porém aconchegante. Arthur, agora com um visual mais casual e um semblante sereno, trabalha em seu computador.  Imagens de projetos da Fundação na África passam na tela.  A música de fundo é suave e inspiradora.)\n\nNarrador: Um ano se passou desde o milagre que mudou a vida de Arthur. Sofia está radiante e saudável, correndo pela casa.  Mas os desafios não acabaram. A Fundação Arthur, dedicada a ajudar crianças necessitadas na África, enfrenta uma crise financeira.  Pressões de investidores o forçam a cortar projetos cruciais.\n\n(Cena: Arthur em uma reunião tensa com diretores da Fundação. Rostos preocupados e gráficos mostrando déficit financeiro.)\n\nArthur (voz tensa): Infelizmente, as projeções para este ano são desanimadoras. Para mantermos a Fundação operante, teremos que fazer cortes significativos. A equipe sugere priorizar os projetos com maior retorno financeiro…  eliminar os programas de alfabetização e saúde em regiões remotas.\n\n(Cena: Arthur, sozinho em seu escritório, visivelmente perturbado. Ele olha para uma foto de Sofia e Maria.)\n\nNarrador: Arthur se sente dividido.  Os números lhe pressionam, mas a memória da lição de Maria ecoa em seus ouvidos. Ele lembra da fé inabalável dela, da riqueza que ela encontrou na simplicidade e na generosidade.  Ele sabe que esses projetos, por mais difíceis que pareçam de manter, salvam vidas.\n\n(Cena: Arthur dirigindo em direção à casa humilde de Maria.  A câmera acompanha a paisagem, contrastando a opulência da cidade com a simplicidade do bairro onde Maria mora.)\n\nNarrador:  À procura de orientação, Arthur busca Maria.  A encontra em seu jardim, cuidando de suas plantas.  O reencontro é carregado de afeto e gratidão.\n\n(Cena: Arthur e Maria sentados na varanda ensolarada da casa de Maria, tomando chá. A conversa é tranquila e aconchegante.)\n\nArthur: Maria, eu preciso do seu conselho. A Fundação está em crise.  Me dizem que preciso cortar projetos, que preciso focar no lucro… mas como posso abandonar essas crianças?\n\nMaria (sorrindo gentilmente): Arthur, você se lembra do que te disse? A verdadeira riqueza não está no que você possui, mas no que você faz com o que possui.  O dinheiro pode se esgotar, mas o impacto da sua bondade…  isso permanece.  Essas crianças… elas não são apenas números em um relatório.  São vidas que dependem de você.\n\n(Cena: Arthur reflete, com uma expressão pensativa, enquanto olha para o horizonte. Uma música inspiradora e esperançosa toma conta da cena.)\n\nNarrador: As palavras de Maria o tocam profundamente. Ele entende a verdadeira mensagem.  Arthur retorna à Fundação com uma nova determinação.\n\n(Cena: Arthur na reunião da Fundação, agora com uma postura mais firme e convicta.)\n\nArthur: Eu sei que os números não são favoráveis, mas eu me recuso a sacrificar a missão da Fundação em prol do lucro.  Vamos encontrar outras formas de arrecadar fundos, de mostrar o impacto desse trabalho…Vamos criar uma campanha, contar nossas histórias com mais emoção.\n\n(Cena: Montagem rápida mostrando a campanha da Fundação, Arthur em entrevistas emocionantes, a resposta positiva do público, novas doações chegando.)\n\nNarrador: A decisão corajosa de Arthur inspira outros. Novas doações chegam, empresas se unem à causa.  A fé inabalável de Maria e a determinação renovada de Arthur restauram a esperança e garantem a continuidade dos projetos na África.  A verdadeira riqueza, a riqueza do impacto positivo, prevalece.\n\n\n(Cena: Abre com uma tomada aérea da Fundação Arthur, mostrando sua extensão e atividade. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que Arthur aprendeu a verdadeira lição da riqueza. A Fundação Arthur, símbolo de sua transformação, prosperava, levando esperança e saúde à África. Mas o paraíso não dura para sempre…\n\n(Cena: Corte para Arthur, visivelmente preocupado, em sua sala de reuniões. Documentos espalhados sobre a mesa.)\n\nArthur (voz em off):  Os números eram implacáveis.  Doações diminuíram drasticamente.  A Fundação estava enfrentando uma crise financeira sem precedentes.  Cortar projetos?  Era impensável.  Mas era a única opção que me restava.\n\n(Cena: Arthur em seu carro, dirigindo até a humilde casa de Maria. A paisagem muda, contrastando a riqueza de Arthur com a simplicidade de Maria.)\n\nNarrador: Desesperado, Arthur buscou a sabedoria daquela que o havia guiado por um caminho de redenção: Maria.\n\n(Cena: Interior da casa de Maria.  Ambientes simples, mas aconchegantes e cheios de amor.  Maria sorri para Arthur, oferecendo-lhe chá.)\n\nMaria: Arthur, meu filho, que vento te traz até aqui?  Seu rosto demonstra preocupação.\n\nArthur: Maria, a Fundação… estamos em uma situação crítica.  As doações secaram, e preciso cortar projetos na África.  Não consigo me decidir, não sei o que fazer.  Sinto que estou falhando.\n\nMaria:  (Sorrindo gentilmente)  Arthur, lembre-se do que aprendemos juntos.  A riqueza verdadeira não se encontra em números em uma planilha, mas no impacto que criamos na vida das pessoas.  O dinheiro pode se esgotar, mas a fé e a esperança, jamais.\n\n(Cena:  Montagem rápida mostrando imagens de impacto dos projetos da Fundação na África: crianças sorrindo, comunidades sendo beneficiadas, médicos trabalhando.)\n\nNarrador:  As palavras de Maria ressoaram profundamente no coração de Arthur. Ele lembrou-se da alegria genuína que via nos olhos daquelas crianças, da gratidão nas comunidades ajudadas.\n\n(Cena: Arthur de volta em sua sala de reuniões, mas agora com um olhar diferente.  Ele está no computador, criando uma campanha de arrecadação de fundos.)\n\nArthur (voz em off):  Eu não podia falhar com eles.  Maria tinha razão.  Não era sobre o dinheiro, mas sobre a esperança que estávamos oferecendo.  Precisávamos apenas lembrar as pessoas disso.\n\n(Cena:  Lançamento da campanha.  Imagens de Arthur em entrevistas, nas redes sociais, falando sobre a importância dos projetos na África.  Imagens de pessoas fazendo doações.)\n\nNarrador:  Arthur lançou uma campanha comovente, compartilhando histórias reais de impacto, apelando para o coração das pessoas.  A resposta foi imediata e surpreendente.\n\n(Cena:  Arthur e Maria juntos, olhando imagens de doações chegando, em um tablet.  Sorrisos largos em seus rostos.)\n\nArthur:  Maria, nós fizemos isso.  Conseguimos!  As doações estão chegando em um fluxo constante.  Os projetos na África estão salvos!\n\nMaria:  (Abraçando Arthur)  Eu sabia que você conseguiria, meu filho.  A bondade sempre encontra seu caminho.  Lembre-se, a riqueza verdadeira reside na capacidade de fazer a diferença na vida dos outros.\n\n(Cena final:  Tomada aérea da Fundação Arthur, agora mais vibrante e ativa do que nunca.  Música inspiradora.)\n\nNarrador:  A jornada de Arthur, de milionário solitário a filantropo dedicado, continua.  Sua história, um testemunho de transformação, esperança e a inegável força da fé inabalável.  Uma história que prova que a verdadeira riqueza reside não no que possuímos, mas no que compartilhamos com o mundo.\n\n\n(Cena: Mansão de Arthur, um ano depois. Sofia, radiante e saudável, brinca no jardim com Arthur. Maria observa de longe, um sorriso discreto no rosto.)\n\nNarrador: Um ano se passou.  A campanha de arrecadação de fundos foi um sucesso retumbante, garantindo a continuidade dos projetos africanos e, mais importante, trazendo de volta a esperança para Arthur.  Mas a verdadeira transformação ainda estava por vir.\n\n(Flashback rápido: Sofia na cama do hospital, Arthur desesperado, Maria oferecendo o remédio.)\n\nNarrador: Lembra-se do remédio de Maria?  Aquele extrato de ervas, passado de geração em geração, carregado de fé e esperança?  A ciência nunca explicou sua eficácia, mas para Arthur e Sofia, foi um milagre.\n\n(Cena: Arthur e Sofia no jardim. Arthur abraça Sofia carinhosamente.)\n\nArthur: (Voz rouca de emoção) Sabe, meu amor, eu costumava achar que a riqueza estava nas minhas contas bancárias.  Que o sucesso se media em números. Mas eu estava errado. A verdadeira riqueza está aqui, nos momentos que compartilhamos, na sua saúde, no seu sorriso...\n\n(Sofia abraça Arthur forte.)\n\nSofia: Eu te amo, papai.\n\nNarrador: A recuperação de Sofia foi lenta, mas constante. A fé de Maria, combinada com os cuidados médicos, trouxe resultados extraordinários.  Os exames mostraram uma melhora significativa e, aos poucos, Sofia se recuperou completamente.\n\n(Cena: Arthur e Maria conversam na cozinha. Arthur está preparando um chá.)\n\nArthur: Maria, eu não sei como te agradecer.  Você me ensinou o verdadeiro significado da vida.  A importância da fé, da esperança, e... da simplicidade.\n\nMaria: (Sorrindo)  A vida é um presente, Arthur.  Devemos valorizar cada momento.  A sua generosidade para com os outros também foi uma bênção para você.\n\n(Arthur entrega uma xícara de chá para Maria.)\n\nArthur:  Eu aprendi que o dinheiro pode construir hospitais, mas não pode comprar a saúde de uma filha.  Eu aprendi que a solidão é uma doença pior que qualquer outra.  E aprendi que a verdadeira riqueza está na conexão humana, na generosidade, na compaixão.\n\n(Cena:  Montagem rápida de imagens: Arthur com sua filha, ajudando na instituição de caridade, sorrindo sinceramente, imagens das crianças africanas felizes.)\n\nNarrador: Arthur vendeu parte de seus bens, investindo em projetos de impacto social ainda maiores. Ele criou uma fundação para ajudar outras crianças com doenças raras, inspirada na jornada de Sofia.  Sua mansão continua linda, mas agora é compartilhada com os sorrisos e a energia de sua filha e de muitos outros.\n\n(Cena final: Arthur, Sofia e Maria juntos, caminhando no jardim ao pôr do sol. A câmera faz um zoom suave em seus rostos sorrindo.)\n\nNarrador: A história de Arthur e Sofia nos lembra que a verdadeira riqueza não se encontra em contas bancárias, mas na riqueza das relações humanas, na força da fé e na capacidade de transformação que reside em cada um de nós.  Não importa quão grandes sejam os desafios, a esperança, a fé e o amor podem nos levar a milagres. E você, qual é a sua definição de riqueza? Compartilhe sua história nos comentários!  Não se esqueça de se inscrever no canal e ativar o sininho para não perder os próximos vídeos inspiradores.",
      "chapters": [
        {
          "chapter_number": 1,
          "title": "Capítulo 1",
          "content": "(Inicia com uma cena rápida e dinâmica mostrando imagens de luxo: carros esportivos, iates, uma mansão imponente.  Música dramática e inspiradora de fundo.)\n\n**Narrador (Voz grave e confiante):**  Ele tinha tudo.  Fortuna incalculável, sucesso profissional sem precedentes.  Mas Arthur Miller, o magnata da tecnologia, estava sozinho.  Completamente sozinho.  Até que a doença invadiu sua vida, trazendo consigo um medo terrível que o dinheiro não podia comprar.\n\n(A câmera focaliza Arthur, um homem de meia idade, elegantemente vestido, mas com um olhar cansado e marcado pelas preocupações. Está sentado em sua enorme sala de jantar, sozinho, observando uma foto de uma menina doce e sorridente.)\n\n**Narrador:**  Sofia, sua filha, a luz de seus olhos, foi diagnosticada com uma doença incurável.  Os melhores médicos do mundo deram o mesmo veredito: poucas chances de sobrevivência.  A riqueza que Arthur tanto buscou se tornou um peso insuportável, um cruel lembrete de sua impotência diante da fragilidade da vida.\n\n(A cena muda para um corredor da mansão, mostrando Maria, uma mulher de meia idade, simples e de olhar sereno, limpando o chão com cuidado e dedicação.  Sua expressão é preocupada enquanto observa Arthur à distância.)\n\n**Narrador:**  Enquanto Arthur se afogava na dor e na frustração, Maria, a faxineira de sua mansão, observava tudo em silêncio.  Maria, uma mulher de fé inabalável, carregava em seu coração um segredo ancestral, uma antiga receita passada de geração em geração em sua família. Um remédio natural, capaz de realizar o que a medicina moderna não conseguia.\n\n(Close em Maria, mostrando suas mãos calejadas, mas firmes, segurando um pequeno frasco com ervas secas.  Música suave e emotiva de fundo.)\n\n**Narrador:** A relação entre Arthur e Maria era a mais pura formalidade, a distância entre dois mundos completamente diferentes.  O milionário frio e distante, o homem que construíra seu império com base em dados e algoritmos, e a mulher humilde que encontrava consolo na fé e na simplicidade.  Mas o destino, em sua cruel e inesperada generosidade, estava prestes a unir esses dois mundos de forma surpreendente.\n\n(A cena volta para Arthur, agora mais abatido do que antes, olhando fixamente para a foto de Sofia.  Sua face demonstra o peso da situação, a angústia de um pai impotente.)\n\n**Narrador:** A esperança de Arthur esvaía a cada dia.  A medicina moderna, com toda sua tecnologia e sofisticação, parecia se render diante da doença.  Ele se sentia perdido, preso em um labirinto de incertezas, sem saber para onde se virar.  Sua fortuna, seu sucesso, tudo parecia insignificante diante da iminência da perda.\n\n(A câmera se aproxima de Maria, que observa Arthur com compaixão.  Ela segura o frasco com as ervas, os olhos cheios de determinação.)\n\n**Narrador:** Maria sabia que tinha que fazer algo.  Sua fé, tão forte quanto suas mãos calejadas, a impulsionava.  Ela se aproximou de Arthur, pronta para compartilhar o segredo de sua família, mesmo sabendo que poderia ser rejeitada por um homem tão fechado em seu mundo de luxo e frieza.  Mas, no fundo, Maria acreditava no poder da esperança, na força da fé e no milagre da cura.  A jornada para romper a barreira entre esses dois mundos tão diferentes estava prestes a começar.  E este era apenas o início de uma história que mudaria para sempre a vida de um milionário e sua filha.\n",
          "word_count": 546
        },
        {
          "chapter_number": 2,
          "title": "Capítulo 2",
          "content": "[Cena 1: Mansão de Arthur - Dia]\n\nA câmera acompanha Maria enquanto ela limpa discretamente um canto da imensa sala de estar.  A expressão em seu rosto é de preocupação enquanto observa Arthur, sentado sozinho em uma poltrona de couro, encarando fixamente uma foto de Sofia.  Sua silhueta é envolta por uma aura de desespero.  O silêncio é quebrado apenas pelo suave ruído do aspirador.\n\nMaria se aproxima cautelosamente.  Hesita por um instante, mas finalmente, com um suspiro profundo, fala:\n\nMARIA:  Sr. Miller... eu sei que está sofrendo muito.  E... eu queria lhe oferecer algo.\n\nArthur a ignora, seu olhar fixo na foto.  Maria, com paciência, continua:\n\nMARIA:  É uma receita antiga, da minha família.  Passada de geração em geração.  Dizem que cura...  ajuda em casos como o da Sofia.\n\nArthur se vira bruscamente, um olhar de descrença e irritação em seus olhos.\n\nARTHUR: (voz rouca)  Cura?  A medicina moderna não conseguiu, uma receita de vovó vai resolver?  Não perca seu tempo, Maria.\n\nMARIA:  Não é só uma receita, Sr. Miller.  É... fé.  Esperança.  Não custa tentar, não é?  Imagine... se pudesse ajudar?\n\n[Cena 2: Quarto de Sofia - Dia]\n\nA câmera mostra Sofia na cama, pálida e fraca, conectada a diversos aparelhos médicos.  Seu olhar está cansado, mas um fio de esperança surge em seus olhos ao ver o pai entrar no quarto, pela primeira vez em dias, com um pequeno frasco na mão.\n\nARTHUR: (voz baixa e hesitante)  Sofia… eu… eu tenho algo aqui.  É um remédio… diferente.\n\n[Cena 3: Mansão de Arthur - Montagem]\n\nA montagem mostra a transformação gradual de Arthur.  As cenas intercalam momentos de dúvida e ceticismo com pequenos atos de carinho para com Sofia.  Ele está alimentando-a, lendo para ela, cantando cantigas de ninar.  A música de fundo é suave e inspiradora.  Maria observa tudo de longe, um sorriso discreto em seus lábios.\n\n[Cena 4: Quarto de Sofia - Noite]\n\nPassadas algumas semanas, Sofia está visivelmente melhor.  Seu semblante está mais radiante, suas bochechas coradas.  Arthur a abraça com força, as lágrimas escorrendo por seu rosto.\n\nARTHUR: (voz emocionada)  Obrigado, Maria.  Obrigado por não desistir de nós.\n\n[Cena 5: Jardim da Mansão - Dia]\n\nArthur e Maria conversam num banco do jardim, sob o sol da manhã.  Arthur, completamente transformado, parece mais leve e tranquilo.  Ele não é mais o homem frio e distante.\n\nARTHUR:  Eu nunca entendi… a verdadeira riqueza.  Pensava que era tudo isso… (gesticula em direção à mansão). Mas descobri que a verdadeira riqueza é a felicidade da minha filha, a amizade inesperada… e a esperança.\n\nMARIA: (sorriso sereno)  A fé move montanhas, Sr. Miller.  E às vezes, a simplicidade cura mais que qualquer remédio caro.\n\n[Cena 6: Close nos olhos de Sofia - Dia]\n\nSofia sorri para a câmera, forte e saudável. A música de fundo sobe em tom triunfal.\n\n[Cena 7: Arthur e Sofia juntos - Dia]\n\nPai e filha caminham de mãos dadas, rumo a um futuro incerto, mas cheio de esperança. A câmera faz um zoom para fora, mostrando-os como um ponto de luz em um mundo vasto e complexo. A cena final traz um close da receita de Maria, emoldurada, como um símbolo de fé e cura.\n",
          "word_count": 532
        },
        {
          "chapter_number": 3,
          "title": "Capítulo 3",
          "content": "[INÍCIO DO CAPÍTULO 3]\n\nA melhora de Sofia era gradual, mas inegável.  A cada dia, a pequena Sofia demonstrava mais energia, o sorriso voltava a iluminar seu rosto pálido, e a tosse insistente diminuía.  Arthur, que antes passava horas trancado em seu escritório, agora se encontrava ao lado da cama da filha, lendo histórias e brincando com seus brinquedos.  A frieza em seu olhar havia sido substituída por uma ternura profunda, revelando um pai que finalmente havia encontrado seu caminho de volta para o coração da filha.\n\nMaria, discretamente, observava a transformação de Arthur de seu canto da mansão.  Sua fé na receita ancestral havia sido recompensada, mas o que a enchia de uma alegria ainda maior era a mudança no coração do milionário.  Ela via em seus olhos não mais a dureza do trabalho incessante, mas a suave luz da paternidade e do amor.  A gratidão de Arthur era silenciosa, mas palpável.  Ele a tratava com um respeito que antes era inexistente, oferecendo presentes e palavras de apreço, mas a verdadeira riqueza para Maria era testemunhar a felicidade que havia trazido àquela família.\n\nUm dia, enquanto Sofia dormia tranquilamente, Arthur se aproximou de Maria, a expressão séria no rosto.  \"Maria,\" ele começou, sua voz carregada de emoção, \"eu não sei como agradecer.  Você salvou a minha filha, mas mais que isso, você me salvou também.  Eu estava perdido, cego pela minha ambição, pelo meu trabalho… eu não via o que realmente importava.\"\n\nMaria sorriu, suas mãos calejadas mostrando sinais de um trabalho árduo, mas seus olhos brilhavam com uma luz serena. \"Arthur,\" ela respondeu, \"a cura veio da fé e da esperança, mas também da sua disposição de abrir seu coração.  A verdadeira riqueza está na família, no amor, na generosidade... coisas que o dinheiro não pode comprar.\"\n\nArthur assentiu, seus olhos marejados. Ele a convidou para se sentar e conversaram por horas sobre a vida, sobre suas experiências, seus sonhos e seus arrependimentos.  Arthur compartilhou sua jornada, os altos e baixos de sua carreira, a solidão que o consumia, a culpa que sentia por não ter passado mais tempo com Sofia.  Maria ouvia atentamente, oferecendo palavras de conforto e sabedoria, sem julgamentos.\n\nDias se transformaram em semanas, e a saúde de Sofia se fortaleceu cada vez mais.  Ela voltou a correr e brincar, enchendo a mansão com sua alegria contagiante.  Arthur, por sua vez, se dedicava totalmente à filha, participando de suas atividades, criando memórias inesquecíveis.  Ele até mesmo começou a ajudar Maria em algumas tarefas domésticas, aprendendo a valorizar o esforço físico e o significado do trabalho manual.  A mansão, outrora símbolo de sua solidão e sucesso material, agora pulsava com a vida e o amor de uma família unida.\n\nA recuperação de Sofia não foi apenas física, mas também emocional. A relação pai e filha, antes distante e fria, se tornou um elo inquebrantável, fortalecido pela superação de uma adversidade que os aproximou.  A transformação de Arthur era visível para todos, um renascimento espiritual que o levou a rever seus valores e prioridades. Ele aprendeu que a verdadeira riqueza não estava nos números de sua conta bancária, mas no sorriso da filha e no calor de um abraço.  A receita caseira de Maria não foi apenas uma cura física, mas um catalisador para uma transformação completa e profunda na vida do milionário solitário e na sua visão de mundo.\n[FIM DO CAPÍTULO 3]\n",
          "word_count": 567
        },
        {
          "chapter_number": 4,
          "title": "Capítulo 4",
          "content": "[Cena 1: Ext. Jardim da Mansão – Dia]\n\nSofia corre livremente pelo jardim ensolarado, sua risada ecoando pelo espaço. Arthur, sentado em um banco de madeira, observa-a com um sorriso largo e emocionado. Ele segura uma bola, pronto para jogá-la para ela.  A imagem contrasta drasticamente com as cenas sombrias do início do vídeo.\n\nArthur: (voz suave) Corre, minha pequena. Corre o quanto quiser. Papai está aqui para te pegar.\n\nSofia corre até ele, seus braços abertos.  Arthur a abraça forte, sentindo a leveza e a saúde da filha em seus braços.\n\n[Cena 2: Int. Sala de Estar da Mansão – Dia]\n\nMaria limpa um vaso de flores, enquanto Arthur observa-a com respeito e gratidão. A mansão, antes imponente e fria, agora é aconchegante e cheia de vida.\n\nArthur: Maria, eu não sei como te agradecer. Você salvou a minha filha, você salvou a minha vida.\n\nMaria: (sorrindo)  Arthur, a gratidão é minha.  Ver a felicidade de Sofia me enche o coração.  A cura veio da fé, da esperança e de um pouco de ajuda da natureza.\n\nArthur:  Mas...eu era tão cego.  Tão obcecado com o meu trabalho, com a minha riqueza... Eu quase perdi tudo.\n\nMaria: A vida nos ensina, Arthur. As coisas materiais não são tudo.  A família, o amor, a fé... esses sim são os verdadeiros tesouros.\n\nArthur: Você está certa.  Eu quero ajudar outras famílias, Maria. Quero usar minha fortuna para apoiar pesquisas médicas, para ajudar outras crianças como Sofia. Quero criar uma fundação.\n\nMaria: Essa é uma ideia maravilhosa, Arthur.  Você está usando sua riqueza para fazer o bem, e isso é ainda mais valioso que o ouro.\n\n[Cena 3: Montagem – Várias cenas curtas]\n\nUma montagem rápida mostra Arthur participando de eventos beneficentes, visitando hospitais, e interagindo com crianças doentes. Mostra também Sofia crescendo, feliz e saudável, rodeada do amor de seu pai e de Maria.  Imagens intercaladas mostram Arthur sorrindo, ajudando os outros e abraçando sua filha.\n\n[Cena 4: Int. Sala de Estar da Mansão – Noite]\n\nArthur e Sofia estão sentados no sofá, assistindo a um filme.  Arthur acaricia os cabelos de Sofia, um gesto de carinho que antes era impensável.\n\nSofia: Papai, eu te amo.\n\nArthur: (com os olhos marejados) Eu também te amo, minha pequena.  Mais do que tudo neste mundo.\n\n[Cena 5: Int. Sala de Estar da Mansão – Noite]\n\nArthur está sozinho, contemplando o quadro familiar. A mansão, iluminada, agora reflete a paz e a alegria que reinam em seu interior. Ele sorri, sabendo que encontrou uma riqueza infinitamente maior do que qualquer fortuna material.  A câmera se concentra em seu rosto, expressando profunda gratidão e serenidade.  A música inspiradora soa ao fundo, enquanto o vídeo chega ao fim.\n",
          "word_count": 451
        },
        {
          "chapter_number": 5,
          "title": "Capítulo 5",
          "content": "(Cena: Um ano depois.  Imagens rápidas e vibrantes mostram Sofia brincando num parque, Arthur sorrindo e interagindo com ela, a família reunida em um jantar aconchegante.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que Sofia deu seus primeiros passos rumo à cura.  E a transformação em sua vida, e na vida de Arthur, foi profunda e irreversível.  A pequena Sofia, antes presa a um leito de hospital, hoje corre livremente, sua risada ecoando como um sinônimo de vitória sobre a adversidade.\n\n(Cena: Arthur e Maria conversam no jardim da mansão. Maria sorri, Arthur demonstra gratidão e afeto.)\n\nArthur: Maria, eu não sei como agradecer.  Você salvou a vida da minha filha.  Eu era um homem perdido, cego pela ambição, pela riqueza...  E você, com sua simplicidade e sua fé, me mostrou o verdadeiro caminho.\n\nMaria: (Sorrindo calmamente)  Arthur, a cura de Sofia foi um presente de Deus.  Eu apenas ajudei a abrir o caminho.  A sua fé e o seu amor por ela foram os verdadeiros milagres.\n\n(Cena: Montagem mostrando o trabalho da fundação criada por Arthur.  Crianças sorrindo, médicos atenciosos, Arthur envolvido em atividades da fundação.)\n\nNarrador:  A Fundação Sofia, criada em nome da filha, tornou-se um símbolo de esperança para centenas de crianças doentes.  Arthur, que antes só conhecia o mundo dos negócios, agora encontra realização em ajudar os outros.  Sua riqueza, antes uma prisão, se tornou uma ferramenta para transformar vidas.\n\n(Cena: Arthur visita Sofia no quarto dela. Ele a ajuda a fazer a lição de casa, mostrando ternura e cuidado.)\n\nArthur: (Lendo um livro com Sofia)  Você está crescendo tão rápido, minha pequena.  Sabe, antes, eu perdia todos esses momentos preciosos... esses sorrisos, essas pequenas conquistas.  Eu era um tolo.\n\nSofia: (Abraçando o pai) Eu te amo, papai.\n\n(Cena: Arthur em seu escritório, agora mais simples e acolhedor. Ele olha para uma foto de Sofia e Maria. Um sorriso sereno em seu rosto.)\n\nNarrador: A mansão imponente ainda existe, mas seu significado mudou.  Ela não mais representa solidão e vazio, mas um lar repleto de amor e gratidão.  Arthur aprendeu que a verdadeira riqueza não se encontra em contas bancárias, mas nos laços familiares, na generosidade e na fé inabalável em algo maior que nós mesmos.\n\n(Cena: Maria caminhando pelo jardim da mansão, ao pôr do sol.  A câmera foca em suas mãos, mostrando as rugas e as marcas do tempo, mas com uma expressão de paz e contentamento.)\n\nNarrador: Maria continua sua vida simples, mas carregando a sensação de ter plantado uma semente de esperança que floresceu num jardim de milagres.  Sua fé, sua generosidade, foram o catalisador de uma transformação incrível, provando que a verdadeira riqueza está nos corações bondosos e na capacidade de amar incondicionalmente.\n\n(Cena final: Arthur, Sofia e Maria juntos, sorrindo para a câmera.  Música inspiradora e mensagem final na tela: “A verdadeira riqueza está no amor e na fé. Nunca deixe de acreditar no poder da esperança.”)\n",
          "word_count": 490
        },
        {
          "chapter_number": 6,
          "title": "Capítulo 6",
          "content": "(Cena: Abertura com imagens de Sofia, radiante e brincando em um parque, intercaladas com cenas de Arthur trabalhando na Fundação Sofia, rodeado por crianças e voluntários sorridentes. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou… A pequena Sofia, que outrora lutava contra uma doença incurável, agora corre livremente, um símbolo de esperança e resiliência. A transformação em sua vida espelha a incrível jornada de seu pai, Arthur, o milionário solitário que descobriu o verdadeiro significado da riqueza.\n\n(Cena: Arthur, em seu escritório moderno, mas agora mais acolhedor, revisa relatórios da Fundação Sofia. Um sorriso sincero ilumina seu rosto.)\n\nNarrador: A Fundação Sofia, criada em homenagem à sua filha, se tornou o centro da vida de Arthur.  Ele investiu toda a sua fortuna – ou melhor, *parte* de sua fortuna – em pesquisas médicas, tratamento para crianças necessitadas e, acima de tudo, em proporcionar amor e esperança onde antes só havia desespero.\n\n(Cena: Maria, em sua casa simples e aconchegante, prepara um bolo. Um sorriso sereno em seus lábios.)\n\nNarrador: Maria, a faxineira que um dia compartilhou um segredo ancestral que salvou Sofia, continua sua vida simples e humilde.  Sua fé inabalável permanece seu maior tesouro. Ela visita Sofia e Arthur regularmente, compartilhando momentos de alegria e gratidão.  A relação entre eles transcendeu a de patrão e empregada, transformando-se numa profunda amizade baseada em respeito mútuo e amor incondicional.\n\n(Cena: Uma festa de aniversário de Sofia. Arthur brinca com a filha, Maria observa emocionada, e outros pacientes da Fundação Sofia estão presentes, todos sorrindo e interagindo.  A atmosfera é de pura alegria e esperança.)\n\nNarrador:  A celebração do primeiro aniversário de Sofia após sua recuperação é um marco inesquecível.  Nesse dia, Arthur percebe que a verdadeira riqueza não se mede em dígitos bancários, mas no calor de uma família unida, no amor incondicional e na satisfação de fazer a diferença na vida dos outros.\n\n(Cena: Arthur observa as crianças da Fundação Sofia, olhos marejados, enquanto um voluntário mostra um novo equipamento médico recém-adquirido graças a uma doação significativa de Arthur.)\n\nNarrador:  Arthur compreendeu que o vazio que sentia antes era fruto de sua própria incapacidade de ver além da riqueza material. Ele aprendeu que a verdadeira riqueza reside na generosidade, na capacidade de amar e de ser amado, na fé que move montanhas e na simplicidade de momentos genuínos.\n\n(Cena: Arthur e Maria sentados juntos, num jardim ensolarado, conversando serenamente. Sofia brinca perto deles.)\n\nNarrador:  A história de Arthur e Sofia é um poderoso lembrete: a vida é uma jornada, repleta de desafios e alegrias.  A fé, a esperança e o amor são os pilares que nos sustentam nos momentos mais difíceis, nos guiam em direção à luz e nos mostram que, mesmo em meio às maiores adversidades, a cura – física e espiritual – é possível.  A verdadeira riqueza não está nas coisas que possuímos, mas no impacto positivo que causamos no mundo e nas vidas daqueles que amamos.  A jornada deles nos inspira a buscar a verdadeira riqueza em nossos corações.\n\n(Cena final:  Imagens de Sofia, Arthur e Maria sorrindo para a câmera, com uma mensagem de esperança e gratidão na tela. Música inspiradora.)\n",
          "word_count": 526
        },
        {
          "chapter_number": 7,
          "title": "Capítulo 7",
          "content": "(Cena: Abertura com imagens de crianças brincando em um parque, sorrindo e interagindo em um ambiente vibrante e colorido.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou. A Fundação Sofia floresceu, se tornando um farol de esperança para inúmeras famílias.  A pequena Sofia, radiante e cheia de vida, corre livremente, um testemunho vivo do poder da fé e da generosidade humana. Mas a jornada de Arthur não parou na recuperação de sua filha.  \n\n(Cena: Arthur, visivelmente mais jovem e sereno, senta-se em seu antigo escritório, agora transformado em uma sala aconchegante, repleta de fotos de Sofia e das crianças da Fundação.  Ele observa um mapa do mundo, pontuado por pinos coloridos, representando os projetos da fundação.)\n\nNarrador: O peso da fortuna que outrora o aprisionava agora o impulsionava a fazer a diferença.  Arthur, um homem acostumado a fechar negócios multimilionários, agora negociava sorrisos de crianças e esperanças renovadas para famílias em sofrimento.\n\n(Cena:  Arthur visita um hospital infantil, interagindo carinhosamente com as crianças e seus pais.  Sua interação demonstra compaixão e afeto genuíno.)\n\nNarrador: A Fundação Sofia expandiu seus projetos para além das fronteiras do seu país.  Hospitais, centros de pesquisa e programas de apoio familiar foram implantados em regiões carentes do mundo, levando consigo não apenas recursos materiais, mas também a mensagem de esperança e resiliência que Arthur e Maria haviam aprendido.\n\n(Cena:  Arthur e Maria conversam em um jardim florido, compartilhando um momento de calma e reflexão. Maria sorri serenamente.)\n\nMaria:  Você mudou tanto, Arthur.  A riqueza que você possuía não era nada comparada ao tesouro que você encontrou.\n\nArthur: (sorrindo) Você tinha razão, Maria. A verdadeira riqueza está em cada sorriso de Sofia, em cada vida tocada pela Fundação.  É o amor, a fé... é o legado que quero deixar para o mundo.\n\n(Cena:  Imagens intercaladas de projetos da Fundação Sofia em diferentes partes do mundo, mostrando o impacto positivo em comunidades necessitadas.  Música emotiva e inspiradora.)\n\nNarrador:  Mas o caminho não foi sem desafios. A burocracia, a escassez de recursos em algumas regiões e o desespero de famílias desesperadas testaram a força de Arthur e sua equipe.  Entretanto, a lembrança do olhar esperançoso de Sofia, a força de Maria e a crença no poder da generosidade os mantiveram firmes.\n\n(Cena:  Arthur, em uma reunião da Fundação, discute estratégias para expandir os projetos e garantir a sustentabilidade da instituição.  Ele demonstra liderança e determinação.)\n\nNarrador:  A Fundação Sofia, alimentada pelo altruísmo de Arthur e pela sabedoria ancestral de Maria, continua a transformar vidas, a espalhar esperança e a provar que mesmo a doença mais incurável pode ser superada quando a fé, o amor e a generosidade se unem para vencer.  A história de Arthur e Sofia não é apenas uma história de milagre, mas um testemunho do poder transformador da compaixão humana.\n\n(Cena:  Finaliza com imagens de Sofia brincando com outras crianças na Fundação, Arthur sorrindo ao observá-la, e Maria com um olhar sereno de orgulho.  Música inspiradora e mensagem final na tela:  \"A verdadeira riqueza está em fazer a diferença.\")\n",
          "word_count": 505
        },
        {
          "chapter_number": 8,
          "title": "Capítulo 8",
          "content": "(Cena: Abertura com imagens aéreas de diferentes projetos da Fundação Sofia ao redor do mundo – crianças sorrindo, médicos atendendo, famílias reunidas. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que a pequena Sofia recebeu o milagre de sua cura.  Arthur, o milionário solitário, transformou-se num homem impulsionado por uma força maior do que qualquer riqueza material: o amor incondicional por sua filha.  Mas o caminho da Fundação Sofia não tem sido fácil…\n\n(Cena: Arthur em uma reunião tensa, debatendo com um grupo de executivos em ternos impecáveis.  A atmosfera é carregada.)\n\nExecutivo 1:  Sr. Blackwood, os números não estão batendo.  Precisamos cortar gastos.  A expansão para a África está inviável, no momento.\n\nArthur:  Mas as crianças na África precisam da nossa ajuda tanto quanto as crianças em Nova York!  Não podemos simplesmente desistir delas por causa de um déficit orçamentário.\n\nExecutivo 2:  Temos que ser realistas, Sr. Blackwood.  Os recursos são limitados.\n\n(Cena: Arthur caminha sozinho pelos corredores da Fundação, visivelmente frustrado. Ele pega o telefone e liga.)\n\nArthur (ao telefone):  Maria… preciso te ver.  Preciso de sua ajuda.\n\n(Cena: Arthur e Maria sentados em um jardim tranquilo. Maria sorri calmamente para ele.)\n\nMaria:  Arthur, você está cansado.  Você se esforça demais.\n\nArthur:  Eles querem cortar os projetos na África.  Eles dizem que não há recursos… eu… eu não sei mais o que fazer.  Comecei a sentir que estou falhando.\n\nMaria:  Arthur, lembre-se da lição da Sofia:  Fé.  Esperança.  A verdadeira riqueza não se encontra em números em uma planilha, mas nos corações que você toca.  A semente que você plantou está crescendo, mesmo que demore a florescer.\n\n(Cena: Montagem rápida mostrando os desafios da Fundação – burocracia, falta de recursos, mas também momentos de alegria e sucesso – crianças recuperadas, famílias agradecidas, avanços na pesquisa médica.)\n\nNarrador:  A jornada de Arthur era uma montanha-russa.  Momentos de desespero se misturavam com a imensa alegria de testemunhar a transformação de vidas.  A cada obstáculo, a fé inabalável de Maria o guiava.  Ela lhe lembrava que a verdadeira riqueza estava na generosidade e na compaixão.\n\n(Cena: Arthur participa de um evento beneficente da Fundação, cercado por crianças e famílias.  Seu rosto demonstra paz e realização.)\n\n(Cena: Arthur e Sofia em casa, jogando um jogo de tabuleiro.  Sofia abraça o pai.  A cena é serena e cheia de amor.)\n\nNarrador:  Arthur aprendeu que a riqueza material era apenas uma parte da história.  A verdadeira fortuna residia no impacto positivo que ele tinha sobre a vida dos outros, e na conexão inquebrantável com sua filha e com Maria.  Sua jornada inspirou outros a se unirem à causa, a doar seu tempo e suas riquezas, mostrando que a esperança e a compaixão podem realmente mudar o mundo, um coração de cada vez.  E ele sabia, no fundo do seu coração, que Sofia, Maria e a Fundação continuariam a espalhar a luz da esperança por muitos anos.\n",
          "word_count": 484
        },
        {
          "chapter_number": 9,
          "title": "Capítulo 9",
          "content": "(Cena: Abertura com imagens de Arthur, agora com um visual mais despojado, trabalhando em seu escritório, porém com um semblante mais leve e tranquilo.  Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde o milagre que curou Sofia. A Fundação Arthur, criada em nome da filha, enfrentava novos desafios. Executivos, preocupados com a saúde financeira, pressionavam por cortes de gastos, ameaçando projetos cruciais na África, justamente onde a necessidade era maior.  A pressão era imensa.\n\n(Cena: Arthur, visivelmente frustrado, caminha impacientemente pela sala de reuniões.  Imagens rápidas de gráficos e planilhas.)\n\nNarrador: Arthur sentia a angústia apertando seu peito.  A riqueza que antes lhe trazia segurança, agora parecia um peso insuportável. Ele se lembrava da lição de Maria, a faxineira que havia transformado sua vida.\n\n(Cena: Arthur dirigindo até a casa simples de Maria.  A música muda para um tom mais calmo e reflexivo.)\n\nNarrador:  Procurando consolo e sabedoria, ele busca Maria.  Encontrá-la, sentada em sua varanda, com um chá na mão e um sorriso sereno, era um bálsamo para sua alma perturbada.\n\n(Cena: Arthur e Maria conversando.  Close nos rostos, mostrando emoções genuínas.)\n\nArthur: Maria, eu não sei o que fazer.  A Fundação… está sendo ameaçada.  Eles querem cortar os projetos na África, dizem que não é viável financeiramente.\n\nMaria: (Sorrindo gentilmente) Arthur, lembre-se do que a vida lhe ensinou.  A verdadeira riqueza não se encontra em números em uma planilha.  Está no impacto que você causa no mundo, no sorriso de uma criança, na esperança que você acende no coração de alguém.\n\n(Cena: Montagem de imagens da Fundação Arthur trabalhando na África: crianças sorrindo, médicos atendendo, construção de poços.)\n\nNarrador: As palavras de Maria ecoavam em seus ouvidos.  Ele reconsiderou suas prioridades.  Não se tratava apenas de números, mas de vidas.  Com renovada determinação, Arthur confrontou os executivos da Fundação.\n\n(Cena: Arthur em uma reunião, com uma postura firme e convicta.  Imagens de executivos com expressões hesitantes.)\n\nArthur:  Podemos cortar custos em outros setores, mas os projetos na África são inegociáveis.  São vidas que dependem de nós.  O verdadeiro retorno de nossa Fundação não é financeiro, mas o impacto positivo em milhares de pessoas.\n\n(Cena: Montagem rápida mostrando o trabalho contínuo na África, combinado com notícias de novas doações à Fundação.)\n\nNarrador:  A decisão de Arthur teve consequências positivas.  Apesar dos desafios financeiros, a perseverança e a transparência da Fundação inspiraram novas doações, de pessoas comovidas pela história de Sofia e pelo comprometimento de Arthur com a causa.\n\n(Cena: Arthur e Sofia abraçados, contemplando o pôr do sol.  Música inspiradora retorna.)\n\nNarrador: A jornada de Arthur havia sido transformadora.  Ele aprendeu que a verdadeira riqueza reside no amor, na fé, na compaixão e no impacto positivo em vidas alheias.  A riqueza material era apenas um meio, nunca o fim.  E a lição mais importante?  Às vezes, a cura para a alma vem em um simples chá, compartilhado com uma fé inabalável.\n",
          "word_count": 484
        },
        {
          "chapter_number": 10,
          "title": "Capítulo 10",
          "content": "(Cena: Um escritório amplo e moderno, porém aconchegante. Arthur, agora com um visual mais casual e um semblante sereno, trabalha em seu computador.  Imagens de projetos da Fundação na África passam na tela.  A música de fundo é suave e inspiradora.)\n\nNarrador: Um ano se passou desde o milagre que mudou a vida de Arthur. Sofia está radiante e saudável, correndo pela casa.  Mas os desafios não acabaram. A Fundação Arthur, dedicada a ajudar crianças necessitadas na África, enfrenta uma crise financeira.  Pressões de investidores o forçam a cortar projetos cruciais.\n\n(Cena: Arthur em uma reunião tensa com diretores da Fundação. Rostos preocupados e gráficos mostrando déficit financeiro.)\n\nArthur (voz tensa): Infelizmente, as projeções para este ano são desanimadoras. Para mantermos a Fundação operante, teremos que fazer cortes significativos. A equipe sugere priorizar os projetos com maior retorno financeiro…  eliminar os programas de alfabetização e saúde em regiões remotas.\n\n(Cena: Arthur, sozinho em seu escritório, visivelmente perturbado. Ele olha para uma foto de Sofia e Maria.)\n\nNarrador: Arthur se sente dividido.  Os números lhe pressionam, mas a memória da lição de Maria ecoa em seus ouvidos. Ele lembra da fé inabalável dela, da riqueza que ela encontrou na simplicidade e na generosidade.  Ele sabe que esses projetos, por mais difíceis que pareçam de manter, salvam vidas.\n\n(Cena: Arthur dirigindo em direção à casa humilde de Maria.  A câmera acompanha a paisagem, contrastando a opulência da cidade com a simplicidade do bairro onde Maria mora.)\n\nNarrador:  À procura de orientação, Arthur busca Maria.  A encontra em seu jardim, cuidando de suas plantas.  O reencontro é carregado de afeto e gratidão.\n\n(Cena: Arthur e Maria sentados na varanda ensolarada da casa de Maria, tomando chá. A conversa é tranquila e aconchegante.)\n\nArthur: Maria, eu preciso do seu conselho. A Fundação está em crise.  Me dizem que preciso cortar projetos, que preciso focar no lucro… mas como posso abandonar essas crianças?\n\nMaria (sorrindo gentilmente): Arthur, você se lembra do que te disse? A verdadeira riqueza não está no que você possui, mas no que você faz com o que possui.  O dinheiro pode se esgotar, mas o impacto da sua bondade…  isso permanece.  Essas crianças… elas não são apenas números em um relatório.  São vidas que dependem de você.\n\n(Cena: Arthur reflete, com uma expressão pensativa, enquanto olha para o horizonte. Uma música inspiradora e esperançosa toma conta da cena.)\n\nNarrador: As palavras de Maria o tocam profundamente. Ele entende a verdadeira mensagem.  Arthur retorna à Fundação com uma nova determinação.\n\n(Cena: Arthur na reunião da Fundação, agora com uma postura mais firme e convicta.)\n\nArthur: Eu sei que os números não são favoráveis, mas eu me recuso a sacrificar a missão da Fundação em prol do lucro.  Vamos encontrar outras formas de arrecadar fundos, de mostrar o impacto desse trabalho…Vamos criar uma campanha, contar nossas histórias com mais emoção.\n\n(Cena: Montagem rápida mostrando a campanha da Fundação, Arthur em entrevistas emocionantes, a resposta positiva do público, novas doações chegando.)\n\nNarrador: A decisão corajosa de Arthur inspira outros. Novas doações chegam, empresas se unem à causa.  A fé inabalável de Maria e a determinação renovada de Arthur restauram a esperança e garantem a continuidade dos projetos na África.  A verdadeira riqueza, a riqueza do impacto positivo, prevalece.\n",
          "word_count": 544
        },
        {
          "chapter_number": 11,
          "title": "Capítulo 11",
          "content": "(Cena: Abre com uma tomada aérea da Fundação Arthur, mostrando sua extensão e atividade. Música inspiradora ao fundo.)\n\nNarrador: Um ano se passou desde que Arthur aprendeu a verdadeira lição da riqueza. A Fundação Arthur, símbolo de sua transformação, prosperava, levando esperança e saúde à África. Mas o paraíso não dura para sempre…\n\n(Cena: Corte para Arthur, visivelmente preocupado, em sua sala de reuniões. Documentos espalhados sobre a mesa.)\n\nArthur (voz em off):  Os números eram implacáveis.  Doações diminuíram drasticamente.  A Fundação estava enfrentando uma crise financeira sem precedentes.  Cortar projetos?  Era impensável.  Mas era a única opção que me restava.\n\n(Cena: Arthur em seu carro, dirigindo até a humilde casa de Maria. A paisagem muda, contrastando a riqueza de Arthur com a simplicidade de Maria.)\n\nNarrador: Desesperado, Arthur buscou a sabedoria daquela que o havia guiado por um caminho de redenção: Maria.\n\n(Cena: Interior da casa de Maria.  Ambientes simples, mas aconchegantes e cheios de amor.  Maria sorri para Arthur, oferecendo-lhe chá.)\n\nMaria: Arthur, meu filho, que vento te traz até aqui?  Seu rosto demonstra preocupação.\n\nArthur: Maria, a Fundação… estamos em uma situação crítica.  As doações secaram, e preciso cortar projetos na África.  Não consigo me decidir, não sei o que fazer.  Sinto que estou falhando.\n\nMaria:  (Sorrindo gentilmente)  Arthur, lembre-se do que aprendemos juntos.  A riqueza verdadeira não se encontra em números em uma planilha, mas no impacto que criamos na vida das pessoas.  O dinheiro pode se esgotar, mas a fé e a esperança, jamais.\n\n(Cena:  Montagem rápida mostrando imagens de impacto dos projetos da Fundação na África: crianças sorrindo, comunidades sendo beneficiadas, médicos trabalhando.)\n\nNarrador:  As palavras de Maria ressoaram profundamente no coração de Arthur. Ele lembrou-se da alegria genuína que via nos olhos daquelas crianças, da gratidão nas comunidades ajudadas.\n\n(Cena: Arthur de volta em sua sala de reuniões, mas agora com um olhar diferente.  Ele está no computador, criando uma campanha de arrecadação de fundos.)\n\nArthur (voz em off):  Eu não podia falhar com eles.  Maria tinha razão.  Não era sobre o dinheiro, mas sobre a esperança que estávamos oferecendo.  Precisávamos apenas lembrar as pessoas disso.\n\n(Cena:  Lançamento da campanha.  Imagens de Arthur em entrevistas, nas redes sociais, falando sobre a importância dos projetos na África.  Imagens de pessoas fazendo doações.)\n\nNarrador:  Arthur lançou uma campanha comovente, compartilhando histórias reais de impacto, apelando para o coração das pessoas.  A resposta foi imediata e surpreendente.\n\n(Cena:  Arthur e Maria juntos, olhando imagens de doações chegando, em um tablet.  Sorrisos largos em seus rostos.)\n\nArthur:  Maria, nós fizemos isso.  Conseguimos!  As doações estão chegando em um fluxo constante.  Os projetos na África estão salvos!\n\nMaria:  (Abraçando Arthur)  Eu sabia que você conseguiria, meu filho.  A bondade sempre encontra seu caminho.  Lembre-se, a riqueza verdadeira reside na capacidade de fazer a diferença na vida dos outros.\n\n(Cena final:  Tomada aérea da Fundação Arthur, agora mais vibrante e ativa do que nunca.  Música inspiradora.)\n\nNarrador:  A jornada de Arthur, de milionário solitário a filantropo dedicado, continua.  Sua história, um testemunho de transformação, esperança e a inegável força da fé inabalável.  Uma história que prova que a verdadeira riqueza reside não no que possuímos, mas no que compartilhamos com o mundo.\n",
          "word_count": 533
        },
        {
          "chapter_number": 12,
          "title": "Capítulo 12",
          "content": "(Cena: Mansão de Arthur, um ano depois. Sofia, radiante e saudável, brinca no jardim com Arthur. Maria observa de longe, um sorriso discreto no rosto.)\n\nNarrador: Um ano se passou.  A campanha de arrecadação de fundos foi um sucesso retumbante, garantindo a continuidade dos projetos africanos e, mais importante, trazendo de volta a esperança para Arthur.  Mas a verdadeira transformação ainda estava por vir.\n\n(Flashback rápido: Sofia na cama do hospital, Arthur desesperado, Maria oferecendo o remédio.)\n\nNarrador: Lembra-se do remédio de Maria?  Aquele extrato de ervas, passado de geração em geração, carregado de fé e esperança?  A ciência nunca explicou sua eficácia, mas para Arthur e Sofia, foi um milagre.\n\n(Cena: Arthur e Sofia no jardim. Arthur abraça Sofia carinhosamente.)\n\nArthur: (Voz rouca de emoção) Sabe, meu amor, eu costumava achar que a riqueza estava nas minhas contas bancárias.  Que o sucesso se media em números. Mas eu estava errado. A verdadeira riqueza está aqui, nos momentos que compartilhamos, na sua saúde, no seu sorriso...\n\n(Sofia abraça Arthur forte.)\n\nSofia: Eu te amo, papai.\n\nNarrador: A recuperação de Sofia foi lenta, mas constante. A fé de Maria, combinada com os cuidados médicos, trouxe resultados extraordinários.  Os exames mostraram uma melhora significativa e, aos poucos, Sofia se recuperou completamente.\n\n(Cena: Arthur e Maria conversam na cozinha. Arthur está preparando um chá.)\n\nArthur: Maria, eu não sei como te agradecer.  Você me ensinou o verdadeiro significado da vida.  A importância da fé, da esperança, e... da simplicidade.\n\nMaria: (Sorrindo)  A vida é um presente, Arthur.  Devemos valorizar cada momento.  A sua generosidade para com os outros também foi uma bênção para você.\n\n(Arthur entrega uma xícara de chá para Maria.)\n\nArthur:  Eu aprendi que o dinheiro pode construir hospitais, mas não pode comprar a saúde de uma filha.  Eu aprendi que a solidão é uma doença pior que qualquer outra.  E aprendi que a verdadeira riqueza está na conexão humana, na generosidade, na compaixão.\n\n(Cena:  Montagem rápida de imagens: Arthur com sua filha, ajudando na instituição de caridade, sorrindo sinceramente, imagens das crianças africanas felizes.)\n\nNarrador: Arthur vendeu parte de seus bens, investindo em projetos de impacto social ainda maiores. Ele criou uma fundação para ajudar outras crianças com doenças raras, inspirada na jornada de Sofia.  Sua mansão continua linda, mas agora é compartilhada com os sorrisos e a energia de sua filha e de muitos outros.\n\n(Cena final: Arthur, Sofia e Maria juntos, caminhando no jardim ao pôr do sol. A câmera faz um zoom suave em seus rostos sorrindo.)\n\nNarrador: A história de Arthur e Sofia nos lembra que a verdadeira riqueza não se encontra em contas bancárias, mas na riqueza das relações humanas, na força da fé e na capacidade de transformação que reside em cada um de nós.  Não importa quão grandes sejam os desafios, a esperança, a fé e o amor podem nos levar a milagres. E você, qual é a sua definição de riqueza? Compartilhe sua história nos comentários!  Não se esqueça de se inscrever no canal e ativar o sininho para não perder os próximos vídeos inspiradores.\n",
          "word_count": 513
        }
      ],
      "chapters_generated": 12,
      "estimated_duration": 41.166666666666664,
      "style": "inicio",
      "generation_time": "2025-08-30T23:20:35.764115",
      "partial": false
    }
  },
  "config": {
    "extraction": {
      "enabled": true,
      "method": "yt-dlp",
      "rapidapi_key": ""
    },
    "titles": {
      "enabled": true,
      "provider": "gemini",
      "count": 1,
      "style": "viral",
      "language": "pt-BR",
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "premises": {
      "enabled": true,
      "provider": "gemini",
      "style": "educational",
      "target_audience": "general",
      "word_count": 200,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "scripts": {
      "enabled": true,
      "provider": "gemini",
      "chapters": 12,
      "duration_target": "1-2 hours",
      "include_intro": true,
      "include_outro": true,
      "custom_prompts": false,
      "custom_inicio": "",
      "custom_meio": "",
      "custom_fim": "",
      "detailed_prompt": false,
      "detailed_prompt_text": "",
      "contextual_chapters": true
    },
    "tts": {
      "enabled": false,
      "provider": "kokoro",
      "voice": "af_bella",
      "language": "en",
      "speed": 1,
      "pitch": 1
    },
    "images": {
      "enabled": false,
      "provider": "pollinations",
      "style": "realistic",
      "quality": "high",
      "count_per_chapter": 2,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "video": {
      "enabled": false,
      "resolution": "1920x1080",
      "fps": 30,
      "format": "mp4",
      "include_subtitles": true,
      "transition_duration": 0.5
    },
    "prompts": {
      "titles": {
        "viral": "Crie títulos virais e envolventes para o vídeo sobre: {topic}. Os títulos devem ser chamativos, despertar curiosidade e incentivar cliques.",
        "educational": "Crie títulos educacionais e informativos para o vídeo sobre: {topic}. Os títulos devem ser claros, diretos e indicar o valor educacional.",
        "professional": "Crie títulos profissionais e sérios para o vídeo sobre: {topic}. Os títulos devem transmitir autoridade e credibilidade."
      },
      "premises": {
        "narrative": "Crie uma premissa narrativa envolvente para um vídeo sobre: {title}. A premissa deve contar uma história cativante em aproximadamente {word_count} palavras.",
        "educational": "Crie uma premissa educacional estruturada para um vídeo sobre: {title}. A premissa deve apresentar os pontos de aprendizado em aproximadamente {word_count} palavras.",
        "informative": "Crie uma premissa informativa e objetiva para um vídeo sobre: {title}. A premissa deve apresentar fatos e informações relevantes em aproximadamente {word_count} palavras."
      },
      "scripts": {
        "inicio": "# Prompt — Início\n\nEscreva uma narrativa de {genre} intitulada \"{title}\".\n\nPremissa: {premise}\n\nEste é o INÍCIO da história. Deve estabelecer:\n- Personagens principais e suas motivações\n- Cenário e atmosfera da história\n- Conflito principal que moverá a narrativa\n- Tom inicial da narrativa\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na descrição de cenários, personagens, ações e diálogos.",
        "meio": "# Prompt — Meio\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEsta é a continuação do MEIO da história. Deve:\n- Continuar a narrativa de forma orgânica e coerente\n- Desenvolver os personagens e suas relações\n- Intensificar o conflito principal\n- Adicionar novos elementos de tensão\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso. Cada capítulo deve ter conteúdo substancial e rico em detalhes.",
        "fim": "# Prompt — Fim\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEste é o FIM da história. Deve:\n- Resolver o conflito principal estabelecido no início\n- Proporcionar conclusão satisfatória para todos os personagens principais\n- Entregar o clímax esperado da história\n- Fechar a história de forma impactante\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na conclusão. Garanta um fechamento rico e satisfatório."
      },
      "images": {
        "cinematic": "Crie uma descrição cinematográfica para uma imagem que represente: {scene_description}. A imagem deve ter qualidade cinematográfica, boa iluminação e composição profissional.",
        "minimalist": "Crie uma descrição minimalista para uma imagem que represente: {scene_description}. A imagem deve ser limpa, simples e com foco no elemento principal.",
        "artistic": "Crie uma descrição artística para uma imagem que represente: {scene_description}. A imagem deve ser criativa, expressiva e visualmente impactante."
      }
    }
  },
  "progress": {},
  "version": "1.0"
}