{
  "pipeline_id": "77275ed3-1627-4818-a8c0-34b9f0719db1",
  "timestamp": "2025-08-22T20:28:24.524840",
  "current_step": "tts",
  "completed_steps": [
    "extraction",
    "titles",
    "premises",
    "scripts"
  ],
  "results": {
    "extraction": {
      "channel_info": {},
      "titles": [
        {
          "video_id": "QrB5i_W-Igs",
          "title": "Danny K - Outdacontrol",
          "description": "© 2007 WMG\nOutdacontrol",
          "thumbnail": "",
          "duration": "231.0s",
          "views": 1009,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=QrB5i_W-Igs"
        }
      ],
      "total_extracted": 1,
      "method_used": "auto",
      "extraction_time": "2025-08-22T20:26:19.386553"
    },
    "titles": {
      "generated_titles": [
        "Danny K - Outdacontrol: A LOUCURA que você PRECISA ver! (7 Dias de Gravações INSANAS!)",
        "Danny K - Outdacontrol: Os 7 Segredos Explosivos que Você PRECISA Ver!",
        "Danny K - Outdacontrol: A FESTA que você NÃO pode perder! (VÍDEO CHOCANTE!)",
        "Danny K - Outdacontrol: Os 7 Segredos Que Vão Te Deixar de Queixo Caído!",
        "Danny K - Outdacontrol: A FESTA que VOCÊ PRECISA VER! (IMPERDÍVEL!)"
      ],
      "source_titles_count": 1,
      "provider_used": "gemini",
      "style": "viral",
      "generation_time": "2025-08-22T20:26:26.111407"
    },
    "premises": {
      "selected_title": "Danny K - Outdacontrol: A LOUCURA que você PRECISA ver! (7 Dias de Gravações INSANAS!)",
      "premise": "Prepare-se para uma semana de pura adrenalina com Danny K em \"Outdacontrol\"! Este documentário imersivo acompanha o artista em sete dias de gravações insanas, revelando os bastidores de sua produção musical explosiva.  O público-alvo são fãs de Danny K, entusiastas de música urbana e aqueles que apreciam conteúdo “behind the scenes” com muita energia e ação. O tom é frenético e excitante, com edição rápida e dinâmica, mostrando a loucura criativa e a dedicação intensa envolvidas na criação de sua música.  Vamos testemunhar a construção de batidas memoráveis, sessões de gravação eletrizantes, momentos de improvisação genial e as inúmeras dificuldades superadas durante o processo.  O vídeo mostrará a jornada completa, desde a concepção das ideias até a finalização das tracks, incluindo entrevistas com Danny K e sua equipe, revelando os desafios, as conquistas e a paixão que alimentam seu trabalho.  Prepare-se para momentos de humor, tensão e muita música, culminando num épico \"making of\" que vai te deixar com vontade de ouvir o álbum inteiro imediatamente após o término do vídeo.  Um mergulho visceral no universo de Danny K, mostrando que para criar algo excepcional, é preciso se jogar de cabeça na loucura!\n",
      "word_count": 193,
      "provider_used": "gemini",
      "generation_time": "2025-08-22T20:26:28.468196"
    },
    "scripts": {
      "title": "Danny K - Outdacontrol: A LOUCURA que você PRECISA ver! (7 Dias de Gravações INSANAS!)",
      "premise": "Prepare-se para uma semana de pura adrenalina com Danny K em \"Outdacontrol\"! Este documentário imersivo acompanha o artista em sete dias de gravações insanas, revelando os bastidores de sua produção musical explosiva.  O público-alvo são fãs de Danny K, entusiastas de música urbana e aqueles que apreciam conteúdo “behind the scenes” com muita energia e ação. O tom é frenético e excitante, com edição rápida e dinâmica, mostrando a loucura criativa e a dedicação intensa envolvidas na criação de sua música.  Vamos testemunhar a construção de batidas memoráveis, sessões de gravação eletrizantes, momentos de improvisação genial e as inúmeras dificuldades superadas durante o processo.  O vídeo mostrará a jornada completa, desde a concepção das ideias até a finalização das tracks, incluindo entrevistas com Danny K e sua equipe, revelando os desafios, as conquistas e a paixão que alimentam seu trabalho.  Prepare-se para momentos de humor, tensão e muita música, culminando num épico \"making of\" que vai te deixar com vontade de ouvir o álbum inteiro imediatamente após o término do vídeo.  Um mergulho visceral no universo de Danny K, mostrando que para criar algo excepcional, é preciso se jogar de cabeça na loucura!\n",
      "script": "Capítulo 1: ## Outdacontrol: A LOUCURA que você PRECISA ver! -...\n\n## Outdacontrol: A LOUCURA que você PRECISA ver! - Roteiro (Parte 1)\n\n**Duração estimada:** 5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**Ambiente:** Galpão industrial em São Paulo, transformado em estúdio improvisado.  Fios elétricos pendurados por todos os lados, equipamentos de gravação espalhados, sofás rasgados, latas de refrigerante vazias e cinzeiros cheios. O ar está denso de fumaça de cigarro e suor.  Luzes estroboscópicas pulsantes iluminam o espaço, criando uma atmosfera frenética.\n\n**Personagens:**\n\n* **Danny K (Caio Oliveira):** 28 anos, rapper explosivo, olhos vermelhos e expressão concentrada. Usa roupas largas e uma corrente de ouro.\n* **DJ Zé:** 35 anos, DJ e produtor musical, calmo e observador.\n* **Bia:** 25 anos, assistente de Danny K, organizada e eficiente, apesar do caos ao redor.\n\n**Ação:** Danny K está em plena sessão de improvisação, recitando rimas furiosas sobre um beat pesado.  Sua energia é contagiante, Zé acompanha no beat, Bia filma com uma GoPro, registrando cada momento.  A câmera se move rapidamente, alternando entre close-ups de Danny K, planos gerais do estúdio e detalhes dos equipamentos. A trilha sonora é a batida frenética da música em produção, intercalada com sons ambiente do estúdio (batidas pesadas, ruídos de equipamentos, etc.).\n\n**Diálogos:**\n\n**(Som ambiente intenso da música.  A voz de Danny K é abafada pelos graves)**\n\n**Danny K:** (Rapeado, com velocidade e intensidade) \"...cidade cinza, coração em brasa...  fogo no asfalto, alma em pedaços...  fora do controle, essa é a regra...\"\n\n**(A batida para bruscamente. Silêncio absoluto, quebrado apenas pelo som pesado da respiração de Danny K)**\n\n**Danny K:** (Irritado) Que porra foi essa?!\n\n\n**Cena 2:** (1:00-2:30)\n\n**Ambiente:** Mesma localização.  A energia está cortada.  Danny K, Zé e Bia estão em volta da caixa de fusíveis, em meio a um caos organizado de fios e equipamentos desligados.\n\n**Ação:** A câmera acompanha o olhar de Danny K enquanto ele examina a caixa de fusíveis.  Bia liga a lanterna do celular, revelando um pequeno bilhete preso com fita adesiva.  Zé tenta acionar os disjuntores sem sucesso. A expressão de Danny K muda de irritação para preocupação.  Bia tira o bilhete e, com a lanterna, tenta decifrar a mensagem escrita em código.\n\n**Diálogos:**\n\n**Danny K:** Sabotagem?!  Alguém fez isso de propósito?!\n\n**Zé:** Parece que sim, Caio.  Não é uma simples queda de energia. Os disjuntores estão intactos.  Alguém cortou o suprimento diretamente na rua.\n\n**Bia:** (Lendo o bilhete) \"O som do silêncio é mais alto que mil explosões.  Outdacontrol não vai acontecer.\"  Que merda é essa?  Um código?\n\n**Danny K:** Tem que ter um significado.  Essa mensagem... é uma ameaça.\n\n\n**Cena 3:** (2:30-4:00)\n\n**Ambiente:** Uma mistura de imagens: Bia tentando decifrar o código em seu computador, Danny K olhando para o bilhete com uma mistura de raiva e medo, Zé examinando os equipamentos procurando por falhas de segurança.  A trilha sonora é mais tensa, com samples de ruídos eletrônicos e um baixo pesado.\n\n**Ação:**  Montagem dinâmica mostrando a equipe em ação: Bia pesquisa online sobre códigos secretos, Zé revisa as câmeras de segurança (sem sucesso), Danny K liga para alguns de seus contatos, tentando descobrir a origem da ameaça.  A câmera se concentra nos rostos dos personagens, transmitindo a crescente tensão.\n\n**Diálogos:**\n\n**Danny K:** (Ao telefone, voz tensa)  ...não, cara, não foi um acidente... alguém sabotou a gravação...  sim, tem uma mensagem cifrada... não sei o que significa...\n\n\n**(Bia encontra um padrão no código)**\n\n**Bia:** Acho que decifrei parte da mensagem!  Parece um anagrama!\n\n\n**Cena 4:** (4:00-5:00)\n\n**Ambiente:** Danny K sentado em um sofá rasgado, no meio do estúdio, olhando para o telefone com uma expressão de incerteza. O cenário se torna mais escuro, mais sombrio. A trilha sonora se torna ominosa, com batidas pesadas e sons de suspense.\n\n**Ação:** Danny K recebe uma ligação anônima.  Ele atende, mas a câmera não mostra quem está do outro lado.  A voz é apenas um sussurro ameaçador, incompreensível. A ligação é interrompida.  Danny K fica olhando para o telefone, sua expressão é de total incerteza e medo.\n\n**Diálogos:**\n\n**(Som de telefone tocando.  Danny K atende)**\n\n**(Voz sussurrante e distorcida, inaudível para o público)**\n\n**(Ligação interrompida.  Som de silêncio pesado)**\n\n\n**Danny K:** (Para si mesmo, com a voz baixa e tensa)  Quem foi esse? O que eles querem?\n\nCapítulo 2: ## Outdacontrol: Capítulo 1 - Blackout\n\n**[Cena 1]...\n\n## Outdacontrol: Capítulo 1 - Blackout\n\n**[Cena 1]**\n\n**INT. GALPÃO INDUSTRIAL - NOITE**\n\nO galpão pulsa.  Luzes estroboscópicas azuis e vermelhas pintam sombras frenéticas nas paredes de concreto nu.  Fios elétricos se cruzam como veias expostas, alimentando um amontoado de equipamentos de gravação improvisado. O ar é denso, saturado com a fumaça de inúmeros cigarros e o suor de uma equipe exausta, mas eletrizada.  No centro do caos, CAIO OLIVEIRA (20s, Danny K),  com olhos vermelhos inchados e uma energia quase palpável, está imerso em uma sessão de freestyle furiosa.  Seu flow é um turbilhão de rimas cruas e agressivas, a voz rouca cortando o ritmo frenético da batida.  A cada sílaba, ele se move como um animal enjaulado, sua energia transbordando.  Seu produtor, MARCELO (30s, rosto cansado, mas focado), acompanha cada movimento com uma expressão de fascínio e apreensão.  Dois técnicos de som, ANA (20s, concentrada) e PEDRO (25s, nervoso), monitoram os níveis de áudio, seus rostos iluminados pela tela dos computadores.\n\n**CAIO (gritando sobre a música):** ...e essa porra de cidade me engole, mas eu cuspo de volta na cara dela, entende?  Eu sou o monstro, a fera, a tempestade!\n\nA batida explode em um climax.  Caio para de repente, ofegante, o suor escorrendo pelo rosto.  Um silêncio abrupto cai sobre o estúdio.  Marcelo sorri, satisfeito.  Então, as luzes piscam e morrem.  Um silêncio pesado desce, interrompido apenas pelo zumbido dos computadores que se desligam lentamente.\n\n**MARCELO:** Caralho!  Que porra foi essa?\n\n**ANA:** A energia caiu, cara.  Não era pra acontecer.\n\n**PEDRO:**  A caixa de fusíveis...  Eu vou ver.\n\nPedro sai apressadamente em direção a uma caixa de metal enferrujada no canto do galpão.  Ele volta alguns minutos depois, pálido e segurando um pequeno pedaço de papel dobrado.\n\n**PEDRO:** Tem um bilhete aqui...  E parece que alguém mexeu nos fios.  Isso não foi acidente.\n\n\n**[Cena 2]**\n\n**INT. GALPÃO INDUSTRIAL - CONTINUAÇÃO**\n\nA equipe se reúne em volta de Pedro, observando o papel.  É uma mensagem escrita em uma caligrafia elegante, quase artística.  Números e símbolos enigmáticos se entrelaçam, formando um código.\n\n**CAIO:**  Sabotagem?  Alguém quer foder com meu álbum?\n\n**MARCELO:**  Precisa decifrar isso primeiro.  Tem que ser alguém de dentro...\n\nA irritação de Caio se transforma em uma raiva fria.  A possibilidade de alguém sabotar seu trabalho, tão próximo do lançamento de seu álbum, o deixa furioso. Ele sente a adrenalina pulsar no sangue.\n\n**CAIO:**  Não. Não pode ser.  Esse álbum... anos de trabalho, sangue, suor...\n\n**ANA:**  Calma, Caio.  Vamos pensar.  Temos que encontrar quem fez isso antes que...\n\nAna para, olhando para a caixa de fusíveis.  Uma pequena quantidade de pó branco está espalhada em torno dela.\n\n**ANA:** Droga.  Isso é... uma droga poderosa.  Não mexe, Pedro.\n\n\n**[Cena 3]**\n\n**INT. GALPÃO INDUSTRIAL - MAIS TARDE**\n\nHoras se passam.  A equipe tenta decifrar o código enquanto Caio caminha pela sala, inquieto.  A tensão é palpável.  Telefonemas para eletricistas e técnicos são feitos, sem sucesso.  Restaurar a energia vai demorar.  A escolha se torna clara: investigar ou seguir adiante com as gravações usando geradores.  O debate é acalorado, cada membro tem suas opiniões sobre qual decisão será melhor para o lançamento.\n\n\n**[Cena 4]**\n\n**INT. GALPÃO INDUSTRIAL - NOITE**\n\nCaio está sentado sozinho, esgotado, em frente ao seu computador, quando seu telefone toca.  Ele atende, um tremor na voz.  Uma voz rouca, distorcida, sussurra do outro lado da linha.\n\n**VOZ (distorcida):**  Outdacontrol...  está fora de controle, Danny K...\n\nA linha cai.  Caio olha para o telefone, o silêncio no galpão mais pesado que antes.  A ameaça é real.  Ele não sabe quem o está atacando, mas sabe que a luta para lançar seu álbum acabou de se tornar muito mais perigosa.\n\n\n**[FIM DO CAPÍTULO 1]**\n\nCapítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: Código Decifrado, Ameaça Revelada\\n\\nNo galpão industrial, a atmosfera é carregada de tensão. A energia voltou, mas a calma não. O ar ainda pesa com o cheiro de suor, cigarro e a lembrança da interrupção abrupta.  Caio, Danny K, olhos fundos e marcados pela exaustão e pela raiva contida, examina o bilhete misterioso.  A equipe, composta por DJ Zé, o produtor musical; Bia, a empresária; e Leo, o engenheiro de som, se reúne em torno dele. O bilhete, rabiscado em tinta vermelha, contém uma série de símbolos estranhos que parecem códigos de programação misturados com caracteres rúnicos. \\n\\nLeo, com sua experiência em tecnologia, nota a semelhança de alguns símbolos com códigos de criptografia usados em jogos online. Após horas de decifração, usando um software especializado e um manual de criptografia que ele mantinha consigo,  consegue decifrar parcialmente a mensagem. A mensagem se torna clara aos poucos: \\\"O ritmo será silenciado.  A fúria será contida.  A verdade está na mixtape perdida de 2014.  O tempo está se esgotando\\\". A última frase está escrita em uma caligrafia diferente, muito mais elaborada, e ainda indecifrável.\\n\\nBia, visivelmente preocupada, levanta a questão de como prosseguir.  As gravações estão atrasadas, e a pressão do selo é enorme.  A decisão de priorizar a investigação da sabotagem, mesmo que custe tempo e recursos valiosos, divide a equipe. Zé, obcecado pela perfeição sonora de \\\"Outdacontrol\\\", argumenta pela continuação das gravações, sugerindo que podem resolver o mistério paralelamente. Caio, apesar da fúria e da frustração, apoia a investigação. A menção da \"mixtape perdida de 2014\" atiça sua curiosidade e paranoia.  Essa mixtape, contendo algumas faixas experimentais e demos, era algo que ele considerava perdido para sempre, um segredo que ele acreditava ter sido esquecido.\\n\\nLeo encontra um link oculto no código decifrado, levando-os para um site obscuro na deep web.  O site contém vídeos antigos de performances de Caio, imagens da sua antiga equipe e um áudio perturbador, um loop contínuo de um sussurro ameaçador: \\\"A vingança é um prato que se come frio... Danny K.\\\"\\n\\nA busca pela mixtape perdida é iniciada.  A equipe vasculha o antigo estúdio de Caio, caixas cheias de equipamentos e discos rígidos empoeirados.  Durante a procura, eles encontram um pendrive antigo, aparentemente descartado.  Ao conectar o pendrive a um computador, uma mensagem surge na tela: \\\"Sua música será o seu enterro.\\\"  Um novo código, mais complexo, aparece na sequência.  O pânico aumenta.  Enquanto isso, uma nova ligação anônima chega ao celular de Caio. Desta vez, a voz não é um sussurro, mas um grito distorcido, repleto de fúria e raiva.  A ligação é interrompida, mas a mensagem está clara: A ameaça é real, e muito mais próxima do que imaginavam.  A busca pela verdade leva a uma conclusão alarmante: a sabotagem pode estar vindo de dentro da própria equipe. A cena termina com Caio olhando fixamente para cada membro da equipe, a desconfiança e a tensão pintando seus olhos vermelhos.\\n\\n\"\n    }\n  ]\n}\n```\n\nCapítulo 4: ## Outdacontrol - Capítulo 3: A Sombra do Enigma\n\n...\n\n## Outdacontrol - Capítulo 3: A Sombra do Enigma\n\n**[Cena 1: Galpão Industrial - Noite - Duração: 1 minuto]**\n\nO galpão pulsa com uma energia frenética, apesar da escuridão. Velas e lanternas improvisadas iluminam cantos do estúdio, lançando sombras longas e dançantes nas paredes de concreto. O ar, denso de fumaça e suor, agora carrega também o cheiro metálico de fios elétricos queimados. Caio Oliveira, Danny K, com o rosto cansado mas determinado, está cercado por sua equipe.  A frustração é palpável.  A energia voltou, gracas a um gerador barulhento alugado às pressas, mas o clima mudou.  A música, antes um rio impetuoso de criatividade, agora é um riacho hesitante.\n\nBeatriz, a engenheira de som, examina a caixa de fusíveis com uma lanterna.  Seu olhar severo revela a gravidade da situação.  Ao lado dela, Rafael, o produtor musical, passa nervosamente a mão nos cabelos.\n\n**RAFAEL:** (Sussurrando) Sabotagem. Sem dúvidas.  Alguém queria interromper tudo.\n\n**BEATRIZ:** (Séria) O corte foi preciso.  Não foi uma simples falha.  Alguém conhecia o sistema.\n\nCaio, encostado numa pilha de caixas, examina o bilhete que Beatriz encontrou.  É um pedaço de papel amassado com símbolos estranhos, uma sequência aparentemente aleatória de letras e números, interrompida por um desenho rudimentar de uma nota musical com um X atravessado.\n\n**DANNY K:** (Voz rouca) O que isso significa?\n\n**RAFAEL:** (Lendo o bilhete) Não faço ideia. Parece... uma cifra.  Mas para que?\n\n**[Cena 2: Galpão Industrial - Flashback - Duração: 1 minuto 30 segundos]**\n\nUm flashback mostra momentos da semana anterior,  fragmentos de conversas e interações de Caio com sua equipe, e com outros indivíduos presentes durante as gravações:  um empresário sorridente,  uma backing vocal enigmática, um beatmaker misterioso, todos com expressões ambíguas e passagens rápidas.  A edição rápida cria uma sensação de suspense, plantando sementes de desconfiança em cada um dos personagens.  São imagens curtas, sugestões que deixam a dúvida pairar sobre a identidade do sabotador.\n\n**[Cena 3: Galpão Industrial - Noite - Duração: 2 minutos]**\n\nDe volta ao presente,  a equipe tenta decifrar o código.  Rafael, com a ajuda de Beatriz, consulta livros de criptografia online, enquanto Caio observa, inquieto.  A atmosfera é tensa.  A cada tentativa frustrada, o pessimismo cresce.  A hipótese de que o sabotador seja alguém próximo à equipe começa a ganhar força.\n\n**DANNY K:**  (Com raiva) Isso não pode acontecer!  O lançamento está próximo!  Temos que descobrir quem fez isso!\n\n**BEATRIZ:**  Temos que decidir.  Continuamos com as gravações, ou nos dedicamos à investigação?  Se continuarmos, precisamos de mais energia e isso significa mais dinheiro.  E tempo...\n\n**RAFAEL:**  Se o sabotador está próximo, continuar aqui é arriscado.  As informações podem vazar, a sabotagem pode acontecer novamente...\n\n\n**[Cena 4: Galpão Industrial - Noite - Duração: 1 minuto 30 segundos]**\n\nDe repente, o celular de Caio toca. Uma chamada anônima. Ele atende, o medo em seu olhar se tornando visível.\n\n**DANNY K:** (No telefone, voz baixa e tensa) Alô? Quem é?  O que você quer?\n\nUm sussurro rouco e ameaçador é ouvido, uma voz distorcida que murmura palavras ininteligíveis, intercaladas por ruídos estranhos. A imagem da tela do celular mostra um número desconhecido, mas ao fundo, é possível distinguir uma melodia distorcida e familiar - um trecho de uma música do seu próprio álbum.\n\nA ligação é abruptamente encerrada.  Caio permanece imóvel, o medo e a angústia estampados em seu rosto. O suspense paira no ar. O bilhete, o código indecifrável, a ligação anônima... tudo aponta para uma ameaça iminente, com a identidade do inimigo ainda escondida nas sombras. A semana de gravações está longe de acabar, mas a verdadeira batalha agora é contra um inimigo invisível, determinado a silenciar a música de Danny K.\n\nCapítulo 5: ## Outdacontrol: A LOUCURA que você PRECISA ver! -...\n\n## Outdacontrol: A LOUCURA que você PRECISA ver! - Roteiro (Parte Final)\n\n**Tempo estimado:** 4-6 minutos\n\n**(Cena: Galpão Industrial - Noite. A atmosfera é tensa, a iluminação precária, apenas algumas lâmpadas fluorescentes ziguezagueando no teto. Caio, exausto, mas determinado, observa a equipe tentando religar os equipamentos. O caos controlado da sessão anterior deu lugar a uma busca frenética por soluções.)**\n\n**Som:** Música ambiente tensa, com batidas de fundo irregulares, refletindo a situação.\n\n**CAIO (V.O.):**  Sete dias. Sete dias de pura insanidade.  A gente achou que a maior loucura era a produção em si, a pressão, a correria... mas a gente estava enganado. A verdadeira loucura estava por vir.\n\n**(Flashback rápido mostrando os momentos tensos da semana:  a energia caindo, a descoberta do bilhete, a equipe dividida, discussões acaloradas, rostos cansados e preocupados.)**\n\n**(Cena:  Close no bilhete misterioso. A câmera focaliza os símbolos cifrados, criando uma atmosfera enigmática.)**\n\n**MARCIA (Produtora, estressada):**  A gente decifrou algumas partes do código...  Parece ser uma sequência de coordenadas...  Mas coordenadas para quê?\n\n**RAFAEL (Técnico de som, frustrado):**  E essa ameaça velada... \"O ritmo vai parar.\"  O que isso significa?  Será que vão sabotar de novo?\n\n**(Caio observa, rolando um cigarro nervosamente.  Sua expressão demonstra dúvida e preocupação.)**\n\n**CAIO:**  Não podemos deixar que eles nos paralisem.  A gente tem que terminar esse álbum. \"Outdacontrol\" não pode ser contido.\n\n**(Cena:  Montagem rápida mostrando a equipe trabalhando incansavelmente:  um programador tentando rastrear o IP da mensagem anônima, Marcia fazendo ligações, Rafael testando equipamentos com cuidado, enquanto outros membros da equipe procuram discretamente por câmeras escondidas ou dispositivos suspeitos no galpão.)**\n\n**(Cena:  Caio no centro do galpão, rodeado por sua equipe, olhando para um mapa de São Paulo com as coordenadas marcadas.  A tensão é palpável.)**\n\n**CAIO:**  Essas coordenadas...  levam para um prédio abandonado na zona leste.  Precisamos ir lá.\n\n**(Cena:  A equipe, armada com lanternas e um pouco de coragem, explora o prédio abandonado. A escuridão e a decadência do lugar criam uma atmosfera tensa e opressiva.  Eles encontram um estúdio de gravação improvisado e dilapidado, com equipamentos antigos e danificados.)**\n\n**(Cena:  Close em um gravador antigo com uma fita cassete dentro.  A fita está parcialmente danificada.)**\n\n**MARCIA:**  Essa fita...  tem algo escrito aqui: \"A verdade sobre Danny K\".\n\n**(A equipe ouve a fita.  São gravações antigas de Caio, revelando segredos do passado, rivalidades esquecidas, antigos contratos e negociações problemáticas, todos elementos que apontam para um inimigo com um grande motivo para sabotá-lo.)**\n\n**(Cena:  Flashback mostrando breves momentos que revelam pistas sobre a identidade do inimigo – um rosto parcialmente oculto, um objeto específico que aparece repetidamente nas cenas, uma silhueta ameaçadora.)**\n\n**(Cena:  De volta ao galpão.  A equipe está reunida, com o quebra-cabeça quase completo.  A identidade do inimigo é revelada: um ex-sócio de Caio que sente inveja pelo sucesso alcançado.)**\n\n**CAIO (V.O.):** A verdade sempre vem à tona. E a justiça, por mais tardia que seja, sempre alcança quem a merece.\n\n**(Cena:  A equipe se prepara para o lançamento do álbum.  O clima de tensão se transforma em um misto de excitação e alívio.  O vídeo mostra cenas da festa de lançamento do álbum, com flashes de público vibrante e Caio no palco, radiante.)**\n\n**(Cena final: Caio sozinho no estúdio, olhando para o álbum finalizado, com a capa que retrata a jornada difícil que culminou na obra. Um sorriso de conquista e alívio em seu rosto.)**\n\n**CAIO (V.O.):**  \"Outdacontrol\" não é só um álbum. É uma história. A história de sete dias de loucura, de superação, e da luta contra a sabotagem e o medo.  É a prova de que, quando você se joga de corpo e alma em seus sonhos, você sempre vai superar qualquer obstáculo.  E agora… ouça!\n\n\n**(Cena final:  A tela exibe a capa do álbum \"Outdacontrol\", com a data de lançamento e as plataformas de streaming.  Os créditos finais rolam, acompanhados por uma música do álbum, finalizando com impacto.)**",
      "chapters": [
        {
          "chapter_number": 1,
          "title": "Capítulo 1: ## Outdacontrol: A LOUCURA que você PRECISA ver! -...",
          "content": "## Outdacontrol: A LOUCURA que você PRECISA ver! - Roteiro (Parte 1)\n\n**Duração estimada:** 5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**Ambiente:** Galpão industrial em São Paulo, transformado em estúdio improvisado.  Fios elétricos pendurados por todos os lados, equipamentos de gravação espalhados, sofás rasgados, latas de refrigerante vazias e cinzeiros cheios. O ar está denso de fumaça de cigarro e suor.  Luzes estroboscópicas pulsantes iluminam o espaço, criando uma atmosfera frenética.\n\n**Personagens:**\n\n* **Danny K (Caio Oliveira):** 28 anos, rapper explosivo, olhos vermelhos e expressão concentrada. Usa roupas largas e uma corrente de ouro.\n* **DJ Zé:** 35 anos, DJ e produtor musical, calmo e observador.\n* **Bia:** 25 anos, assistente de Danny K, organizada e eficiente, apesar do caos ao redor.\n\n**Ação:** Danny K está em plena sessão de improvisação, recitando rimas furiosas sobre um beat pesado.  Sua energia é contagiante, Zé acompanha no beat, Bia filma com uma GoPro, registrando cada momento.  A câmera se move rapidamente, alternando entre close-ups de Danny K, planos gerais do estúdio e detalhes dos equipamentos. A trilha sonora é a batida frenética da música em produção, intercalada com sons ambiente do estúdio (batidas pesadas, ruídos de equipamentos, etc.).\n\n**Diálogos:**\n\n**(Som ambiente intenso da música.  A voz de Danny K é abafada pelos graves)**\n\n**Danny K:** (Rapeado, com velocidade e intensidade) \"...cidade cinza, coração em brasa...  fogo no asfalto, alma em pedaços...  fora do controle, essa é a regra...\"\n\n**(A batida para bruscamente. Silêncio absoluto, quebrado apenas pelo som pesado da respiração de Danny K)**\n\n**Danny K:** (Irritado) Que porra foi essa?!\n\n\n**Cena 2:** (1:00-2:30)\n\n**Ambiente:** Mesma localização.  A energia está cortada.  Danny K, Zé e Bia estão em volta da caixa de fusíveis, em meio a um caos organizado de fios e equipamentos desligados.\n\n**Ação:** A câmera acompanha o olhar de Danny K enquanto ele examina a caixa de fusíveis.  Bia liga a lanterna do celular, revelando um pequeno bilhete preso com fita adesiva.  Zé tenta acionar os disjuntores sem sucesso. A expressão de Danny K muda de irritação para preocupação.  Bia tira o bilhete e, com a lanterna, tenta decifrar a mensagem escrita em código.\n\n**Diálogos:**\n\n**Danny K:** Sabotagem?!  Alguém fez isso de propósito?!\n\n**Zé:** Parece que sim, Caio.  Não é uma simples queda de energia. Os disjuntores estão intactos.  Alguém cortou o suprimento diretamente na rua.\n\n**Bia:** (Lendo o bilhete) \"O som do silêncio é mais alto que mil explosões.  Outdacontrol não vai acontecer.\"  Que merda é essa?  Um código?\n\n**Danny K:** Tem que ter um significado.  Essa mensagem... é uma ameaça.\n\n\n**Cena 3:** (2:30-4:00)\n\n**Ambiente:** Uma mistura de imagens: Bia tentando decifrar o código em seu computador, Danny K olhando para o bilhete com uma mistura de raiva e medo, Zé examinando os equipamentos procurando por falhas de segurança.  A trilha sonora é mais tensa, com samples de ruídos eletrônicos e um baixo pesado.\n\n**Ação:**  Montagem dinâmica mostrando a equipe em ação: Bia pesquisa online sobre códigos secretos, Zé revisa as câmeras de segurança (sem sucesso), Danny K liga para alguns de seus contatos, tentando descobrir a origem da ameaça.  A câmera se concentra nos rostos dos personagens, transmitindo a crescente tensão.\n\n**Diálogos:**\n\n**Danny K:** (Ao telefone, voz tensa)  ...não, cara, não foi um acidente... alguém sabotou a gravação...  sim, tem uma mensagem cifrada... não sei o que significa...\n\n\n**(Bia encontra um padrão no código)**\n\n**Bia:** Acho que decifrei parte da mensagem!  Parece um anagrama!\n\n\n**Cena 4:** (4:00-5:00)\n\n**Ambiente:** Danny K sentado em um sofá rasgado, no meio do estúdio, olhando para o telefone com uma expressão de incerteza. O cenário se torna mais escuro, mais sombrio. A trilha sonora se torna ominosa, com batidas pesadas e sons de suspense.\n\n**Ação:** Danny K recebe uma ligação anônima.  Ele atende, mas a câmera não mostra quem está do outro lado.  A voz é apenas um sussurro ameaçador, incompreensível. A ligação é interrompida.  Danny K fica olhando para o telefone, sua expressão é de total incerteza e medo.\n\n**Diálogos:**\n\n**(Som de telefone tocando.  Danny K atende)**\n\n**(Voz sussurrante e distorcida, inaudível para o público)**\n\n**(Ligação interrompida.  Som de silêncio pesado)**\n\n\n**Danny K:** (Para si mesmo, com a voz baixa e tensa)  Quem foi esse? O que eles querem?",
          "word_count": 695
        },
        {
          "chapter_number": 2,
          "title": "Capítulo 2: ## Outdacontrol: Capítulo 1 - Blackout\n\n**[Cena 1]...",
          "content": "## Outdacontrol: Capítulo 1 - Blackout\n\n**[Cena 1]**\n\n**INT. GALPÃO INDUSTRIAL - NOITE**\n\nO galpão pulsa.  Luzes estroboscópicas azuis e vermelhas pintam sombras frenéticas nas paredes de concreto nu.  Fios elétricos se cruzam como veias expostas, alimentando um amontoado de equipamentos de gravação improvisado. O ar é denso, saturado com a fumaça de inúmeros cigarros e o suor de uma equipe exausta, mas eletrizada.  No centro do caos, CAIO OLIVEIRA (20s, Danny K),  com olhos vermelhos inchados e uma energia quase palpável, está imerso em uma sessão de freestyle furiosa.  Seu flow é um turbilhão de rimas cruas e agressivas, a voz rouca cortando o ritmo frenético da batida.  A cada sílaba, ele se move como um animal enjaulado, sua energia transbordando.  Seu produtor, MARCELO (30s, rosto cansado, mas focado), acompanha cada movimento com uma expressão de fascínio e apreensão.  Dois técnicos de som, ANA (20s, concentrada) e PEDRO (25s, nervoso), monitoram os níveis de áudio, seus rostos iluminados pela tela dos computadores.\n\n**CAIO (gritando sobre a música):** ...e essa porra de cidade me engole, mas eu cuspo de volta na cara dela, entende?  Eu sou o monstro, a fera, a tempestade!\n\nA batida explode em um climax.  Caio para de repente, ofegante, o suor escorrendo pelo rosto.  Um silêncio abrupto cai sobre o estúdio.  Marcelo sorri, satisfeito.  Então, as luzes piscam e morrem.  Um silêncio pesado desce, interrompido apenas pelo zumbido dos computadores que se desligam lentamente.\n\n**MARCELO:** Caralho!  Que porra foi essa?\n\n**ANA:** A energia caiu, cara.  Não era pra acontecer.\n\n**PEDRO:**  A caixa de fusíveis...  Eu vou ver.\n\nPedro sai apressadamente em direção a uma caixa de metal enferrujada no canto do galpão.  Ele volta alguns minutos depois, pálido e segurando um pequeno pedaço de papel dobrado.\n\n**PEDRO:** Tem um bilhete aqui...  E parece que alguém mexeu nos fios.  Isso não foi acidente.\n\n\n**[Cena 2]**\n\n**INT. GALPÃO INDUSTRIAL - CONTINUAÇÃO**\n\nA equipe se reúne em volta de Pedro, observando o papel.  É uma mensagem escrita em uma caligrafia elegante, quase artística.  Números e símbolos enigmáticos se entrelaçam, formando um código.\n\n**CAIO:**  Sabotagem?  Alguém quer foder com meu álbum?\n\n**MARCELO:**  Precisa decifrar isso primeiro.  Tem que ser alguém de dentro...\n\nA irritação de Caio se transforma em uma raiva fria.  A possibilidade de alguém sabotar seu trabalho, tão próximo do lançamento de seu álbum, o deixa furioso. Ele sente a adrenalina pulsar no sangue.\n\n**CAIO:**  Não. Não pode ser.  Esse álbum... anos de trabalho, sangue, suor...\n\n**ANA:**  Calma, Caio.  Vamos pensar.  Temos que encontrar quem fez isso antes que...\n\nAna para, olhando para a caixa de fusíveis.  Uma pequena quantidade de pó branco está espalhada em torno dela.\n\n**ANA:** Droga.  Isso é... uma droga poderosa.  Não mexe, Pedro.\n\n\n**[Cena 3]**\n\n**INT. GALPÃO INDUSTRIAL - MAIS TARDE**\n\nHoras se passam.  A equipe tenta decifrar o código enquanto Caio caminha pela sala, inquieto.  A tensão é palpável.  Telefonemas para eletricistas e técnicos são feitos, sem sucesso.  Restaurar a energia vai demorar.  A escolha se torna clara: investigar ou seguir adiante com as gravações usando geradores.  O debate é acalorado, cada membro tem suas opiniões sobre qual decisão será melhor para o lançamento.\n\n\n**[Cena 4]**\n\n**INT. GALPÃO INDUSTRIAL - NOITE**\n\nCaio está sentado sozinho, esgotado, em frente ao seu computador, quando seu telefone toca.  Ele atende, um tremor na voz.  Uma voz rouca, distorcida, sussurra do outro lado da linha.\n\n**VOZ (distorcida):**  Outdacontrol...  está fora de controle, Danny K...\n\nA linha cai.  Caio olha para o telefone, o silêncio no galpão mais pesado que antes.  A ameaça é real.  Ele não sabe quem o está atacando, mas sabe que a luta para lançar seu álbum acabou de se tornar muito mais perigosa.\n\n\n**[FIM DO CAPÍTULO 1]**",
          "word_count": 615
        },
        {
          "chapter_number": 3,
          "title": "Capítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: Código Decifrado, Ameaça Revelada\\n\\nNo galpão industrial, a atmosfera é carregada de tensão. A energia voltou, mas a calma não. O ar ainda pesa com o cheiro de suor, cigarro e a lembrança da interrupção abrupta.  Caio, Danny K, olhos fundos e marcados pela exaustão e pela raiva contida, examina o bilhete misterioso.  A equipe, composta por DJ Zé, o produtor musical; Bia, a empresária; e Leo, o engenheiro de som, se reúne em torno dele. O bilhete, rabiscado em tinta vermelha, contém uma série de símbolos estranhos que parecem códigos de programação misturados com caracteres rúnicos. \\n\\nLeo, com sua experiência em tecnologia, nota a semelhança de alguns símbolos com códigos de criptografia usados em jogos online. Após horas de decifração, usando um software especializado e um manual de criptografia que ele mantinha consigo,  consegue decifrar parcialmente a mensagem. A mensagem se torna clara aos poucos: \\\"O ritmo será silenciado.  A fúria será contida.  A verdade está na mixtape perdida de 2014.  O tempo está se esgotando\\\". A última frase está escrita em uma caligrafia diferente, muito mais elaborada, e ainda indecifrável.\\n\\nBia, visivelmente preocupada, levanta a questão de como prosseguir.  As gravações estão atrasadas, e a pressão do selo é enorme.  A decisão de priorizar a investigação da sabotagem, mesmo que custe tempo e recursos valiosos, divide a equipe. Zé, obcecado pela perfeição sonora de \\\"Outdacontrol\\\", argumenta pela continuação das gravações, sugerindo que podem resolver o mistério paralelamente. Caio, apesar da fúria e da frustração, apoia a investigação. A menção da \"mixtape perdida de 2014\" atiça sua curiosidade e paranoia.  Essa mixtape, contendo algumas faixas experimentais e demos, era algo que ele considerava perdido para sempre, um segredo que ele acreditava ter sido esquecido.\\n\\nLeo encontra um link oculto no código decifrado, levando-os para um site obscuro na deep web.  O site contém vídeos antigos de performances de Caio, imagens da sua antiga equipe e um áudio perturbador, um loop contínuo de um sussurro ameaçador: \\\"A vingança é um prato que se come frio... Danny K.\\\"\\n\\nA busca pela mixtape perdida é iniciada.  A equipe vasculha o antigo estúdio de Caio, caixas cheias de equipamentos e discos rígidos empoeirados.  Durante a procura, eles encontram um pendrive antigo, aparentemente descartado.  Ao conectar o pendrive a um computador, uma mensagem surge na tela: \\\"Sua música será o seu enterro.\\\"  Um novo código, mais complexo, aparece na sequência.  O pânico aumenta.  Enquanto isso, uma nova ligação anônima chega ao celular de Caio. Desta vez, a voz não é um sussurro, mas um grito distorcido, repleto de fúria e raiva.  A ligação é interrompida, mas a mensagem está clara: A ameaça é real, e muito mais próxima do que imaginavam.  A busca pela verdade leva a uma conclusão alarmante: a sabotagem pode estar vindo de dentro da própria equipe. A cena termina com Caio olhando fixamente para cada membro da equipe, a desconfiança e a tensão pintando seus olhos vermelhos.\\n\\n\"\n    }\n  ]\n}\n```",
          "word_count": 495
        },
        {
          "chapter_number": 4,
          "title": "Capítulo 4: ## Outdacontrol - Capítulo 3: A Sombra do Enigma\n\n...",
          "content": "## Outdacontrol - Capítulo 3: A Sombra do Enigma\n\n**[Cena 1: Galpão Industrial - Noite - Duração: 1 minuto]**\n\nO galpão pulsa com uma energia frenética, apesar da escuridão. Velas e lanternas improvisadas iluminam cantos do estúdio, lançando sombras longas e dançantes nas paredes de concreto. O ar, denso de fumaça e suor, agora carrega também o cheiro metálico de fios elétricos queimados. Caio Oliveira, Danny K, com o rosto cansado mas determinado, está cercado por sua equipe.  A frustração é palpável.  A energia voltou, gracas a um gerador barulhento alugado às pressas, mas o clima mudou.  A música, antes um rio impetuoso de criatividade, agora é um riacho hesitante.\n\nBeatriz, a engenheira de som, examina a caixa de fusíveis com uma lanterna.  Seu olhar severo revela a gravidade da situação.  Ao lado dela, Rafael, o produtor musical, passa nervosamente a mão nos cabelos.\n\n**RAFAEL:** (Sussurrando) Sabotagem. Sem dúvidas.  Alguém queria interromper tudo.\n\n**BEATRIZ:** (Séria) O corte foi preciso.  Não foi uma simples falha.  Alguém conhecia o sistema.\n\nCaio, encostado numa pilha de caixas, examina o bilhete que Beatriz encontrou.  É um pedaço de papel amassado com símbolos estranhos, uma sequência aparentemente aleatória de letras e números, interrompida por um desenho rudimentar de uma nota musical com um X atravessado.\n\n**DANNY K:** (Voz rouca) O que isso significa?\n\n**RAFAEL:** (Lendo o bilhete) Não faço ideia. Parece... uma cifra.  Mas para que?\n\n**[Cena 2: Galpão Industrial - Flashback - Duração: 1 minuto 30 segundos]**\n\nUm flashback mostra momentos da semana anterior,  fragmentos de conversas e interações de Caio com sua equipe, e com outros indivíduos presentes durante as gravações:  um empresário sorridente,  uma backing vocal enigmática, um beatmaker misterioso, todos com expressões ambíguas e passagens rápidas.  A edição rápida cria uma sensação de suspense, plantando sementes de desconfiança em cada um dos personagens.  São imagens curtas, sugestões que deixam a dúvida pairar sobre a identidade do sabotador.\n\n**[Cena 3: Galpão Industrial - Noite - Duração: 2 minutos]**\n\nDe volta ao presente,  a equipe tenta decifrar o código.  Rafael, com a ajuda de Beatriz, consulta livros de criptografia online, enquanto Caio observa, inquieto.  A atmosfera é tensa.  A cada tentativa frustrada, o pessimismo cresce.  A hipótese de que o sabotador seja alguém próximo à equipe começa a ganhar força.\n\n**DANNY K:**  (Com raiva) Isso não pode acontecer!  O lançamento está próximo!  Temos que descobrir quem fez isso!\n\n**BEATRIZ:**  Temos que decidir.  Continuamos com as gravações, ou nos dedicamos à investigação?  Se continuarmos, precisamos de mais energia e isso significa mais dinheiro.  E tempo...\n\n**RAFAEL:**  Se o sabotador está próximo, continuar aqui é arriscado.  As informações podem vazar, a sabotagem pode acontecer novamente...\n\n\n**[Cena 4: Galpão Industrial - Noite - Duração: 1 minuto 30 segundos]**\n\nDe repente, o celular de Caio toca. Uma chamada anônima. Ele atende, o medo em seu olhar se tornando visível.\n\n**DANNY K:** (No telefone, voz baixa e tensa) Alô? Quem é?  O que você quer?\n\nUm sussurro rouco e ameaçador é ouvido, uma voz distorcida que murmura palavras ininteligíveis, intercaladas por ruídos estranhos. A imagem da tela do celular mostra um número desconhecido, mas ao fundo, é possível distinguir uma melodia distorcida e familiar - um trecho de uma música do seu próprio álbum.\n\nA ligação é abruptamente encerrada.  Caio permanece imóvel, o medo e a angústia estampados em seu rosto. O suspense paira no ar. O bilhete, o código indecifrável, a ligação anônima... tudo aponta para uma ameaça iminente, com a identidade do inimigo ainda escondida nas sombras. A semana de gravações está longe de acabar, mas a verdadeira batalha agora é contra um inimigo invisível, determinado a silenciar a música de Danny K.",
          "word_count": 607
        },
        {
          "chapter_number": 5,
          "title": "Capítulo 5: ## Outdacontrol: A LOUCURA que você PRECISA ver! -...",
          "content": "## Outdacontrol: A LOUCURA que você PRECISA ver! - Roteiro (Parte Final)\n\n**Tempo estimado:** 4-6 minutos\n\n**(Cena: Galpão Industrial - Noite. A atmosfera é tensa, a iluminação precária, apenas algumas lâmpadas fluorescentes ziguezagueando no teto. Caio, exausto, mas determinado, observa a equipe tentando religar os equipamentos. O caos controlado da sessão anterior deu lugar a uma busca frenética por soluções.)**\n\n**Som:** Música ambiente tensa, com batidas de fundo irregulares, refletindo a situação.\n\n**CAIO (V.O.):**  Sete dias. Sete dias de pura insanidade.  A gente achou que a maior loucura era a produção em si, a pressão, a correria... mas a gente estava enganado. A verdadeira loucura estava por vir.\n\n**(Flashback rápido mostrando os momentos tensos da semana:  a energia caindo, a descoberta do bilhete, a equipe dividida, discussões acaloradas, rostos cansados e preocupados.)**\n\n**(Cena:  Close no bilhete misterioso. A câmera focaliza os símbolos cifrados, criando uma atmosfera enigmática.)**\n\n**MARCIA (Produtora, estressada):**  A gente decifrou algumas partes do código...  Parece ser uma sequência de coordenadas...  Mas coordenadas para quê?\n\n**RAFAEL (Técnico de som, frustrado):**  E essa ameaça velada... \"O ritmo vai parar.\"  O que isso significa?  Será que vão sabotar de novo?\n\n**(Caio observa, rolando um cigarro nervosamente.  Sua expressão demonstra dúvida e preocupação.)**\n\n**CAIO:**  Não podemos deixar que eles nos paralisem.  A gente tem que terminar esse álbum. \"Outdacontrol\" não pode ser contido.\n\n**(Cena:  Montagem rápida mostrando a equipe trabalhando incansavelmente:  um programador tentando rastrear o IP da mensagem anônima, Marcia fazendo ligações, Rafael testando equipamentos com cuidado, enquanto outros membros da equipe procuram discretamente por câmeras escondidas ou dispositivos suspeitos no galpão.)**\n\n**(Cena:  Caio no centro do galpão, rodeado por sua equipe, olhando para um mapa de São Paulo com as coordenadas marcadas.  A tensão é palpável.)**\n\n**CAIO:**  Essas coordenadas...  levam para um prédio abandonado na zona leste.  Precisamos ir lá.\n\n**(Cena:  A equipe, armada com lanternas e um pouco de coragem, explora o prédio abandonado. A escuridão e a decadência do lugar criam uma atmosfera tensa e opressiva.  Eles encontram um estúdio de gravação improvisado e dilapidado, com equipamentos antigos e danificados.)**\n\n**(Cena:  Close em um gravador antigo com uma fita cassete dentro.  A fita está parcialmente danificada.)**\n\n**MARCIA:**  Essa fita...  tem algo escrito aqui: \"A verdade sobre Danny K\".\n\n**(A equipe ouve a fita.  São gravações antigas de Caio, revelando segredos do passado, rivalidades esquecidas, antigos contratos e negociações problemáticas, todos elementos que apontam para um inimigo com um grande motivo para sabotá-lo.)**\n\n**(Cena:  Flashback mostrando breves momentos que revelam pistas sobre a identidade do inimigo – um rosto parcialmente oculto, um objeto específico que aparece repetidamente nas cenas, uma silhueta ameaçadora.)**\n\n**(Cena:  De volta ao galpão.  A equipe está reunida, com o quebra-cabeça quase completo.  A identidade do inimigo é revelada: um ex-sócio de Caio que sente inveja pelo sucesso alcançado.)**\n\n**CAIO (V.O.):** A verdade sempre vem à tona. E a justiça, por mais tardia que seja, sempre alcança quem a merece.\n\n**(Cena:  A equipe se prepara para o lançamento do álbum.  O clima de tensão se transforma em um misto de excitação e alívio.  O vídeo mostra cenas da festa de lançamento do álbum, com flashes de público vibrante e Caio no palco, radiante.)**\n\n**(Cena final: Caio sozinho no estúdio, olhando para o álbum finalizado, com a capa que retrata a jornada difícil que culminou na obra. Um sorriso de conquista e alívio em seu rosto.)**\n\n**CAIO (V.O.):**  \"Outdacontrol\" não é só um álbum. É uma história. A história de sete dias de loucura, de superação, e da luta contra a sabotagem e o medo.  É a prova de que, quando você se joga de corpo e alma em seus sonhos, você sempre vai superar qualquer obstáculo.  E agora… ouça!\n\n\n**(Cena final:  A tela exibe a capa do álbum \"Outdacontrol\", com a data de lançamento e as plataformas de streaming.  Os créditos finais rolam, acompanhados por uma música do álbum, finalizando com impacto.)**",
          "word_count": 647
        }
      ],
      "chapters_generated": 5,
      "estimated_duration": 20.746666666666666,
      "style": "inicio",
      "generation_time": "2025-08-22T20:27:19.474546",
      "partial": false
    }
  },
  "config": {
    "extraction": {
      "method": "auto",
      "max_titles": 10,
      "min_views": 1000,
      "days_back": 30
    },
    "titles": {
      "provider": "gemini",
      "custom_prompt": false,
      "count": 5,
      "style": "viral"
    },
    "premises": {
      "provider": "gemini",
      "custom_prompt": false,
      "word_count": 200
    },
    "scripts": {
      "chapters": 5,
      "style": "inicio",
      "duration_target": "5-7 minutes",
      "include_hooks": true
    },
    "tts": {
      "provider": "kokoro",
      "voice": "default",
      "speed": 1.0,
      "emotion": "neutral"
    },
    "images": {
      "provider": "pollinations",
      "style": "cinematic",
      "resolution": "1920x1080",
      "per_chapter": 2
    },
    "video": {
      "resolution": "1920x1080",
      "fps": 30,
      "quality": "high",
      "transitions": true,
      "subtitles": true
    }
  },
  "progress": {},
  "version": "1.0"
}