{
  "pipeline_id": "d6627a65-8246-43cb-b579-9dc2f0396dd4",
  "timestamp": "2025-08-22T16:06:29.631391",
  "current_step": "video_failed",
  "completed_steps": [
    "extraction",
    "titles",
    "premises",
    "scripts",
    "tts",
    "images"
  ],
  "results": {
    "extraction": {
      "channel_info": {},
      "titles": [
        {
          "video_id": "v-djT7RdoBA",
          "title": "MILIONÁRIO FLAGRA FAXINEIRA PROTEGENDO SUA FILHA CEGA… E NÃO ACREDITA NO QUE VÊ!",
          "description": "MILIONÁRIO FLAGRA FAXINEIRA PROTEGENDO SUA FILHA CEGA… E NÃO ACREDITA NO QUE VÊ!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasdesuperação...",
          "thumbnail": "",
          "duration": "7826.0s",
          "views": 3845,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=v-djT7RdoBA"
        },
        {
          "video_id": "dLGBChmJ6Pc",
          "title": "\"PODEMOS COMER COM VOCÊ?\" — MENINA COM SUA IRMÃ NO COLO OLHA PARA O MILIONÁRIO E ELE MUDA TUDO!",
          "description": "\"PODEMOS COMER COM VOCÊ?\" — MENINA COM SUA IRMÃ NO COLO OLHA PARA O MILIONÁRIO E ELE MUDA TUDO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históri...",
          "thumbnail": "",
          "duration": "7989.0s",
          "views": 3013,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=dLGBChmJ6Pc"
        },
        {
          "video_id": "f8heWcgZ7Zc",
          "title": "\"EU FALO 8 IDIOMAS\" – A MENINA DISSE ORGULHOSA, TODOS RIRAM… MENOS O MILIONÁRIO, QUE FICOU EM CHOQUE",
          "description": "\"EU FALO 8 IDIOMAS\" – A MENINA DISSE ORGULHOSA, TODOS RIRAM… MENOS O MILIONÁRIO, QUE FICOU EM CHOQUE\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras...",
          "thumbnail": "",
          "duration": "7907.0s",
          "views": 1809,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=f8heWcgZ7Zc"
        },
        {
          "video_id": "dSGvesGrEtM",
          "title": "EMPREGADA GRÁVIDA DESMAIA NA MANSÃO DO MILIONÁRIO E O QUE ESCONDIA NO VENTRE SURPREENDE A TODOS!",
          "description": "EMPREGADA GRÁVIDA DESMAIA NA MANSÃO DO MILIONÁRIO E O QUE ESCONDIA NO VENTRE SURPREENDE A TODOS!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #história...",
          "thumbnail": "",
          "duration": "7480.0s",
          "views": 20313,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=dSGvesGrEtM"
        },
        {
          "video_id": "GSLCE9f4CKg",
          "title": "\"SUA FILHA PODERIA ANDAR, MAS SUA NOIVA NÃO DEIXA!\"… DESABAFOU O MENINO POBRE AO MILIONÁRIO",
          "description": "\"SUA FILHA PODERIA ANDAR, MAS SUA NOIVA NÃO DEIXA!\"… DESABAFOU O MENINO POBRE AO MILIONÁRIO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasdes...",
          "thumbnail": "",
          "duration": "7448.0s",
          "views": 39413,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=GSLCE9f4CKg"
        },
        {
          "video_id": "D3wVC2ekfaM",
          "title": "MENINO POBRE IMPLORA AO MILIONÁRIO POR LEITE PARA O IRMÃO... E A REAÇÃO DELE TRANSFORMA TUDO",
          "description": "MENINO POBRE IMPLORA AO MILIONÁRIO POR LEITE PARA O IRMÃO... E A REAÇÃO DELE TRANSFORMA TUDO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasde...",
          "thumbnail": "",
          "duration": "8020.0s",
          "views": 4024,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=D3wVC2ekfaM"
        },
        {
          "video_id": "7WjJ-Sd0HSk",
          "title": "MILLIONÁRIO VÊ SEU FILHO AJUDANDO A COZINHEIRA A PREPARAR A COMIDA E PRESENCIA ALGO INESPERADO!",
          "description": "MILLIONÁRIO VÊ SEU FILHO AJUDANDO A COZINHEIRA A PREPARAR A COMIDA E PRESENCIA ALGO INESPERADO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasd...",
          "thumbnail": "",
          "duration": "8324.0s",
          "views": 4128,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=7WjJ-Sd0HSk"
        },
        {
          "video_id": "exfN4z55B-I",
          "title": "\"PAI, AQUELES DOIS MENINOS DORMINDO NO LIXO SÃO PARECIDOS COMIGO\", DISSE O GAROTO AO MILIONÁRIO!",
          "description": "\"PAI, AQUELES DOIS MENINOS DORMINDO NO LIXO SÃO PARECIDOS COMIGO\", DISSE O GAROTO AO MILIONÁRIO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #histórias...",
          "thumbnail": "",
          "duration": "7267.0s",
          "views": 180705,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=exfN4z55B-I"
        },
        {
          "video_id": "u8XYfdgQAcE",
          "title": "MILIONÁRIO COMPRA TODA MERCADORIA DE UMA CRIANÇA VENDENDO DOCES NA RUA E FAZ UM PEDIDO INESPERADO",
          "description": "MILIONÁRIO COMPRA TODA MERCADORIA DE UMA CRIANÇA VENDENDO DOCES NA RUA E FAZ UM PEDIDO INESPERADO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #história...",
          "thumbnail": "",
          "duration": "8335.0s",
          "views": 3552,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=u8XYfdgQAcE"
        },
        {
          "video_id": "1zGtqccmwmg",
          "title": "MILIONÁRIO, EM SEUS ÚLTIMOS DIAS, ADOTA DOIS GÊMEOS MENDIGOS… SEM IMAGINAR O IMPACTO EM SUA VIDA",
          "description": "MILIONÁRIO, EM SEUS ÚLTIMOS DIAS, ADOTA DOIS GÊMEOS MENDIGOS… SEM IMAGINAR O IMPACTO EM SUA VIDA\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras...",
          "thumbnail": "",
          "duration": "7637.0s",
          "views": 7653,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=1zGtqccmwmg"
        }
      ],
      "total_extracted": 10,
      "method_used": "yt-dlp",
      "extraction_time": "2025-08-22T15:38:37.187084"
    },
    "titles": {
      "generated_titles": [
        "Milionário chocado: Gêmeos mendigos mudam sua vida para sempre!"
      ],
      "source_titles_count": 10,
      "provider_used": "gemini",
      "style": "viral",
      "generation_time": "2025-08-22T15:38:40.344923"
    },
    "premises": {
      "selected_title": "Milionário chocado: Gêmeos mendigos mudam sua vida para sempre!",
      "premise": "Este vídeo, direcionado a um público que aprecia histórias inspiradoras e com reviravoltas emocionais, conta a surpreendente história de Arthur, um milionário solitário e um tanto cínico, que se depara com dois gêmeos idênticos, Miguel e Rafael, mendigando nas ruas da cidade.  Inicialmente irritado com a situação, Arthur se vê intrigado pela semelhança impressionante dos irmãos e pela tristeza em seus olhos.  O vídeo, com um tom otimista e emocionante, acompanha a jornada de Arthur ao investigar a vida dos gêmeos, descobrindo uma história de abandono, injustiça e um talento nato para a música.  Ao ajudar os irmãos a desenvolverem seu talento e a reconstruírem suas vidas, Arthur não apenas transforma a realidade de Miguel e Rafael, como também encontra um propósito e um novo significado para sua própria vida, aprendendo sobre compaixão, empatia e a verdadeira riqueza que reside nos laços humanos.  Pontos-chave incluem a apresentação da vida solitária e insatisfatória de Arthur, a descoberta dos gêmeos e sua história comovente, o processo de desenvolvimento musical dos irmãos e o impacto dessa transformação na vida de Arthur. O vídeo culmina em um emocionante show dos gêmeos e um final revelador sobre a profunda conexão estabelecida entre o milionário e os mendigos. A narrativa será intercalada com imagens impactantes e música inspiradora para intensificar a experiência do espectador.\n",
      "word_count": 218,
      "provider_used": "gemini",
      "generation_time": "2025-08-22T15:38:43.456087"
    },
    "scripts": {
      "title": "Milionário chocado: Gêmeos mendigos mudam sua vida para sempre!",
      "premise": "Este vídeo, direcionado a um público que aprecia histórias inspiradoras e com reviravoltas emocionais, conta a surpreendente história de Arthur, um milionário solitário e um tanto cínico, que se depara com dois gêmeos idênticos, Miguel e Rafael, mendigando nas ruas da cidade.  Inicialmente irritado com a situação, Arthur se vê intrigado pela semelhança impressionante dos irmãos e pela tristeza em seus olhos.  O vídeo, com um tom otimista e emocionante, acompanha a jornada de Arthur ao investigar a vida dos gêmeos, descobrindo uma história de abandono, injustiça e um talento nato para a música.  Ao ajudar os irmãos a desenvolverem seu talento e a reconstruírem suas vidas, Arthur não apenas transforma a realidade de Miguel e Rafael, como também encontra um propósito e um novo significado para sua própria vida, aprendendo sobre compaixão, empatia e a verdadeira riqueza que reside nos laços humanos.  Pontos-chave incluem a apresentação da vida solitária e insatisfatória de Arthur, a descoberta dos gêmeos e sua história comovente, o processo de desenvolvimento musical dos irmãos e o impacto dessa transformação na vida de Arthur. O vídeo culmina em um emocionante show dos gêmeos e um final revelador sobre a profunda conexão estabelecida entre o milionário e os mendigos. A narrativa será intercalada com imagens impactantes e música inspiradora para intensificar a experiência do espectador.\n",
      "script": "Capítulo 1: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V...\n\n## Milionário Chocado: Gêmeos Mendigos Mudam Sua Vida Para Sempre! - Roteiro (Parte 1)\n\n**Duração estimada:** 5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**INT. APARTAMENTO DE ARTUR - NOITE**\n\nUm apartamento de luxo em São Paulo. Janelas panorâmicas oferecem uma vista deslumbrante da cidade iluminada. O ambiente é sofisticado, porém frio e impessoal. Obras de arte abstratas adornam as paredes, parecendo observar Artur (50, milionário, solitário, aparência cansada) em seu jantar solitário.  Ele come mexendo pouco na comida, um prato requintado que parece não lhe causar nenhum prazer. A música clássica toca baixinho, um contraponto à solidão que o cerca. A câmera se concentra em sua expressão vazia, destacando a tristeza em seus olhos.\n\n**NARRADOR (V.O.):** Artur, um homem feito de sucesso, dono de um império financeiro. Mas o brilho das joias e o luxo do seu apartamento não conseguiam preencher o vazio em seu coração.\n\nA câmera faz um travelling lento, mostrando os detalhes do apartamento: mesas de madeira nobre, taças de cristal impecáveis, uma adega climatizada com garrafas caríssimas.  A câmera se detém em uma foto antiga, desbotada, em uma mesa lateral - um homem e uma mulher jovens, sorrindo, sugerindo um passado feliz perdido.\n\n**Cena 2:** (1:00-2:30)\n\n**EXT. RUA DE SÃO PAULO - NOITE**\n\nChuva fina cai sobre as ruas de São Paulo. Artur, elegantemente vestido, sai de um restaurante chique.  Ele olha para o relógio, impaciente. A câmera mostra seu reflexo em uma vitrine, evidenciando sua expressão de desânimo.  Ele se aproxima de um canto escuro da rua, onde dois gêmeos idênticos, Miguel e Rafael (17 anos, roupas rasgadas, aparência cansada, mas com olhos expressivos), pedem esmola.\n\nArtur os ignora inicialmente, mas hesita ao notar a semelhança impressionante dos irmãos e a tristeza em seus olhos. Eles parecem tão iguais que quase parece que Artur está vendo seu reflexo em um espelho distorcido pela tristeza e pobreza.  A chuva cai com mais intensidade, refletindo a melancolia da cena.\n\n**ARTUR:** (murmurando para si mesmo)  Deus...\n\nEle para e olha para os gêmeos por alguns segundos.\n\n**Cena 3:** (2:30-3:30)\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONT.)**\n\nArtur, surpreendendo a si mesmo, tira a carteira e pega uma nota de R$ 100,00.  Ele se aproxima cautelosamente dos gêmeos, que o encaram com uma mistura de esperança e receio.\n\n**ARTUR:** (hesitante) Aqui...  Comprem algo para comer.\n\nMiguel pega o dinheiro com hesitação, mas Rafael permanece silencioso, olhando fixamente para Artur com olhos penetrantes.\n\n**MIGUEL:** Obrigado, senhor...\n\n**ARTUR:** (olhando para Rafael) Vocês... são gêmeos, não é? Impressionante a semelhança.\n\nMiguel se manifesta, explicando rapidamente que foram separados ainda crianças e pouco sabem sobre o passado. O olhar de Rafael continua misterioso e distante. A câmera focaliza em um pequeno violino gasto que está ao lado deles, quase escondido pelas roupas velhas.\n\n**Cena 4:** (3:30-4:30)\n\n**INT. APARTAMENTO DE ARTUR - NOITE**\n\nArtur leva os gêmeos para seu apartamento. Os meninos observam tudo com espanto.  A opulência do lugar contrasta fortemente com a sua realidade.  Artur oferece comida e bebidas quentes.  Miguel, mais extrovertido, conta timidamente sobre a separação da família, a luta diária pela sobrevivência e a busca por um lar.\n\n**MIGUEL:** Nunca mais vimos nossos pais, depois daquela separação...\n\nNo meio da conversa, Artur ouve um som melodioso. Miguel pega o violino e começa a tocar uma música triste e bela. É uma melodia comovente que toca a alma de Artur, que se sente tocado pela profunda tristeza na música.\n\n**Cena 5:** (4:30-5:00)\n\n**INT. APARTAMENTO DE ARTUR - NOITE (CONT.)**\n\nArtur, profundamente comovido pela música, se aproxima de Miguel e pergunta como ele aprendeu a tocar. Ele expressa a vontade de ajudá-los.\n\n**ARTUR:** Vocês tem um dom, precisam desenvolver isso.  Eu quero ajudá-los.\n\nMiguel, visivelmente emocionado, agradece. Rafael, porém, permanece em silêncio, observando tudo com um olhar inexpressivo. Enquanto Artur fala, a câmera se foca no bolso de Rafael, onde se nota um pequeno canto de uma carta.\n\n**ARTUR (CONT.):** O que aconteceu com vocês, rapazes? Quem são seus pais?\n\nDe repente, Rafael coloca a mão no bolso.  Artur nota o movimento e um leve tremor em suas mãos.  Ele observa Rafael furtivamente, enquanto o menino tenta esconder algo.\n\nApós um momento de hesitação, Rafael tira um pedaço de carta do bolso, mas ao se virar para jogá-la fora, a deixa cair. Artur a pega, lendo uma frase em voz baixa.\n\n**ARTUR (lendo):** \"O jogo começou, Artur...\"\n\nA câmera fecha em seu rosto, mostrando uma expressão de espanto e apreensão. O tom da música muda para algo mais sombrio e misterioso.  A cena termina com Artur segurando a carta, o mistério envolvendo os gêmeos se intensificando.\n\nCapítulo 2: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V...\n\n## Milionário Chocado: Gêmeos Mendigos Mudam Sua Vida Para Sempre! - CAPÍTULO 1\n\n**[Cena 1]**\n\n**INT. APARTAMENTO DE LUXO - NOITE**\n\nArtur (50, impecavelmente vestido, mas com um olhar cansado e vazio), janta sozinho em uma mesa imponente, cercado por obras de arte caras que parecem se mirar em seu desânimo.  A vista panorâmica de São Paulo, normalmente deslumbrante, hoje é apenas um borrão cinzento em sua janela. O som de uma orquestra clássica toca baixinho, mas não consegue preencher o silêncio opressivo. Ele mal toca na comida, a sofisticada refeição se resfriando enquanto ele observa o reflexo melancólico em sua taça de cristal.\n\n**ARTUR (V.O.)**\nCinquenta anos. Meio século gastando fortunas em coisas que não preenchem o vazio aqui dentro.  Obras de arte, carros de luxo, viagens... tudo isso ecoa em silêncio.  Como se eu estivesse gritando em um espaço vazio, sem nunca ser ouvido.\n\nEle pega um quadro antigo e observa-o atentamente, uma expressão de tristeza profunda em seu rosto.\n\n**[Cena 2]**\n\n**EXT. RUA DE SÃO PAULO - NOITE**\n\nChuva cai incessante sobre a cidade. Artur, agora em seu carro luxuoso, para em um sinal vermelho. Do outro lado da rua, encolhidos em um canto escuro e úmido, estão Miguel e Rafael (20 anos), dois gêmeos idênticos com roupas rasgadas e sujas. Seus rostos são magros, mas a semelhança entre eles é inegável, apesar da tristeza profunda que expressam. Eles estendem as mãos, pedindo esmola.\n\nArtur os observa com uma mistura de irritação e fascinação.  A semelhança perfeita dos gêmeos o deixa perturbado, como se estivesse olhando para um espelho distorcido de sua própria alma solitária.  A tristeza nos olhos deles, uma tristeza que ele reconhece em si mesmo, o intriga ainda mais.\n\n**[Cena 3]**\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONTINUAÇÃO)**\n\nO sinal muda e Artur parte, mas logo se detém em um local próximo. Hesitando, ele volta a pé até os gêmeos.  Sua aproximação é cautelosa, carregada de um peso inesperado que ele mesmo não compreende.\n\n**ARTUR**\n(Voz dura, mas com um tom de hesitação)\nVocês... precisam de alguma coisa?\n\nMiguel, o mais falante, olha para Artur com cautela.\n\n**MIGUEL**\n(Voz suave, quase um sussurro)\nUm pouco de comida, senhor... Se o senhor puder...\n\nArtur, sem responder, vai até um restaurante próximo e compra dois sanduíches e duas latas de refrigerante.  Entrega-os aos gêmeos em silêncio.  A atitude deles é agradecida, humilde.\n\n**RAFAEL**\n(Voz baixa, quase inaudível)\nObrigado, senhor.\n\n**[Cena 4]**\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONTINUAÇÃO)**\n\nArtur, surpreendendo a si mesmo, senta-se ao lado deles no chão úmido.  A chuva continua a cair.  O diálogo é hesitante, mas aos poucos, a história dos gêmeos começa a ser revelada.  Eles contam sobre a separação dolorosa dos pais, a vida nas ruas, a luta constante pela sobrevivência.  Miguel revela, com a voz embargada, que sempre sonhou em ser músico.  Artur vê no olhar dele uma esperança que há muito tempo desapareceu de sua própria vida.\n\n**[Cena 5]**\n\n**INT. APARTAMENTO DE LUXO - NOITE**\n\nArtur leva os gêmeos para seu luxuoso apartamento.  O contraste é chocante.  Enquanto Miguel conta sua história com um leve sorriso ao tocar uma melodia triste em um pequeno violino improvisado, um pedaço de madeira com cordas soltas, Artur percebe o talento nato dos dois.  Sua atenção está presa à música, à delicadeza e tristeza que ela transmite. É uma melodia que ecoa a solidão que ele sente.\n\n**[Cena 6]**\n\n**INT. APARTAMENTO DE LUXO - NOITE (CONTINUAÇÃO)**\n\nEnquanto Miguel toca, Rafael fica em silêncio, observando tudo com um olhar intenso, quase assustador.  Artur, tocado pela música e pela história dos meninos, oferece ajuda.  Mas algo não está certo com Rafael. Ele se mostra retraído, frio, e evita o contato visual.\n\n**[Cena 7]**\n\n**INT. APARTAMENTO DE LUXO - QUARTO DE HÓSPEDES - NOITE**\n\nMais tarde, enquanto arruma a cama para os gêmeos, Artur encontra uma carta escondida no bolso do casaco de Rafael. Ele a pega hesitante, sentindo uma onda de apreensão.  A carta, escrita com uma caligrafia elegante, fala de um plano complexo, de pessoas poderosas e segredos do passado. A última frase é chocante: \"O jogo começou, Artur.\"\n\n**[FIM DO CAPÍTULO 1]**\n\nCapítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: A Melodia da Desconfiança\\n\\nCinco semanas se passaram desde que Artur acolheu Miguel e Rafael em seu apartamento.  O luxuoso lar, antes um santuário de solidão, agora ecoava com o som do violino de Miguel e os baixos compassos do teclado improvisado que Artur providenciou para Rafael.  Miguel, extrovertido e talentoso, florescia sob os cuidados de Artur.  Suas aulas de música com um renomado professor, pagas generosamente pelo milionário, transformavam sua melodia triste em sinfonias vibrantes.  Artur, por sua vez, encontrava um propósito inesperado, sentindo-se preenchido por algo além das posses materiais.  Ele observava Miguel com admiração, percebendo em seus olhos a mesma chama que havia se apagado em sua própria alma há muito tempo.\\n\\nNo entanto, Rafael permanecia um enigma.  Seu talento musical era indiscutível, sua habilidade no teclado surpreendentemente refinada, mas sua personalidade permanecia reservada, quase assustadoramente quieta.  Ele raramente falava, mantendo-se à sombra de Miguel, seus olhos escuros e penetrantes observando tudo e todos com uma intensidade desconcertante.  Artur, inicialmente atribuindo a reserva de Rafael ao trauma do passado, começou a sentir um desconforto crescente em sua presença.  Era uma sensação de inquietude, uma dissonância na harmonia aparentemente restaurada de sua vida.\\n\\nAs aulas de música se tornaram um palco para essa crescente tensão.  Enquanto Miguel brilhava, Rafael observava com uma frieza desconcertante, seus dedos dançando sobre as teclas, criando melodias que pareciam carregadas de uma profunda melancolia, quase ameaçadoras.  Artur notou que Rafael frequentemente olhava para a janela do apartamento, seu olhar fixo em algum ponto específico na cidade, como se esperasse algo, ou alguém.  Em uma dessas ocasiões, Artur o viu discretamente trocando mensagens criptografadas em um celular antigo que ele mantinha escondido.  A curiosidade de Artur chegou ao limite.\\n\\nEm uma noite, enquanto Miguel dormia, Artur confrontou Rafael.  A conversa foi difícil, pontuada por longos silêncios e respostas evasivas.  Rafael admitiu que não era tão honesto quanto Miguel, revelando que antes de Artur, eles sobreviviam vendendo informações confidenciais para um grupo misterioso, uma atividade que Rafael considerava necessária para sua sobrevivência e a de Miguel.  Ele negou envolvimento em qualquer atividade ilegal atual, mas sua reticência aumentou as suspeitas de Artur.\\n\\nDurante a busca discreta pelo quarto de Rafael, Artur descobriu um segundo compartimento secreto numa gaveta, onde encontrou uma segunda carta, idêntica em aparência à primeira, mas com uma mensagem ainda mais perturbadora. Esta revelava a participação de uma poderosa empresa de tecnologia em seu passado, um passado que ameaçava destruir Miguel e a si mesmo.  A carta terminava com uma nova ameaça: \\\"Artur, você se tornou um peão. Prepare-se para o xeque-mate.\\\"\\n\\nA descoberta deixou Artur em um estado de choque e apreensão.  A aparente bondade em sua ajuda aos gêmeos parecia ter desencadeado uma série de eventos que ameaçavam sua própria segurança e a dos meninos, mostrando que por trás da fachada dos dois músicos talentosos, havia um jogo sombrio e complexo em andamento, um jogo que ele havia inadvertidamente entrado.\"\n    }\n  ]\n}\n```\n\nCapítulo 4: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 3: A Sombra do Passado\\n\\nArtur, abalado pela descoberta da carta enigmática em Rafael, observa os gêmeos. Miguel, radiante com a nova vida que se descortina, ensaiando árias no piano de cauda do apartamento, parece alheio à inquietação que toma conta de Artur. Rafael, por sua vez, permanece retraído, seus olhos escuros refletem uma angústia profunda, que transcende a mera privação que antes marcara sua vida nas ruas.  Os dias que se seguem são um turbilhão de aulas de música, gravações em estúdio profissional e sessões de terapia com uma psicóloga especializada em traumas infantis. Artur investe tempo e dinheiro, mas a cada passo a mais na jornada de reconstrução dos gêmeos, mais perguntas assombram sua mente.  A psicóloga detecta sinais de manipulação em Rafael, que contradiz constantemente as versões de Miguel sobre o passado. A melhora de Miguel é visível, seu talento musical floresce como uma planta faminta sob o sol, mas a sombra sobre Rafael se aprofunda.  Artur mergulha em uma investigação particular, contratando um detetive experiente para desvendar o mistério da carta. O detetive descobre que a caligrafia da carta coincide com a de um empresário conhecido no submundo da música, um homem com reputação duvidosa, envolvido em tráfico de influências e lavagem de dinheiro.  Paralelamente, o detetive encontra informações sobre o passado dos gêmeos que contradizem o que Artur havia escutado até então. Eles não foram apenas abandonados; foram vítimas de um esquema complexo, envolvendo uma adoção fraudulenta que os destinava a um destino sombrio, um destino que Miguel escapou por pouco, deixando Rafael, o mais frágil, preso na teia de mentiras. A investigação leva Artur a confrontar sua própria arrogância e seus preconceitos, o que o levou a subestimar a complexidade da vida de rua e as engrenagens ocultas que movem os eventos.  O capítulo termina com o detetive informando Artur que Rafael está em perigo, que a menção do 'jogo' na carta não é apenas uma metáfora, e que a rede criminosa está se movimentando para recuperar seu ‘bem’ perdido. Artur enfrenta então uma escolha crucial: proteger os gêmeos e enfrentar a sombra implacável do passado ou recuar, protegendo sua própria vida e mergulhando de novo na sua solidão.  As últimas cenas mostram Artur em seu apartamento, cercado pela opulência que antes o alienava, mas agora é um fardo, enquanto a música de Miguel ecoa fracamente pelos corredores, lembrando-o da fragilidade da beleza e da urgência da luta contra a injustiça. \"\n    }\n  ]\n}\n```\n\nCapítulo 5: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ar...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Artur, abalado pela descoberta da carta e pelo comportamento errático de Rafael, mergulha numa investigação frenética.  A ajuda de um detetive particular, contratado às pressas, revela uma trama complexa envolvendo uma antiga rivalidade familiar e uma fortuna roubada décadas atrás. Miguel e Rafael não eram apenas gêmeos abandonados; eram peças-chave num plano de vingança arquitetado por seu pai, um homem que havia sido traído e despojado de sua herança por um sócio, o próprio avô de Artur.  O avô de Artur, um homem implacável e calculista, havia manipulado o sistema para apropriar-se da fortuna da família, deixando Miguel e Rafael na miséria.  A carta era o sinal para o início da execução do plano, um plano que envolvia não só a recuperação da fortuna, mas também uma vingança cuidadosamente orquestrada contra os herdeiros do império construído sobre a injustiça.  Artur, confrontado com a verdade, precisa escolher entre proteger sua própria família e sua recém-descoberta conexão com Miguel e Rafael. Ele percebe que a fortuna não o tornava feliz, mas a possibilidade de reparação e o amor recém-descoberto o fazem reavaliar a vida. Ele decide ajudar Miguel e Rafael a expôr a verdade, a reconstruir a justiça. A revelação ocorre durante um concerto beneficente organizado por Artur.  Miguel e Rafael, com suas habilidades musicais aprimoradas, tocam uma peça comovente e poderosa, cheia de emoção e de uma mensagem de esperança.  As imagens da performance são intercaladas com flashes do passado, mostrando a infância cruel dos gêmeos, a ambição cruel do avô de Artur e a busca por justiça. A multidão fica em silêncio, comovida pela história revelada, e a justiça prevalece com a exposição do avô de Artur e a devolução da fortuna para os gêmeos, culminando na reconciliação. O filme termina com Artur, Miguel e Rafael juntos, em uma cena reconfortante, numa casa aconchegante em meio a um jardim florido, distante dos prédios imponentes de São Paulo,  simbolizando uma nova vida construída sobre a base da justiça, amor e perdão. A câmera se concentra no rosto de Artur, finalmente com um sorriso genuíno, mostrando paz e a verdadeira riqueza encontrada em conexões humanas significativas.  O som da música dos gêmeos ecoa, um tema otimista e esperançoso que embala os créditos finais, sublinhando a transformação completa na vida de todos os envolvidos. A última cena mostra uma foto da família, Artur, Miguel e Rafael, sorrindo juntos em um quadro emoldurado.\"\n    }\n  ]\n}\n```",
      "chapters": [
        {
          "chapter_number": 1,
          "title": "Capítulo 1: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V...",
          "content": "## Milionário Chocado: Gêmeos Mendigos Mudam Sua Vida Para Sempre! - Roteiro (Parte 1)\n\n**Duração estimada:** 5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**INT. APARTAMENTO DE ARTUR - NOITE**\n\nUm apartamento de luxo em São Paulo. Janelas panorâmicas oferecem uma vista deslumbrante da cidade iluminada. O ambiente é sofisticado, porém frio e impessoal. Obras de arte abstratas adornam as paredes, parecendo observar Artur (50, milionário, solitário, aparência cansada) em seu jantar solitário.  Ele come mexendo pouco na comida, um prato requintado que parece não lhe causar nenhum prazer. A música clássica toca baixinho, um contraponto à solidão que o cerca. A câmera se concentra em sua expressão vazia, destacando a tristeza em seus olhos.\n\n**NARRADOR (V.O.):** Artur, um homem feito de sucesso, dono de um império financeiro. Mas o brilho das joias e o luxo do seu apartamento não conseguiam preencher o vazio em seu coração.\n\nA câmera faz um travelling lento, mostrando os detalhes do apartamento: mesas de madeira nobre, taças de cristal impecáveis, uma adega climatizada com garrafas caríssimas.  A câmera se detém em uma foto antiga, desbotada, em uma mesa lateral - um homem e uma mulher jovens, sorrindo, sugerindo um passado feliz perdido.\n\n**Cena 2:** (1:00-2:30)\n\n**EXT. RUA DE SÃO PAULO - NOITE**\n\nChuva fina cai sobre as ruas de São Paulo. Artur, elegantemente vestido, sai de um restaurante chique.  Ele olha para o relógio, impaciente. A câmera mostra seu reflexo em uma vitrine, evidenciando sua expressão de desânimo.  Ele se aproxima de um canto escuro da rua, onde dois gêmeos idênticos, Miguel e Rafael (17 anos, roupas rasgadas, aparência cansada, mas com olhos expressivos), pedem esmola.\n\nArtur os ignora inicialmente, mas hesita ao notar a semelhança impressionante dos irmãos e a tristeza em seus olhos. Eles parecem tão iguais que quase parece que Artur está vendo seu reflexo em um espelho distorcido pela tristeza e pobreza.  A chuva cai com mais intensidade, refletindo a melancolia da cena.\n\n**ARTUR:** (murmurando para si mesmo)  Deus...\n\nEle para e olha para os gêmeos por alguns segundos.\n\n**Cena 3:** (2:30-3:30)\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONT.)**\n\nArtur, surpreendendo a si mesmo, tira a carteira e pega uma nota de R$ 100,00.  Ele se aproxima cautelosamente dos gêmeos, que o encaram com uma mistura de esperança e receio.\n\n**ARTUR:** (hesitante) Aqui...  Comprem algo para comer.\n\nMiguel pega o dinheiro com hesitação, mas Rafael permanece silencioso, olhando fixamente para Artur com olhos penetrantes.\n\n**MIGUEL:** Obrigado, senhor...\n\n**ARTUR:** (olhando para Rafael) Vocês... são gêmeos, não é? Impressionante a semelhança.\n\nMiguel se manifesta, explicando rapidamente que foram separados ainda crianças e pouco sabem sobre o passado. O olhar de Rafael continua misterioso e distante. A câmera focaliza em um pequeno violino gasto que está ao lado deles, quase escondido pelas roupas velhas.\n\n**Cena 4:** (3:30-4:30)\n\n**INT. APARTAMENTO DE ARTUR - NOITE**\n\nArtur leva os gêmeos para seu apartamento. Os meninos observam tudo com espanto.  A opulência do lugar contrasta fortemente com a sua realidade.  Artur oferece comida e bebidas quentes.  Miguel, mais extrovertido, conta timidamente sobre a separação da família, a luta diária pela sobrevivência e a busca por um lar.\n\n**MIGUEL:** Nunca mais vimos nossos pais, depois daquela separação...\n\nNo meio da conversa, Artur ouve um som melodioso. Miguel pega o violino e começa a tocar uma música triste e bela. É uma melodia comovente que toca a alma de Artur, que se sente tocado pela profunda tristeza na música.\n\n**Cena 5:** (4:30-5:00)\n\n**INT. APARTAMENTO DE ARTUR - NOITE (CONT.)**\n\nArtur, profundamente comovido pela música, se aproxima de Miguel e pergunta como ele aprendeu a tocar. Ele expressa a vontade de ajudá-los.\n\n**ARTUR:** Vocês tem um dom, precisam desenvolver isso.  Eu quero ajudá-los.\n\nMiguel, visivelmente emocionado, agradece. Rafael, porém, permanece em silêncio, observando tudo com um olhar inexpressivo. Enquanto Artur fala, a câmera se foca no bolso de Rafael, onde se nota um pequeno canto de uma carta.\n\n**ARTUR (CONT.):** O que aconteceu com vocês, rapazes? Quem são seus pais?\n\nDe repente, Rafael coloca a mão no bolso.  Artur nota o movimento e um leve tremor em suas mãos.  Ele observa Rafael furtivamente, enquanto o menino tenta esconder algo.\n\nApós um momento de hesitação, Rafael tira um pedaço de carta do bolso, mas ao se virar para jogá-la fora, a deixa cair. Artur a pega, lendo uma frase em voz baixa.\n\n**ARTUR (lendo):** \"O jogo começou, Artur...\"\n\nA câmera fecha em seu rosto, mostrando uma expressão de espanto e apreensão. O tom da música muda para algo mais sombrio e misterioso.  A cena termina com Artur segurando a carta, o mistério envolvendo os gêmeos se intensificando.",
          "word_count": 764
        },
        {
          "chapter_number": 2,
          "title": "Capítulo 2: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V...",
          "content": "## Milionário Chocado: Gêmeos Mendigos Mudam Sua Vida Para Sempre! - CAPÍTULO 1\n\n**[Cena 1]**\n\n**INT. APARTAMENTO DE LUXO - NOITE**\n\nArtur (50, impecavelmente vestido, mas com um olhar cansado e vazio), janta sozinho em uma mesa imponente, cercado por obras de arte caras que parecem se mirar em seu desânimo.  A vista panorâmica de São Paulo, normalmente deslumbrante, hoje é apenas um borrão cinzento em sua janela. O som de uma orquestra clássica toca baixinho, mas não consegue preencher o silêncio opressivo. Ele mal toca na comida, a sofisticada refeição se resfriando enquanto ele observa o reflexo melancólico em sua taça de cristal.\n\n**ARTUR (V.O.)**\nCinquenta anos. Meio século gastando fortunas em coisas que não preenchem o vazio aqui dentro.  Obras de arte, carros de luxo, viagens... tudo isso ecoa em silêncio.  Como se eu estivesse gritando em um espaço vazio, sem nunca ser ouvido.\n\nEle pega um quadro antigo e observa-o atentamente, uma expressão de tristeza profunda em seu rosto.\n\n**[Cena 2]**\n\n**EXT. RUA DE SÃO PAULO - NOITE**\n\nChuva cai incessante sobre a cidade. Artur, agora em seu carro luxuoso, para em um sinal vermelho. Do outro lado da rua, encolhidos em um canto escuro e úmido, estão Miguel e Rafael (20 anos), dois gêmeos idênticos com roupas rasgadas e sujas. Seus rostos são magros, mas a semelhança entre eles é inegável, apesar da tristeza profunda que expressam. Eles estendem as mãos, pedindo esmola.\n\nArtur os observa com uma mistura de irritação e fascinação.  A semelhança perfeita dos gêmeos o deixa perturbado, como se estivesse olhando para um espelho distorcido de sua própria alma solitária.  A tristeza nos olhos deles, uma tristeza que ele reconhece em si mesmo, o intriga ainda mais.\n\n**[Cena 3]**\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONTINUAÇÃO)**\n\nO sinal muda e Artur parte, mas logo se detém em um local próximo. Hesitando, ele volta a pé até os gêmeos.  Sua aproximação é cautelosa, carregada de um peso inesperado que ele mesmo não compreende.\n\n**ARTUR**\n(Voz dura, mas com um tom de hesitação)\nVocês... precisam de alguma coisa?\n\nMiguel, o mais falante, olha para Artur com cautela.\n\n**MIGUEL**\n(Voz suave, quase um sussurro)\nUm pouco de comida, senhor... Se o senhor puder...\n\nArtur, sem responder, vai até um restaurante próximo e compra dois sanduíches e duas latas de refrigerante.  Entrega-os aos gêmeos em silêncio.  A atitude deles é agradecida, humilde.\n\n**RAFAEL**\n(Voz baixa, quase inaudível)\nObrigado, senhor.\n\n**[Cena 4]**\n\n**EXT. RUA DE SÃO PAULO - NOITE (CONTINUAÇÃO)**\n\nArtur, surpreendendo a si mesmo, senta-se ao lado deles no chão úmido.  A chuva continua a cair.  O diálogo é hesitante, mas aos poucos, a história dos gêmeos começa a ser revelada.  Eles contam sobre a separação dolorosa dos pais, a vida nas ruas, a luta constante pela sobrevivência.  Miguel revela, com a voz embargada, que sempre sonhou em ser músico.  Artur vê no olhar dele uma esperança que há muito tempo desapareceu de sua própria vida.\n\n**[Cena 5]**\n\n**INT. APARTAMENTO DE LUXO - NOITE**\n\nArtur leva os gêmeos para seu luxuoso apartamento.  O contraste é chocante.  Enquanto Miguel conta sua história com um leve sorriso ao tocar uma melodia triste em um pequeno violino improvisado, um pedaço de madeira com cordas soltas, Artur percebe o talento nato dos dois.  Sua atenção está presa à música, à delicadeza e tristeza que ela transmite. É uma melodia que ecoa a solidão que ele sente.\n\n**[Cena 6]**\n\n**INT. APARTAMENTO DE LUXO - NOITE (CONTINUAÇÃO)**\n\nEnquanto Miguel toca, Rafael fica em silêncio, observando tudo com um olhar intenso, quase assustador.  Artur, tocado pela música e pela história dos meninos, oferece ajuda.  Mas algo não está certo com Rafael. Ele se mostra retraído, frio, e evita o contato visual.\n\n**[Cena 7]**\n\n**INT. APARTAMENTO DE LUXO - QUARTO DE HÓSPEDES - NOITE**\n\nMais tarde, enquanto arruma a cama para os gêmeos, Artur encontra uma carta escondida no bolso do casaco de Rafael. Ele a pega hesitante, sentindo uma onda de apreensão.  A carta, escrita com uma caligrafia elegante, fala de um plano complexo, de pessoas poderosas e segredos do passado. A última frase é chocante: \"O jogo começou, Artur.\"\n\n**[FIM DO CAPÍTULO 1]**",
          "word_count": 692
        },
        {
          "chapter_number": 3,
          "title": "Capítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: A Melodia da Desconfiança\\n\\nCinco semanas se passaram desde que Artur acolheu Miguel e Rafael em seu apartamento.  O luxuoso lar, antes um santuário de solidão, agora ecoava com o som do violino de Miguel e os baixos compassos do teclado improvisado que Artur providenciou para Rafael.  Miguel, extrovertido e talentoso, florescia sob os cuidados de Artur.  Suas aulas de música com um renomado professor, pagas generosamente pelo milionário, transformavam sua melodia triste em sinfonias vibrantes.  Artur, por sua vez, encontrava um propósito inesperado, sentindo-se preenchido por algo além das posses materiais.  Ele observava Miguel com admiração, percebendo em seus olhos a mesma chama que havia se apagado em sua própria alma há muito tempo.\\n\\nNo entanto, Rafael permanecia um enigma.  Seu talento musical era indiscutível, sua habilidade no teclado surpreendentemente refinada, mas sua personalidade permanecia reservada, quase assustadoramente quieta.  Ele raramente falava, mantendo-se à sombra de Miguel, seus olhos escuros e penetrantes observando tudo e todos com uma intensidade desconcertante.  Artur, inicialmente atribuindo a reserva de Rafael ao trauma do passado, começou a sentir um desconforto crescente em sua presença.  Era uma sensação de inquietude, uma dissonância na harmonia aparentemente restaurada de sua vida.\\n\\nAs aulas de música se tornaram um palco para essa crescente tensão.  Enquanto Miguel brilhava, Rafael observava com uma frieza desconcertante, seus dedos dançando sobre as teclas, criando melodias que pareciam carregadas de uma profunda melancolia, quase ameaçadoras.  Artur notou que Rafael frequentemente olhava para a janela do apartamento, seu olhar fixo em algum ponto específico na cidade, como se esperasse algo, ou alguém.  Em uma dessas ocasiões, Artur o viu discretamente trocando mensagens criptografadas em um celular antigo que ele mantinha escondido.  A curiosidade de Artur chegou ao limite.\\n\\nEm uma noite, enquanto Miguel dormia, Artur confrontou Rafael.  A conversa foi difícil, pontuada por longos silêncios e respostas evasivas.  Rafael admitiu que não era tão honesto quanto Miguel, revelando que antes de Artur, eles sobreviviam vendendo informações confidenciais para um grupo misterioso, uma atividade que Rafael considerava necessária para sua sobrevivência e a de Miguel.  Ele negou envolvimento em qualquer atividade ilegal atual, mas sua reticência aumentou as suspeitas de Artur.\\n\\nDurante a busca discreta pelo quarto de Rafael, Artur descobriu um segundo compartimento secreto numa gaveta, onde encontrou uma segunda carta, idêntica em aparência à primeira, mas com uma mensagem ainda mais perturbadora. Esta revelava a participação de uma poderosa empresa de tecnologia em seu passado, um passado que ameaçava destruir Miguel e a si mesmo.  A carta terminava com uma nova ameaça: \\\"Artur, você se tornou um peão. Prepare-se para o xeque-mate.\\\"\\n\\nA descoberta deixou Artur em um estado de choque e apreensão.  A aparente bondade em sua ajuda aos gêmeos parecia ter desencadeado uma série de eventos que ameaçavam sua própria segurança e a dos meninos, mostrando que por trás da fachada dos dois músicos talentosos, havia um jogo sombrio e complexo em andamento, um jogo que ele havia inadvertidamente entrado.\"\n    }\n  ]\n}\n```",
          "word_count": 496
        },
        {
          "chapter_number": 4,
          "title": "Capítulo 4: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 3: A Sombra do Passado\\n\\nArtur, abalado pela descoberta da carta enigmática em Rafael, observa os gêmeos. Miguel, radiante com a nova vida que se descortina, ensaiando árias no piano de cauda do apartamento, parece alheio à inquietação que toma conta de Artur. Rafael, por sua vez, permanece retraído, seus olhos escuros refletem uma angústia profunda, que transcende a mera privação que antes marcara sua vida nas ruas.  Os dias que se seguem são um turbilhão de aulas de música, gravações em estúdio profissional e sessões de terapia com uma psicóloga especializada em traumas infantis. Artur investe tempo e dinheiro, mas a cada passo a mais na jornada de reconstrução dos gêmeos, mais perguntas assombram sua mente.  A psicóloga detecta sinais de manipulação em Rafael, que contradiz constantemente as versões de Miguel sobre o passado. A melhora de Miguel é visível, seu talento musical floresce como uma planta faminta sob o sol, mas a sombra sobre Rafael se aprofunda.  Artur mergulha em uma investigação particular, contratando um detetive experiente para desvendar o mistério da carta. O detetive descobre que a caligrafia da carta coincide com a de um empresário conhecido no submundo da música, um homem com reputação duvidosa, envolvido em tráfico de influências e lavagem de dinheiro.  Paralelamente, o detetive encontra informações sobre o passado dos gêmeos que contradizem o que Artur havia escutado até então. Eles não foram apenas abandonados; foram vítimas de um esquema complexo, envolvendo uma adoção fraudulenta que os destinava a um destino sombrio, um destino que Miguel escapou por pouco, deixando Rafael, o mais frágil, preso na teia de mentiras. A investigação leva Artur a confrontar sua própria arrogância e seus preconceitos, o que o levou a subestimar a complexidade da vida de rua e as engrenagens ocultas que movem os eventos.  O capítulo termina com o detetive informando Artur que Rafael está em perigo, que a menção do 'jogo' na carta não é apenas uma metáfora, e que a rede criminosa está se movimentando para recuperar seu ‘bem’ perdido. Artur enfrenta então uma escolha crucial: proteger os gêmeos e enfrentar a sombra implacável do passado ou recuar, protegendo sua própria vida e mergulhando de novo na sua solidão.  As últimas cenas mostram Artur em seu apartamento, cercado pela opulência que antes o alienava, mas agora é um fardo, enquanto a música de Miguel ecoa fracamente pelos corredores, lembrando-o da fragilidade da beleza e da urgência da luta contra a injustiça. \"\n    }\n  ]\n}\n```",
          "word_count": 418
        },
        {
          "chapter_number": 5,
          "title": "Capítulo 5: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ar...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Artur, abalado pela descoberta da carta e pelo comportamento errático de Rafael, mergulha numa investigação frenética.  A ajuda de um detetive particular, contratado às pressas, revela uma trama complexa envolvendo uma antiga rivalidade familiar e uma fortuna roubada décadas atrás. Miguel e Rafael não eram apenas gêmeos abandonados; eram peças-chave num plano de vingança arquitetado por seu pai, um homem que havia sido traído e despojado de sua herança por um sócio, o próprio avô de Artur.  O avô de Artur, um homem implacável e calculista, havia manipulado o sistema para apropriar-se da fortuna da família, deixando Miguel e Rafael na miséria.  A carta era o sinal para o início da execução do plano, um plano que envolvia não só a recuperação da fortuna, mas também uma vingança cuidadosamente orquestrada contra os herdeiros do império construído sobre a injustiça.  Artur, confrontado com a verdade, precisa escolher entre proteger sua própria família e sua recém-descoberta conexão com Miguel e Rafael. Ele percebe que a fortuna não o tornava feliz, mas a possibilidade de reparação e o amor recém-descoberto o fazem reavaliar a vida. Ele decide ajudar Miguel e Rafael a expôr a verdade, a reconstruir a justiça. A revelação ocorre durante um concerto beneficente organizado por Artur.  Miguel e Rafael, com suas habilidades musicais aprimoradas, tocam uma peça comovente e poderosa, cheia de emoção e de uma mensagem de esperança.  As imagens da performance são intercaladas com flashes do passado, mostrando a infância cruel dos gêmeos, a ambição cruel do avô de Artur e a busca por justiça. A multidão fica em silêncio, comovida pela história revelada, e a justiça prevalece com a exposição do avô de Artur e a devolução da fortuna para os gêmeos, culminando na reconciliação. O filme termina com Artur, Miguel e Rafael juntos, em uma cena reconfortante, numa casa aconchegante em meio a um jardim florido, distante dos prédios imponentes de São Paulo,  simbolizando uma nova vida construída sobre a base da justiça, amor e perdão. A câmera se concentra no rosto de Artur, finalmente com um sorriso genuíno, mostrando paz e a verdadeira riqueza encontrada em conexões humanas significativas.  O som da música dos gêmeos ecoa, um tema otimista e esperançoso que embala os créditos finais, sublinhando a transformação completa na vida de todos os envolvidos. A última cena mostra uma foto da família, Artur, Miguel e Rafael, sorrindo juntos em um quadro emoldurado.\"\n    }\n  ]\n}\n```",
          "word_count": 409
        }
      ],
      "chapters_generated": 5,
      "estimated_duration": 18.84,
      "style": "inicio",
      "generation_time": "2025-08-22T15:39:29.911190",
      "partial": false
    },
    "tts": {
      "audio_file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\temp\\tts_kokoro_1755877255.wav",
      "duration": 0,
      "file_size": 6681906,
      "provider_used": "kokoro",
      "voice": "af_bella",
      "speed": 1,
      "emotion": "neutral",
      "generation_time": "2025-08-22T16:00:59.958478"
    },
    "images": {
      "generated_images": [
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878468431_1.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878468431_1.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878468431_1.png",
          "file_size": 1984420,
          "resolution": "1920x1080",
          "prompt_used": "Capítulo 1: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V..., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:01:08.437940"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878485582_2.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878485582_2.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878485582_2.png",
          "file_size": 1589512,
          "resolution": "1920x1080",
          "prompt_used": "**INT. APARTAMENTO DE ARTUR - NOITE**, realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:01:25.586005"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878502377_3.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878502377_3.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878502377_3.png",
          "file_size": 1626669,
          "resolution": "1920x1080",
          "prompt_used": "**Cena 2:** (1:00-2:30), realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:01:42.381686"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878516260_4.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878516260_4.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878516260_4.png",
          "file_size": 1047668,
          "resolution": "1920x1080",
          "prompt_used": "**ARTUR:** (murmurando para si mesmo)  Deus..., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:01:56.264322"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878531784_5.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878531784_5.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878531784_5.png",
          "file_size": 1627597,
          "resolution": "1920x1080",
          "prompt_used": "Artur, surpreendendo a si mesmo, tira a carteira e pega uma nota de R$ 100,00.  Ele se aproxima cautelosamente dos gêmeos, que o encaram com uma mistura de esperança e receio., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:02:11.787850"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878555086_6.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878555086_6.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878555086_6.png",
          "file_size": 2250854,
          "resolution": "1920x1080",
          "prompt_used": "**ARTUR:** (olhando para Rafael) Vocês... são gêmeos, não é? Impressionante a semelhança., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:02:35.091198"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878570463_7.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878570463_7.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878570463_7.png",
          "file_size": 1329388,
          "resolution": "1920x1080",
          "prompt_used": "**MIGUEL:** Nunca mais vimos nossos pais, depois daquela separação..., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:02:50.466034"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878589027_8.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878589027_8.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878589027_8.png",
          "file_size": 1750578,
          "resolution": "1920x1080",
          "prompt_used": "Artur, profundamente comovido pela música, se aproxima de Miguel e pergunta como ele aprendeu a tocar. Ele expressa a vontade de ajudá-los., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:03:09.030352"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878608326_9.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878608326_9.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878608326_9.png",
          "file_size": 963394,
          "resolution": "1920x1080",
          "prompt_used": "De repente, Rafael coloca a mão no bolso.  Artur nota o movimento e um leve tremor em suas mãos.  Ele observa Rafael furtivamente, enquanto o menino tenta esconder algo., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:03:28.329262"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878628573_10.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878628573_10.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878628573_10.png",
          "file_size": 2113195,
          "resolution": "1920x1080",
          "prompt_used": "Capítulo 2: ## Milionário Chocado: Gêmeos Mendigos Mudam Sua V..., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:03:48.576411"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878656133_11.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878656133_11.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878656133_11.png",
          "file_size": 1473738,
          "resolution": "1920x1080",
          "prompt_used": "Artur (50, impecavelmente vestido, mas com um olhar cansado e vazio), janta sozinho em uma mesa imponente, cercado por obras de arte caras que parecem se mirar em seu desânimo.  A vista panorâmica de São Paulo, normalmente deslumbrante, hoje é apenas um borrão cinzento em sua janela. O som de uma orquestra clássica toca baixinho, mas não consegue preencher o silêncio opressivo. Ele mal toca na comida, a sofisticada refeição se resfriando enquanto ele observa o reflexo melancólico em sua taça de cristal., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:04:16.136020"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878681795_12.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878681795_12.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878681795_12.png",
          "file_size": 2424136,
          "resolution": "1920x1080",
          "prompt_used": "**EXT. RUA DE SÃO PAULO - NOITE**, realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:04:41.798775"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878698244_13.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878698244_13.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878698244_13.png",
          "file_size": 1629905,
          "resolution": "1920x1080",
          "prompt_used": "O sinal muda e Artur parte, mas logo se detém em um local próximo. Hesitando, ele volta a pé até os gêmeos.  Sua aproximação é cautelosa, carregada de um peso inesperado que ele mesmo não compreende., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:04:58.247351"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878714820_14.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878714820_14.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878714820_14.png",
          "file_size": 1739572,
          "resolution": "1920x1080",
          "prompt_used": "Artur, sem responder, vai até um restaurante próximo e compra dois sanduíches e duas latas de refrigerante.  Entrega-os aos gêmeos em silêncio.  A atitude deles é agradecida, humilde., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:05:14.823477"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878743053_15.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878743053_15.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878743053_15.png",
          "file_size": 1630343,
          "resolution": "1920x1080",
          "prompt_used": "Artur, surpreendendo a si mesmo, senta-se ao lado deles no chão úmido.  A chuva continua a cair.  O diálogo é hesitante, mas aos poucos, a história dos gêmeos começa a ser revelada.  Eles contam sobre a separação dolorosa dos pais, a vida nas ruas, a luta constante pela sobrevivência.  Miguel revela, com a voz embargada, que sempre sonhou em ser músico.  Artur vê no olhar dele uma esperança que há muito tempo desapareceu de sua própria vida., realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:05:43.056805"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878758826_16.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878758826_16.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878758826_16.png",
          "file_size": 1910771,
          "resolution": "1920x1080",
          "prompt_used": "**[Cena 6]**, realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:05:58.830394"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878772470_17.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878772470_17.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878772470_17.png",
          "file_size": 1805375,
          "resolution": "1920x1080",
          "prompt_used": "**INT. APARTAMENTO DE LUXO - QUARTO DE HÓSPEDES - NOITE**, realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:06:12.472800"
        },
        {
          "file_path": "C:\\Users\\Enderson\\Documents\\APP\\auto-video-producer\\backend\\services\\..\\output\\images\\pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878786021_18.png",
          "filename": "pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878786021_18.png",
          "url": "/api/images/view/pipeline_d6627a65-8246-43cb-b579-9dc2f0396dd4_image_1755878786021_18.png",
          "file_size": 1474745,
          "resolution": "1920x1080",
          "prompt_used": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: A Melodia da Desconfiança\\n\\nCinco semanas se passaram desde que Artur acolheu Miguel e Rafael em seu apartamento.  O luxuoso lar, antes um santuário de solidão, agora ecoava com o som do violino de Miguel e os baixos compassos do teclado improvisado que Artur providenciou para Rafael.  Miguel, extrovertido e talentoso, florescia sob os cuidados de Artur.  Suas aulas de música com um renomado professor, pagas generosamente pelo milionário, transformavam sua melodia triste em sinfonias vibrantes.  Artur, por sua vez, encontrava um propósito inesperado, sentindo-se preenchido por algo além das posses materiais.  Ele observava Miguel com admiração, percebendo em seus olhos a mesma chama que havia se apagado em sua própria alma há muito tempo.\\n\\nNo entanto, Rafael permanecia um enigma.  Seu talento musical era indiscutível, sua habilidade no teclado surpreendentemente refinada, mas sua personalidade permanecia reservada, quase assustadoramente quieta.  Ele raramente falava, mantendo-se à sombra de Miguel, seus olhos escuros e penetrantes observando tudo e todos com uma intensidade desconcertante.  Artur, inicialmente atribuindo a reserva de Rafael ao trauma do passado, começou a sentir um desconforto crescente em sua presença.  Era uma sensação de inquietude, uma dissonância na harmonia aparentemente restaurada de sua vida.\\n\\nAs aulas de música se tornaram um palco para essa crescente tensão.  Enquanto Miguel brilhava, Rafael observava com uma frieza desconcertante, seus dedos dançando sobre as teclas, criando melodias que pareciam carregadas de uma profunda melancolia, quase ameaçadoras.  Artur notou que Rafael frequentemente olhava para a janela do apartamento, seu olhar fixo em algum ponto específico na cidade, como se esperasse algo, ou alguém.  Em uma dessas ocasiões, Artur o viu discretamente trocando mensagens criptografadas em um celular antigo que ele mantinha escondido.  A curiosidade de Artur chegou ao limite.\\n\\nEm uma noite, enquanto Miguel dormia, Artur confrontou Rafael.  A conversa foi difícil, pontuada por longos silêncios e respostas evasivas.  Rafael admitiu que não era tão honesto quanto Miguel, revelando que antes de Artur, eles sobreviviam vendendo informações confidenciais para um grupo misterioso, uma atividade que Rafael considerava necessária para sua sobrevivência e a de Miguel.  Ele negou envolvimento em qualquer atividade ilegal atual, mas sua reticência aumentou as suspeitas de Artur.\\n\\nDurante a busca discreta pelo quarto de Rafael, Artur descobriu um segundo compartimento secreto numa gaveta, onde encontrou uma segunda carta, idêntica em aparência à primeira, mas com uma mensagem ainda mais perturbadora. Esta revelava a participação de uma poderosa empresa de tecnologia em seu passado, um passado que ameaçava destruir Miguel e a si mesmo.  A carta terminava com uma nova ameaça: \\\"Artur, você se tornou um peão. Prepare-se para o xeque-mate.\\\"\\n\\nA descoberta deixou Artur em um estado de choque e apreensão.  A aparente bondade em sua ajuda aos gêmeos parecia ter desencadeado uma série de eventos que ameaçavam sua própria segurança e a dos meninos, mostrando que por trás da fachada dos dois músicos talentosos, havia um jogo sombrio e complexo em andamento, um jogo que ele havia inadvertidamente entrado.\"\n    }\n  ]\n}\n```, realistic",
          "provider": "pollinations",
          "generation_time": "2025-08-22T16:06:26.022430"
        }
      ],
      "total_images": 18,
      "provider_used": "pollinations",
      "style": "realistic",
      "resolution": "1920x1080",
      "generation_time": "2025-08-22T16:06:26.040408"
    }
  },
  "config": {
    "extraction": {
      "enabled": true,
      "method": "yt-dlp",
      "rapidapi_key": ""
    },
    "titles": {
      "enabled": true,
      "provider": "gemini",
      "count": 1,
      "style": "viral",
      "language": "pt-BR",
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "premises": {
      "enabled": true,
      "provider": "gemini",
      "style": "educational",
      "target_audience": "general",
      "word_count": 200,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "scripts": {
      "enabled": true,
      "provider": "gemini",
      "chapters": 5,
      "duration_target": "5-7 minutes",
      "include_intro": true,
      "include_outro": true,
      "custom_prompts": false,
      "custom_inicio": "",
      "custom_meio": "",
      "custom_fim": ""
    },
    "tts": {
      "enabled": true,
      "provider": "kokoro",
      "voice": "af_bella",
      "language": "en",
      "speed": 1,
      "pitch": 1
    },
    "images": {
      "enabled": true,
      "provider": "pollinations",
      "style": "realistic",
      "quality": "high",
      "count_per_chapter": 2,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "video": {
      "enabled": true,
      "resolution": "1920x1080",
      "fps": 30,
      "format": "mp4",
      "include_subtitles": false,
      "transition_duration": 0.5
    },
    "prompts": {
      "titles": {
        "viral": "Crie títulos virais e envolventes para o vídeo sobre: {topic}. Os títulos devem ser chamativos, despertar curiosidade e incentivar cliques.",
        "educational": "Crie títulos educacionais e informativos para o vídeo sobre: {topic}. Os títulos devem ser claros, diretos e indicar o valor educacional.",
        "professional": "Crie títulos profissionais e sérios para o vídeo sobre: {topic}. Os títulos devem transmitir autoridade e credibilidade."
      },
      "premises": {
        "narrative": "Crie uma premissa narrativa envolvente para um vídeo sobre: {title}. A premissa deve contar uma história cativante em aproximadamente {word_count} palavras.",
        "educational": "Crie uma premissa educacional estruturada para um vídeo sobre: {title}. A premissa deve apresentar os pontos de aprendizado em aproximadamente {word_count} palavras.",
        "informative": "Crie uma premissa informativa e objetiva para um vídeo sobre: {title}. A premissa deve apresentar fatos e informações relevantes em aproximadamente {word_count} palavras."
      },
      "scripts": {
        "inicio": "# Prompt — Início\n\nEscreva uma narrativa de {genre} intitulada \"{title}\".\n\nPremissa: {premise}\n\nEste é o INÍCIO da história. Deve estabelecer:\n- Personagens principais e suas motivações\n- Cenário e atmosfera da história\n- Conflito principal que moverá a narrativa\n- Tom inicial da narrativa\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na descrição de cenários, personagens, ações e diálogos.",
        "meio": "# Prompt — Meio\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEsta é a continuação do MEIO da história. Deve:\n- Continuar a narrativa de forma orgânica e coerente\n- Desenvolver os personagens e suas relações\n- Intensificar o conflito principal\n- Adicionar novos elementos de tensão\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso. Cada capítulo deve ter conteúdo substancial e rico em detalhes.",
        "fim": "# Prompt — Fim\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEste é o FIM da história. Deve:\n- Resolver o conflito principal estabelecido no início\n- Proporcionar conclusão satisfatória para todos os personagens principais\n- Entregar o clímax esperado da história\n- Fechar a história de forma impactante\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na conclusão. Garanta um fechamento rico e satisfatório."
      },
      "images": {
        "cinematic": "Crie uma descrição cinematográfica para uma imagem que represente: {scene_description}. A imagem deve ter qualidade cinematográfica, boa iluminação e composição profissional.",
        "minimalist": "Crie uma descrição minimalista para uma imagem que represente: {scene_description}. A imagem deve ser limpa, simples e com foco no elemento principal.",
        "artistic": "Crie uma descrição artística para uma imagem que represente: {scene_description}. A imagem deve ser criativa, expressiva e visualmente impactante."
      }
    }
  },
  "progress": {},
  "version": "1.0"
}