{
  "pipeline_id": "a431aae3-06fd-4dfc-a9e3-ab5cb0abdb05",
  "timestamp": "2025-08-22T20:23:07.953992",
  "current_step": "tts",
  "completed_steps": [
    "extraction",
    "titles",
    "premises",
    "scripts"
  ],
  "results": {
    "extraction": {
      "channel_info": {},
      "titles": [
        {
          "video_id": "UOxr16mOgD8",
          "title": "Back to the future - Del Rey de volta para o futuro",
          "description": "We do this video in brasil, very cool",
          "thumbnail": "",
          "duration": "129.0s",
          "views": 13808,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=UOxr16mOgD8"
        },
        {
          "video_id": "Rfv7m3lgHw8",
          "title": "Game Coral",
          "description": "Coral de musica de jogos",
          "thumbnail": "",
          "duration": "280.0s",
          "views": 8708,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=Rfv7m3lgHw8"
        }
      ],
      "total_extracted": 2,
      "method_used": "auto",
      "extraction_time": "2025-08-22T20:21:10.367148"
    },
    "titles": {
      "generated_titles": [
        "Del Rey no Game Coral: Volta pro Futuro? 😱  A viagem NO TEMPO que você PRECISA ver!",
        "Del Rey em Game Coral: Volta pro Futuro que você NÃO esperava!",
        "Del Rey no Game Coral: Volta para o Futuro? 😱  A viagem no tempo que você precisa VER!",
        "Del Rey no Game Coral: Volta para o Futuro? 😱  A REVELAÇÃO que vai te chocar!",
        "De volta ao futuro com Game Coral: A experiência surreal que vai te chocar!"
      ],
      "source_titles_count": 2,
      "provider_used": "gemini",
      "style": "viral",
      "generation_time": "2025-08-22T20:21:13.750963"
    },
    "premises": {
      "selected_title": "Del Rey no Game Coral: Volta pro Futuro? 😱  A viagem NO TEMPO que você PRECISA ver!",
      "premise": "Este vídeo mergulha na eletrizante jornada temporal de Del Rey no universo do Game Coral, explorando a possibilidade de uma surpreendente \"volta pro futuro\" dentro da narrativa do jogo.  Direcionado a fãs de Game Coral, entusiastas de viagens no tempo e jogadores que apreciam mistérios e reviravoltas narrativas, o vídeo adota um tom animado e misterioso, intercalando cenas de gameplay com análises perspicazes.  A premissa central gira em torno de evidências dentro do jogo que sugerem a manipulação do tempo, incluindo anomalias temporais, objetos fora de contexto e diálogos enigmáticos que insinuam a existência de múltiplas linhas temporais.  Abordaremos, de forma detalhada e com exemplos práticos, as principais teorias sobre a manipulação temporal em Game Coral, analisando possíveis paradoxos e consequências.  Exploraremos também como essas viagens no tempo afetam a história principal e os personagens, mostrando como detalhes aparentemente insignificantes podem ter um impacto monumental na trama.  O vídeo culminará com uma análise especulativa sobre o futuro do jogo e como a mecânica temporal poderá ser explorada em possíveis expansões ou sequências, deixando o espectador instigado e ansioso pelas próximas revelações.  Prepare-se para uma jornada temporal inesquecível!\n",
      "word_count": 187,
      "provider_used": "gemini",
      "generation_time": "2025-08-22T20:21:16.024170"
    },
    "scripts": {
      "title": "Del Rey no Game Coral: Volta pro Futuro? 😱  A viagem NO TEMPO que você PRECISA ver!",
      "premise": "Este vídeo mergulha na eletrizante jornada temporal de Del Rey no universo do Game Coral, explorando a possibilidade de uma surpreendente \"volta pro futuro\" dentro da narrativa do jogo.  Direcionado a fãs de Game Coral, entusiastas de viagens no tempo e jogadores que apreciam mistérios e reviravoltas narrativas, o vídeo adota um tom animado e misterioso, intercalando cenas de gameplay com análises perspicazes.  A premissa central gira em torno de evidências dentro do jogo que sugerem a manipulação do tempo, incluindo anomalias temporais, objetos fora de contexto e diálogos enigmáticos que insinuam a existência de múltiplas linhas temporais.  Abordaremos, de forma detalhada e com exemplos práticos, as principais teorias sobre a manipulação temporal em Game Coral, analisando possíveis paradoxos e consequências.  Exploraremos também como essas viagens no tempo afetam a história principal e os personagens, mostrando como detalhes aparentemente insignificantes podem ter um impacto monumental na trama.  O vídeo culminará com uma análise especulativa sobre o futuro do jogo e como a mecânica temporal poderá ser explorada em possíveis expansões ou sequências, deixando o espectador instigado e ansioso pelas próximas revelações.  Prepare-se para uma jornada temporal inesquecível!\n",
      "script": "Capítulo 1: ## Del Rey no Game Coral: Volta pro Futuro? 😱  A v...\n\n## Del Rey no Game Coral: Volta pro Futuro? 😱  A viagem NO TEMPO que você PRECISA ver! - Roteiro (Parte 1)\n\n\n**Introdução (4-6 minutos)**\n\n**(0:00-0:30) - Abertura:**\n\n* **Visual:**  Montagem rápida e dinâmica com cenas de gameplay de Coral Game, focando em Lunara (avatar de Sofia) resolvendo puzzles e explorando a Floresta Encantada.  Música épica e misteriosa ao fundo.  Imagens rápidas intercaladas com títulos estilizados: \"Del Rey\", \"Coral Game\", \"Viagem no Tempo?\".\n* **Áudio:** Narrador com voz vibrante e envolvente: \"Prepare-se para mergulhar no mistério mais eletrizante de Coral Game!  Uma aventura que transcende o tempo, desafiando os limites da realidade virtual… e da própria realidade!\"\n\n**(0:30-1:30) - Introdução de Sofia e Coral Game:**\n\n* **Visual:**  Transição suave para a câmera em close na tela do computador, mostrando Sofia (22 anos, cabelos castanhos, óculos, expressão concentrada) jogando Coral Game.  Sua mesa é organizada, porém cheia de itens relacionados ao jogo: canecas, pôsteres, livros de artes conceituais.\n* **Áudio:** Narrador: \"Conheçam Sofia Silva, uma programadora de 22 anos, completamente obcecada por Coral Game, um MMORPG que mistura fantasia épica com um mistério instigante.  No mundo virtual, ela é Lunara, uma elfa guerreira conhecida por sua inteligência aguçada e habilidade em desvendar os enigmas mais complexos do jogo...\"\n\n**(1:30-2:30) - Exploração da Floresta Encantada:**\n\n* **Visual:**  Gameplay mostrando Lunara explorando a Floresta Encantada.  A floresta é exuberante, com árvores gigantescas, névoas misteriosas, ruínas antigas parcialmente cobertas pela vegetação.  Há efeitos visuais sutis que insinuam anomalias temporais:  rápidos flashes de imagens diferentes, objetos que parecem se mover sozinhos, sombras fugidias.\n* **Áudio:** Narrador: \"A Floresta Encantada guarda segredos ancestrais… e anomalias temporais inexplicáveis.  É nesse lugar enigmático que Lunara se aventura em busca de respostas...\" Música ambiente sombria, mas com toques de mistério e suspense.\n\n**(2:30-3:30) - Descoberta do Artefato:**\n\n* **Visual:**  Close no avatar de Lunara.  Ela encontra um artefato antigo e misterioso em meio às ruínas – um orbe de cristal pulsando com uma luz fraca e azulada.  Animação detalhada do artefato, com partículas de luz flutuando ao redor.\n* **Áudio:**  Efeitos sonoros de suspense.  Um som misterioso e agudo é ouvido.  Narrador:  \"Ao tocar o artefato, Lunara sente uma vibração poderosa… um choque que atravessa o mundo virtual… e o real.\"\n\n**(3:30-4:30) - A Viagem no Tempo:**\n\n* **Visual:**  A tela do computador começa a tremer, as cores distorcem, imagens aleatórias piscam na tela.  A câmera se move rapidamente entre a tela do computador e o rosto de Sofia, que mostra uma expressão de choque e medo.  O quarto de Sofia se distorce, objetos se movem sozinhos, as paredes parecem respirar.\n* **Áudio:**  Efeitos sonoros de distorção temporal:  ruídos eletrônicos, eco, zumbidos.  Música tensa e dissonante.  Sofia (voz em off, nervosa):  \"O que está acontecendo...? O tempo… está se desfazendo!\"\n\n**(4:30-5:30) - Coral Game Distorcido:**\n\n* **Visual:**  A perspectiva muda abruptamente para uma versão distorcida e sombria da Floresta Encantada.  As árvores estão secas e retorcidas, as ruínas estão mais destruídas, a atmosfera é opressiva e nebulosa.  Lunara está no mesmo local, mas tudo ao redor parece mais antigo e decrépito.  Personagens do jogo aparecem, mas com aparências e comportamentos diferentes, mais sombrios.\n* **Áudio:**  Música ambiente mais pesada e sombria.  Sons de criaturas grotescas ao fundo.\n\n**(5:30-6:00) - Encontro com o Sábio:**\n\n* **Visual:**  Lunara encontra um velho sábio sentado em meio às ruínas, envolto em uma aura misteriosa.  O sábio tem uma aparência cadavérica, mas seus olhos brilham com sabedoria.\n* **Áudio:** Sábio (voz grave e rouca):  \"Você viajou no tempo, criança.  A chave para o retorno está no coração da floresta… onde o tempo não existe.\"  A câmera foca no artefato na mão de Lunara, mostrando um misterioso símbolo começando a brilhar.  Um rugido distante e aterrorizante ecoa pela floresta, interrompendo a fala do sábio.  A cena termina com Lunara fugindo de criaturas distorcidas que surgem do nada.\n\n**(Final da Parte 1)**\n\nCapítulo 2: ## Coral Game: Volta pro Futuro? - Capítulo 1: O A...\n\n## Coral Game: Volta pro Futuro? - Capítulo 1: O Artefato do Tempo\n\n\n**[Cena 1: Quarto de Sofia - Dia - 2 Minutos]**\n\nA câmera foca em Sofia Silva (22 anos), olhos cansados fixos na tela do computador.  Seu quarto é pequeno, mas repleto de posters de Coral Game e itens de colecionador.  A tela mostra Lunara, seu avatar elfo guerreiro em Coral Game, explorando uma ruína antiga na Floresta Encantada.  A música ambiente é uma trilha sonora épica e misteriosa, com nuances eletrônicas.\n\n**Sofia (Voz off):**  Mais uma noite em Coral Game.  Já perdi a conta de quantas horas estou aqui.  Mas essa floresta... tem algo diferente.  Uma energia... estranha.\n\nA câmera se aproxima da tela, mostrando detalhes da ruína virtual.  Lunara se aproxima de um altar em ruínas, onde um artefato antigo e misterioso brilha com uma luz etérea.  Texturas detalhadas da interface do jogo são mostradas, junto com mensagens de chat e o mapa do jogo.\n\n**[Cena 2: Floresta Encantada - Coral Game - 1 Minuto]**\n\nA perspectiva muda abruptamente para a visão em primeira pessoa de Lunara na floresta.  Efeitos visuais sofisticados simulam a imersão no jogo.  A câmera acompanha Lunara enquanto ela se aproxima do artefato.  Sons de floresta, vento e o som suave da música do jogo criam uma atmosfera de suspense.\n\n**[Cena 3: Quarto de Sofia - Dia - 1 Minuto]**\n\nDe repente, a tela do computador treme violentamente.  Imagens distorcidas e flashes de luz branca invadem a tela.  Sofia solta um grito abafado.  A vibração se intensifica, atingindo o próprio quarto físico.  Livros caem das prateleiras.  A câmera foca nos olhos arregalados de Sofia, refletindo o terror e a confusão.\n\n**[Cena 4: Floresta Encantada Distorcida - Coral Game - 2 Minutos]**\n\nA perspectiva retorna para a visão em primeira pessoa, mas a Floresta Encantada está diferente.  As cores são mais desbotadas, as árvores estão quebradas e retorcidas.  O céu é um tom acinzentado e ameaçador.  Criaturas distorcidas, versões grotescas dos inimigos de Coral Game, aparecem ao longe, se movendo com uma agilidade sobrenatural.  Sons de passos pesados e rugidos assustadores preenchem o áudio.  Lunara parece mais fraca, suas animações são mais pesadas.\n\n**[Cena 5: Encontro com o Sábio - 1 Minuto]**\n\nLunara encontra um velho sábio, sua aparência diferente do NPC do jogo original.  Ele tem um olhar penetrante e um semblante cansado, usando roupas esfarrapadas.\n\n**Sábio:** (Voz rouca e grave) Você... viajou pelo tempo, criança.  Este artefato... ele é a chave, e a armadilha.\n\n**Lunara (Sofia):** O que aconteceu? Como eu volto?\n\n**Sábio:** A chave para o seu retorno está no coração da floresta, onde o tempo não existe. Mas apresse-se...  Eles estão vindo...\n\nO sábio desaparece em um clarão.  Criaturas distorcidas surgem, atacando Lunara.\n\n**[Cena 6: Fuga e Esconderijo - 1 Minuto]**\n\nLunara corre desesperadamente pela floresta distorcida, lutando contra as criaturas.  A câmera mostra uma perseguição tensa, utilizando close-ups e ângulos dinâmicos para criar suspense.  Lunara finalmente encontra refúgio em uma caverna escura.  Ferida e ofegante, ela segura o artefato.  Um símbolo misterioso começa a brilhar fracamente nele, acompanhado por um som distante e ameaçador.  A câmera fecha em close no símbolo e no rosto assustado de Sofia, refletindo sua incerteza e medo.  O som misterioso ecoa pela caverna.  A tela escurece.\n\n\n**(FIM DO CAPÍTULO 1)**\n\nCapítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: O Eco do Tempo Perdido\\n\\nSofia, ofegante e ferida, se encolhe na escuridão úmida da caverna. O artefato, um amuleto de obsidiana esculpido com símbolos estranhos, pulsa fracamente em sua mão, emitindo um calor reconfortante que contrasta com o frio da pedra bruta que a circunda.  A respiração irregular ecoa no silêncio, quebrando apenas o som distante e misterioso que a havia perturbado anteriormente – um zumbido metálico, como o de uma máquina antiga funcionando em overdrive.  Ela examina o amuleto novamente. O símbolo que brilhara antes agora está mais intenso, emitindo uma luz púrpura que dança sobre as paredes da caverna, projetando sombras grotescas e distorcidas das estalactites e estalagmites.\\n\\nLentamente, Sofia se levanta, apoiando-se em uma parede rochosa.  Suas feridas ardem, a dor latejante em cada movimento.  Ela precisa encontrar um lugar mais seguro, uma estratégia para sobreviver.  O velho sábio mencionou o \\\"coração da floresta\\\", um lugar onde o tempo não existe.  Mas o que isso significa? E como chegar lá?\\n\\nAs criaturas distorcidas, versões grotescas dos monstros de Coral Game, rondam sua mente. Elas eram mais rápidas, mais fortes, quase… inteligentes. Seus movimentos eram coordenados, sugerindo uma organização, uma estratégia de ataque que ela não esperava encontrar em um simples jogo.  Foi como se a própria essência do jogo tivesse se tornado maligna, corrompida pela distorção temporal.\\n\\nCom cautela, Sofia sai da caverna. A Floresta Encantada está diferente. As árvores são retorcidas, seus galhos secos e negros, e a vegetação é escassa e doentia. O ar está pesado, carregado de uma energia estranha, quase palpável.  Ela se move pela floresta em ruínas, observando atentamente cada canto, cada sombra.  O zumbido metálico se intensifica à medida que ela se aproxima do centro da floresta, guiada por um instinto quase animal.  \\n\\nAo atravessar uma clareira, Sofia se depara com uma visão surreal: um gigantesco relógio de sol de metal retorcido, seu gnomon partido e enferrujado, cravado no solo.  Em volta dele, fragmentos de tempo parecem flutuar no ar – imagens fragmentadas de momentos diferentes da história do Coral Game, personagens em diferentes estágios de suas vidas, eventos que ela testemunhou e outros que não reconhece. É um turbilhão visual de passado, presente e futuro misturados em um caos temporal.\\n\\nDe repente, ela entende a dica do sábio.  O \\\"coração da floresta\\\", onde o tempo não existe, é este relógio de sol destruído – o epicentro da distorção temporal.  Mas como pode ela utilizá-lo para voltar ao seu tempo?  Enquanto ela observa os fragmentos de tempo flutuando, percebe uma estranha coerência no caos:  cada fragmento contém uma pequena peça de um antigo código, escrito numa linguagem desconhecida. O código brilha com a mesma luz púrpura do artefato.\\n\\nA luz púrpura do amuleto intensifica, pulsando em sincronia com o zumbido metálico, que agora é quase ensurdecedor.  Sofia sente um puxão, uma força poderosa que a atrai para o relógio de sol.  Ela hesita por um momento, mas a urgência da situação a impulsiona para frente. Ao se aproximar do relógio, ela ouve uma voz sussurrante, que parece emanar do próprio artefato: \\\"O passado, o presente, o futuro... tudo conectado, tudo um só.  Descubra o código... e você retornará\\\".\\n\\nNo entanto, enquanto Sofia estende a mão para tocar no relógio de sol, uma figura sombria emerge das sombras, suas feições distorcidas e ameaçadoras.  É uma versão corrompida do Guardião da Floresta, mais poderoso e monstruoso do que qualquer coisa que ela já enfrentou em Coral Game.  A batalha para recuperar seu tempo está apenas começando...\"\n    }\n  ]\n}\n```\n\nCapítulo 4: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 3: O Eco do Tempo Perdido\\n\\nSofia, ofegante e ferida, se encolhe na escuridão úmida da caverna. O artefato, um amuleto de obsidiana com estranhos símbolos gravados, pulsa fracamente em sua mão, emitindo um calor reconfortante que contrasta com o frio gélido da pedra. O eco do rugido das criaturas distorcidas ainda ressoa em seus ouvidos, um som grotesco que a faz tremer. A visão da Floresta Encantada distorcida continua gravada em sua mente: árvores retorcidas, o céu um borrão de cores estranhas, e as criaturas... criaturas que pareciam saídas de um pesadelo, versões grotescas e amplificadas dos monstros de Coral Game.\\n\\nEla examina o artefato novamente. O símbolo que brilhou antes, agora mais intenso, parece se assemelhar a um relógio de areia, porém com os grãos de areia se movendo para cima e para baixo simultaneamente, criando uma ilusão de um fluxo temporal descontrolado. Ela se lembra das palavras do velho sábio: \\\"A chave para o retorno está no coração da floresta, onde o tempo não existe.\\\"  Mas qual o significado? Qual o coração da floresta? A floresta que ela conhece já não existe mais. Essa versão distorcida... é uma outra linha do tempo? Ou uma dimensão paralela totalmente diferente?\\n\\nApós alguns minutos, a adrenalina começa a diminuir, dando lugar à dor física.  Ela examina seus ferimentos: cortes profundos em seus braços e pernas, resultado do ataque das criaturas. Com dificuldade, ela encontra um pedaço de tecido rasgado em sua mochila e o usa para estancar o sangue. A dor a força a se concentrar no presente, no medo iminente de ser encontrada.  Ela precisa se mover, pensar estrategicamente.\\n\\nUtilizando o brilho fraco do artefato como uma luz precária, Sofia explora a caverna. Ela descobre um pequeno túnel estreito, quase invisível na penumbra. Hesitando por um instante, ela decide segui-lo. O túnel é apertado e lamacento, obrigando-a a rastejar.  A cada metro percorrido, a umidade aumenta, o ar fica mais denso e o silêncio quase ensurdecedor.  De repente, o túnel abre para uma pequena câmara subterrânea.\\n\\nNo centro da câmara, há um espelho antigo, coberto de poeira e teias de aranha. A superfície do espelho está rachada em vários lugares, mas mesmo assim reflete uma imagem distorcida.  Ao se aproximar, Sofia percebe que não é uma reflexão normal. A imagem no espelho mostra flashes de diferentes momentos de sua aventura em Coral Game: a descoberta do artefato, a distorção do tempo, o ataque das criaturas, mas também... vislumbres de momentos que ela não se lembra de ter vivido, cenas enigmáticas e repentinas de uma Lunara diferente, mais poderosa, mais experiente.  Em alguns flashes, ela vê Lunara interagindo com uma figura misteriosa, encoberta por uma capa escura, que parece lhe oferecer o artefato.\\n\\nUm arrepio percorre sua espinha.  A imagem no espelho se intensifica, o brilho do artefato em sua mão se sincroniza com a luz que emana do espelho.  Um turbilhão de imagens e sons a atinge, uma avalanche de informações que parecem quebrar as barreiras de sua mente. Ela sente uma conexão profunda, quase sobrenatural, com o espelho e o artefato, uma sensação de que a resposta que ela busca está em algum lugar dentro desses fragmentos de memória fragmentados.  De repente, tudo se apaga. O espelho fica negro.  Sofia está sozinha novamente, na escuridão, mas com uma sensação de que algo mudou... um novo fragmento da chave se encaixou.\\n\\nUm novo som ecoa pela câmara, não mais um rugido distante, mas uma melodia antiga e misteriosa, como uma canção de ninar que quebra o silêncio, a conduzindo a algum lugar.\\n\"\n    }\n  ]\n}\n```\n\nCapítulo 5: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"So...\n\n```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Sofia, encolhida na escuridão úmida da caverna, examina o artefato. O símbolo misterioso pulsa com uma luz fraca, projetando sombras dançantes nas paredes de pedra.  O eco distante que a assombrou na caverna se aproxima, revelando-se como o som de passos pesados e arrastados.  Ela se levanta, cambaleante, agarrando a adaga de Lunara, sua única defesa.  As criaturas distorcidas, grotescas sombras das criaturas de Coral Game, emergem da escuridão, seus olhos vermelhos brilhando como brasas.  A luta é brutal.  Sofia, apesar de ferida, utiliza toda sua experiência em Coral Game para se defender, usando o cenário a seu favor e explorando as fraquezas das criaturas. Ela desfere golpes precisos, guiada pela memória muscular de anos jogando.  A cada criatura derrotada, o brilho no artefato intensifica. Finalmente, exausta e machucada, mas vitoriosa, Sofia se encontra sozinha na caverna.  O artefato agora brilha intensamente, projetando um feixe de luz que ilumina um caminho até o fundo da caverna.  Seguindo a luz, ela encontra uma passagem secreta, escondida atrás de uma cascata. Ao atravessá-la, Sofia chega a uma clareira no centro da Floresta Encantada. É um local diferente de tudo que ela já viu em Coral Game, um espaço surreal, onde as leis da física parecem distorcidas. As árvores flutuam, o tempo parece fluir em círculos e o ar vibra com energia pura.  No centro da clareira, uma antiga árvore milenar se eleva majestosamente. Seu tronco é adornado com runas que brilham com a mesma energia do artefato.  Sofia compreende.  Este é o coração da floresta, onde o tempo não existe. Ela toca na árvore, sentindo uma onda de energia que a envolve, e tudo fica branco.  Quando Sofia abre os olhos, ela está de volta ao seu quarto, seu computador ligado mostrando a tela inicial de Coral Game.  Tudo parece normal.  Ela verifica seu avatar, Lunara, que está intacta.  Mas algo é diferente. Lunara agora possui uma nova habilidade, a capacidade de manipular pequenas distorções temporais, um reflexo da sua jornada no tempo. Sofia se lembra de tudo – a luta, as criaturas distorcidas, o velho sábio.  A experiência a transformou, deixando-a mais confiante e determinada.  Ela retorna à Floresta Encantada, mas desta vez, com novos objetivos.  Ela usa sua habilidade recém-descoberta para investigar as anomalias temporais, buscando novas pistas e desvendando os segredos da manipulação do tempo em Coral Game.  A jornada de Sofia não termina ali.  Na verdade, ela acaba de começar.  O vídeo termina com uma cena épica, mostrando Lunara explorando novas áreas da Floresta Encantada, áreas anteriormente inacessíveis, e interagindo com novas criaturas e personagens. O brilho do artefato em seu inventário sugere novas aventuras, ainda mais complexas, que estão por vir.  O espectador fica com a sensação de que a história de Sofia em Coral Game está apenas no início de um futuro repleto de possibilidades infinitas e mistérios a serem desvendados. Uma mensagem final aparece na tela: \\\"A viagem no tempo é apenas o começo. O que o futuro reserva para Sofia e Coral Game? Descubra na próxima atualização!\\\" \"\n    }\n  ]\n}\n```",
      "chapters": [
        {
          "chapter_number": 1,
          "title": "Capítulo 1: ## Del Rey no Game Coral: Volta pro Futuro? 😱  A v...",
          "content": "## Del Rey no Game Coral: Volta pro Futuro? 😱  A viagem NO TEMPO que você PRECISA ver! - Roteiro (Parte 1)\n\n\n**Introdução (4-6 minutos)**\n\n**(0:00-0:30) - Abertura:**\n\n* **Visual:**  Montagem rápida e dinâmica com cenas de gameplay de Coral Game, focando em Lunara (avatar de Sofia) resolvendo puzzles e explorando a Floresta Encantada.  Música épica e misteriosa ao fundo.  Imagens rápidas intercaladas com títulos estilizados: \"Del Rey\", \"Coral Game\", \"Viagem no Tempo?\".\n* **Áudio:** Narrador com voz vibrante e envolvente: \"Prepare-se para mergulhar no mistério mais eletrizante de Coral Game!  Uma aventura que transcende o tempo, desafiando os limites da realidade virtual… e da própria realidade!\"\n\n**(0:30-1:30) - Introdução de Sofia e Coral Game:**\n\n* **Visual:**  Transição suave para a câmera em close na tela do computador, mostrando Sofia (22 anos, cabelos castanhos, óculos, expressão concentrada) jogando Coral Game.  Sua mesa é organizada, porém cheia de itens relacionados ao jogo: canecas, pôsteres, livros de artes conceituais.\n* **Áudio:** Narrador: \"Conheçam Sofia Silva, uma programadora de 22 anos, completamente obcecada por Coral Game, um MMORPG que mistura fantasia épica com um mistério instigante.  No mundo virtual, ela é Lunara, uma elfa guerreira conhecida por sua inteligência aguçada e habilidade em desvendar os enigmas mais complexos do jogo...\"\n\n**(1:30-2:30) - Exploração da Floresta Encantada:**\n\n* **Visual:**  Gameplay mostrando Lunara explorando a Floresta Encantada.  A floresta é exuberante, com árvores gigantescas, névoas misteriosas, ruínas antigas parcialmente cobertas pela vegetação.  Há efeitos visuais sutis que insinuam anomalias temporais:  rápidos flashes de imagens diferentes, objetos que parecem se mover sozinhos, sombras fugidias.\n* **Áudio:** Narrador: \"A Floresta Encantada guarda segredos ancestrais… e anomalias temporais inexplicáveis.  É nesse lugar enigmático que Lunara se aventura em busca de respostas...\" Música ambiente sombria, mas com toques de mistério e suspense.\n\n**(2:30-3:30) - Descoberta do Artefato:**\n\n* **Visual:**  Close no avatar de Lunara.  Ela encontra um artefato antigo e misterioso em meio às ruínas – um orbe de cristal pulsando com uma luz fraca e azulada.  Animação detalhada do artefato, com partículas de luz flutuando ao redor.\n* **Áudio:**  Efeitos sonoros de suspense.  Um som misterioso e agudo é ouvido.  Narrador:  \"Ao tocar o artefato, Lunara sente uma vibração poderosa… um choque que atravessa o mundo virtual… e o real.\"\n\n**(3:30-4:30) - A Viagem no Tempo:**\n\n* **Visual:**  A tela do computador começa a tremer, as cores distorcem, imagens aleatórias piscam na tela.  A câmera se move rapidamente entre a tela do computador e o rosto de Sofia, que mostra uma expressão de choque e medo.  O quarto de Sofia se distorce, objetos se movem sozinhos, as paredes parecem respirar.\n* **Áudio:**  Efeitos sonoros de distorção temporal:  ruídos eletrônicos, eco, zumbidos.  Música tensa e dissonante.  Sofia (voz em off, nervosa):  \"O que está acontecendo...? O tempo… está se desfazendo!\"\n\n**(4:30-5:30) - Coral Game Distorcido:**\n\n* **Visual:**  A perspectiva muda abruptamente para uma versão distorcida e sombria da Floresta Encantada.  As árvores estão secas e retorcidas, as ruínas estão mais destruídas, a atmosfera é opressiva e nebulosa.  Lunara está no mesmo local, mas tudo ao redor parece mais antigo e decrépito.  Personagens do jogo aparecem, mas com aparências e comportamentos diferentes, mais sombrios.\n* **Áudio:**  Música ambiente mais pesada e sombria.  Sons de criaturas grotescas ao fundo.\n\n**(5:30-6:00) - Encontro com o Sábio:**\n\n* **Visual:**  Lunara encontra um velho sábio sentado em meio às ruínas, envolto em uma aura misteriosa.  O sábio tem uma aparência cadavérica, mas seus olhos brilham com sabedoria.\n* **Áudio:** Sábio (voz grave e rouca):  \"Você viajou no tempo, criança.  A chave para o retorno está no coração da floresta… onde o tempo não existe.\"  A câmera foca no artefato na mão de Lunara, mostrando um misterioso símbolo começando a brilhar.  Um rugido distante e aterrorizante ecoa pela floresta, interrompendo a fala do sábio.  A cena termina com Lunara fugindo de criaturas distorcidas que surgem do nada.\n\n**(Final da Parte 1)**",
          "word_count": 646
        },
        {
          "chapter_number": 2,
          "title": "Capítulo 2: ## Coral Game: Volta pro Futuro? - Capítulo 1: O A...",
          "content": "## Coral Game: Volta pro Futuro? - Capítulo 1: O Artefato do Tempo\n\n\n**[Cena 1: Quarto de Sofia - Dia - 2 Minutos]**\n\nA câmera foca em Sofia Silva (22 anos), olhos cansados fixos na tela do computador.  Seu quarto é pequeno, mas repleto de posters de Coral Game e itens de colecionador.  A tela mostra Lunara, seu avatar elfo guerreiro em Coral Game, explorando uma ruína antiga na Floresta Encantada.  A música ambiente é uma trilha sonora épica e misteriosa, com nuances eletrônicas.\n\n**Sofia (Voz off):**  Mais uma noite em Coral Game.  Já perdi a conta de quantas horas estou aqui.  Mas essa floresta... tem algo diferente.  Uma energia... estranha.\n\nA câmera se aproxima da tela, mostrando detalhes da ruína virtual.  Lunara se aproxima de um altar em ruínas, onde um artefato antigo e misterioso brilha com uma luz etérea.  Texturas detalhadas da interface do jogo são mostradas, junto com mensagens de chat e o mapa do jogo.\n\n**[Cena 2: Floresta Encantada - Coral Game - 1 Minuto]**\n\nA perspectiva muda abruptamente para a visão em primeira pessoa de Lunara na floresta.  Efeitos visuais sofisticados simulam a imersão no jogo.  A câmera acompanha Lunara enquanto ela se aproxima do artefato.  Sons de floresta, vento e o som suave da música do jogo criam uma atmosfera de suspense.\n\n**[Cena 3: Quarto de Sofia - Dia - 1 Minuto]**\n\nDe repente, a tela do computador treme violentamente.  Imagens distorcidas e flashes de luz branca invadem a tela.  Sofia solta um grito abafado.  A vibração se intensifica, atingindo o próprio quarto físico.  Livros caem das prateleiras.  A câmera foca nos olhos arregalados de Sofia, refletindo o terror e a confusão.\n\n**[Cena 4: Floresta Encantada Distorcida - Coral Game - 2 Minutos]**\n\nA perspectiva retorna para a visão em primeira pessoa, mas a Floresta Encantada está diferente.  As cores são mais desbotadas, as árvores estão quebradas e retorcidas.  O céu é um tom acinzentado e ameaçador.  Criaturas distorcidas, versões grotescas dos inimigos de Coral Game, aparecem ao longe, se movendo com uma agilidade sobrenatural.  Sons de passos pesados e rugidos assustadores preenchem o áudio.  Lunara parece mais fraca, suas animações são mais pesadas.\n\n**[Cena 5: Encontro com o Sábio - 1 Minuto]**\n\nLunara encontra um velho sábio, sua aparência diferente do NPC do jogo original.  Ele tem um olhar penetrante e um semblante cansado, usando roupas esfarrapadas.\n\n**Sábio:** (Voz rouca e grave) Você... viajou pelo tempo, criança.  Este artefato... ele é a chave, e a armadilha.\n\n**Lunara (Sofia):** O que aconteceu? Como eu volto?\n\n**Sábio:** A chave para o seu retorno está no coração da floresta, onde o tempo não existe. Mas apresse-se...  Eles estão vindo...\n\nO sábio desaparece em um clarão.  Criaturas distorcidas surgem, atacando Lunara.\n\n**[Cena 6: Fuga e Esconderijo - 1 Minuto]**\n\nLunara corre desesperadamente pela floresta distorcida, lutando contra as criaturas.  A câmera mostra uma perseguição tensa, utilizando close-ups e ângulos dinâmicos para criar suspense.  Lunara finalmente encontra refúgio em uma caverna escura.  Ferida e ofegante, ela segura o artefato.  Um símbolo misterioso começa a brilhar fracamente nele, acompanhado por um som distante e ameaçador.  A câmera fecha em close no símbolo e no rosto assustado de Sofia, refletindo sua incerteza e medo.  O som misterioso ecoa pela caverna.  A tela escurece.\n\n\n**(FIM DO CAPÍTULO 1)**",
          "word_count": 547
        },
        {
          "chapter_number": 3,
          "title": "Capítulo 3: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 2: O Eco do Tempo Perdido\\n\\nSofia, ofegante e ferida, se encolhe na escuridão úmida da caverna. O artefato, um amuleto de obsidiana esculpido com símbolos estranhos, pulsa fracamente em sua mão, emitindo um calor reconfortante que contrasta com o frio da pedra bruta que a circunda.  A respiração irregular ecoa no silêncio, quebrando apenas o som distante e misterioso que a havia perturbado anteriormente – um zumbido metálico, como o de uma máquina antiga funcionando em overdrive.  Ela examina o amuleto novamente. O símbolo que brilhara antes agora está mais intenso, emitindo uma luz púrpura que dança sobre as paredes da caverna, projetando sombras grotescas e distorcidas das estalactites e estalagmites.\\n\\nLentamente, Sofia se levanta, apoiando-se em uma parede rochosa.  Suas feridas ardem, a dor latejante em cada movimento.  Ela precisa encontrar um lugar mais seguro, uma estratégia para sobreviver.  O velho sábio mencionou o \\\"coração da floresta\\\", um lugar onde o tempo não existe.  Mas o que isso significa? E como chegar lá?\\n\\nAs criaturas distorcidas, versões grotescas dos monstros de Coral Game, rondam sua mente. Elas eram mais rápidas, mais fortes, quase… inteligentes. Seus movimentos eram coordenados, sugerindo uma organização, uma estratégia de ataque que ela não esperava encontrar em um simples jogo.  Foi como se a própria essência do jogo tivesse se tornado maligna, corrompida pela distorção temporal.\\n\\nCom cautela, Sofia sai da caverna. A Floresta Encantada está diferente. As árvores são retorcidas, seus galhos secos e negros, e a vegetação é escassa e doentia. O ar está pesado, carregado de uma energia estranha, quase palpável.  Ela se move pela floresta em ruínas, observando atentamente cada canto, cada sombra.  O zumbido metálico se intensifica à medida que ela se aproxima do centro da floresta, guiada por um instinto quase animal.  \\n\\nAo atravessar uma clareira, Sofia se depara com uma visão surreal: um gigantesco relógio de sol de metal retorcido, seu gnomon partido e enferrujado, cravado no solo.  Em volta dele, fragmentos de tempo parecem flutuar no ar – imagens fragmentadas de momentos diferentes da história do Coral Game, personagens em diferentes estágios de suas vidas, eventos que ela testemunhou e outros que não reconhece. É um turbilhão visual de passado, presente e futuro misturados em um caos temporal.\\n\\nDe repente, ela entende a dica do sábio.  O \\\"coração da floresta\\\", onde o tempo não existe, é este relógio de sol destruído – o epicentro da distorção temporal.  Mas como pode ela utilizá-lo para voltar ao seu tempo?  Enquanto ela observa os fragmentos de tempo flutuando, percebe uma estranha coerência no caos:  cada fragmento contém uma pequena peça de um antigo código, escrito numa linguagem desconhecida. O código brilha com a mesma luz púrpura do artefato.\\n\\nA luz púrpura do amuleto intensifica, pulsando em sincronia com o zumbido metálico, que agora é quase ensurdecedor.  Sofia sente um puxão, uma força poderosa que a atrai para o relógio de sol.  Ela hesita por um momento, mas a urgência da situação a impulsiona para frente. Ao se aproximar do relógio, ela ouve uma voz sussurrante, que parece emanar do próprio artefato: \\\"O passado, o presente, o futuro... tudo conectado, tudo um só.  Descubra o código... e você retornará\\\".\\n\\nNo entanto, enquanto Sofia estende a mão para tocar no relógio de sol, uma figura sombria emerge das sombras, suas feições distorcidas e ameaçadoras.  É uma versão corrompida do Guardião da Floresta, mais poderoso e monstruoso do que qualquer coisa que ela já enfrentou em Coral Game.  A batalha para recuperar seu tempo está apenas começando...\"\n    }\n  ]\n}\n```",
          "word_count": 589
        },
        {
          "chapter_number": 4,
          "title": "Capítulo 4: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Ca...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Capítulo 3: O Eco do Tempo Perdido\\n\\nSofia, ofegante e ferida, se encolhe na escuridão úmida da caverna. O artefato, um amuleto de obsidiana com estranhos símbolos gravados, pulsa fracamente em sua mão, emitindo um calor reconfortante que contrasta com o frio gélido da pedra. O eco do rugido das criaturas distorcidas ainda ressoa em seus ouvidos, um som grotesco que a faz tremer. A visão da Floresta Encantada distorcida continua gravada em sua mente: árvores retorcidas, o céu um borrão de cores estranhas, e as criaturas... criaturas que pareciam saídas de um pesadelo, versões grotescas e amplificadas dos monstros de Coral Game.\\n\\nEla examina o artefato novamente. O símbolo que brilhou antes, agora mais intenso, parece se assemelhar a um relógio de areia, porém com os grãos de areia se movendo para cima e para baixo simultaneamente, criando uma ilusão de um fluxo temporal descontrolado. Ela se lembra das palavras do velho sábio: \\\"A chave para o retorno está no coração da floresta, onde o tempo não existe.\\\"  Mas qual o significado? Qual o coração da floresta? A floresta que ela conhece já não existe mais. Essa versão distorcida... é uma outra linha do tempo? Ou uma dimensão paralela totalmente diferente?\\n\\nApós alguns minutos, a adrenalina começa a diminuir, dando lugar à dor física.  Ela examina seus ferimentos: cortes profundos em seus braços e pernas, resultado do ataque das criaturas. Com dificuldade, ela encontra um pedaço de tecido rasgado em sua mochila e o usa para estancar o sangue. A dor a força a se concentrar no presente, no medo iminente de ser encontrada.  Ela precisa se mover, pensar estrategicamente.\\n\\nUtilizando o brilho fraco do artefato como uma luz precária, Sofia explora a caverna. Ela descobre um pequeno túnel estreito, quase invisível na penumbra. Hesitando por um instante, ela decide segui-lo. O túnel é apertado e lamacento, obrigando-a a rastejar.  A cada metro percorrido, a umidade aumenta, o ar fica mais denso e o silêncio quase ensurdecedor.  De repente, o túnel abre para uma pequena câmara subterrânea.\\n\\nNo centro da câmara, há um espelho antigo, coberto de poeira e teias de aranha. A superfície do espelho está rachada em vários lugares, mas mesmo assim reflete uma imagem distorcida.  Ao se aproximar, Sofia percebe que não é uma reflexão normal. A imagem no espelho mostra flashes de diferentes momentos de sua aventura em Coral Game: a descoberta do artefato, a distorção do tempo, o ataque das criaturas, mas também... vislumbres de momentos que ela não se lembra de ter vivido, cenas enigmáticas e repentinas de uma Lunara diferente, mais poderosa, mais experiente.  Em alguns flashes, ela vê Lunara interagindo com uma figura misteriosa, encoberta por uma capa escura, que parece lhe oferecer o artefato.\\n\\nUm arrepio percorre sua espinha.  A imagem no espelho se intensifica, o brilho do artefato em sua mão se sincroniza com a luz que emana do espelho.  Um turbilhão de imagens e sons a atinge, uma avalanche de informações que parecem quebrar as barreiras de sua mente. Ela sente uma conexão profunda, quase sobrenatural, com o espelho e o artefato, uma sensação de que a resposta que ela busca está em algum lugar dentro desses fragmentos de memória fragmentados.  De repente, tudo se apaga. O espelho fica negro.  Sofia está sozinha novamente, na escuridão, mas com uma sensação de que algo mudou... um novo fragmento da chave se encaixou.\\n\\nUm novo som ecoa pela câmara, não mais um rugido distante, mas uma melodia antiga e misteriosa, como uma canção de ninar que quebra o silêncio, a conduzindo a algum lugar.\\n\"\n    }\n  ]\n}\n```",
          "word_count": 597
        },
        {
          "chapter_number": 5,
          "title": "Capítulo 5: ```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"So...",
          "content": "```json\n{\n  \"Prompts\": [\n    {\n      \"prompt\": \"Sofia, encolhida na escuridão úmida da caverna, examina o artefato. O símbolo misterioso pulsa com uma luz fraca, projetando sombras dançantes nas paredes de pedra.  O eco distante que a assombrou na caverna se aproxima, revelando-se como o som de passos pesados e arrastados.  Ela se levanta, cambaleante, agarrando a adaga de Lunara, sua única defesa.  As criaturas distorcidas, grotescas sombras das criaturas de Coral Game, emergem da escuridão, seus olhos vermelhos brilhando como brasas.  A luta é brutal.  Sofia, apesar de ferida, utiliza toda sua experiência em Coral Game para se defender, usando o cenário a seu favor e explorando as fraquezas das criaturas. Ela desfere golpes precisos, guiada pela memória muscular de anos jogando.  A cada criatura derrotada, o brilho no artefato intensifica. Finalmente, exausta e machucada, mas vitoriosa, Sofia se encontra sozinha na caverna.  O artefato agora brilha intensamente, projetando um feixe de luz que ilumina um caminho até o fundo da caverna.  Seguindo a luz, ela encontra uma passagem secreta, escondida atrás de uma cascata. Ao atravessá-la, Sofia chega a uma clareira no centro da Floresta Encantada. É um local diferente de tudo que ela já viu em Coral Game, um espaço surreal, onde as leis da física parecem distorcidas. As árvores flutuam, o tempo parece fluir em círculos e o ar vibra com energia pura.  No centro da clareira, uma antiga árvore milenar se eleva majestosamente. Seu tronco é adornado com runas que brilham com a mesma energia do artefato.  Sofia compreende.  Este é o coração da floresta, onde o tempo não existe. Ela toca na árvore, sentindo uma onda de energia que a envolve, e tudo fica branco.  Quando Sofia abre os olhos, ela está de volta ao seu quarto, seu computador ligado mostrando a tela inicial de Coral Game.  Tudo parece normal.  Ela verifica seu avatar, Lunara, que está intacta.  Mas algo é diferente. Lunara agora possui uma nova habilidade, a capacidade de manipular pequenas distorções temporais, um reflexo da sua jornada no tempo. Sofia se lembra de tudo – a luta, as criaturas distorcidas, o velho sábio.  A experiência a transformou, deixando-a mais confiante e determinada.  Ela retorna à Floresta Encantada, mas desta vez, com novos objetivos.  Ela usa sua habilidade recém-descoberta para investigar as anomalias temporais, buscando novas pistas e desvendando os segredos da manipulação do tempo em Coral Game.  A jornada de Sofia não termina ali.  Na verdade, ela acaba de começar.  O vídeo termina com uma cena épica, mostrando Lunara explorando novas áreas da Floresta Encantada, áreas anteriormente inacessíveis, e interagindo com novas criaturas e personagens. O brilho do artefato em seu inventário sugere novas aventuras, ainda mais complexas, que estão por vir.  O espectador fica com a sensação de que a história de Sofia em Coral Game está apenas no início de um futuro repleto de possibilidades infinitas e mistérios a serem desvendados. Uma mensagem final aparece na tela: \\\"A viagem no tempo é apenas o começo. O que o futuro reserva para Sofia e Coral Game? Descubra na próxima atualização!\\\" \"\n    }\n  ]\n}\n```",
          "word_count": 514
        }
      ],
      "chapters_generated": 5,
      "estimated_duration": 19.64666666666667,
      "style": "inicio",
      "generation_time": "2025-08-22T20:22:02.834329",
      "partial": false
    }
  },
  "config": {
    "extraction": {
      "method": "auto",
      "max_titles": 10,
      "min_views": 1000,
      "days_back": 30
    },
    "titles": {
      "provider": "gemini",
      "custom_prompt": false,
      "count": 5,
      "style": "viral"
    },
    "premises": {
      "provider": "gemini",
      "custom_prompt": false,
      "word_count": 200
    },
    "scripts": {
      "chapters": 5,
      "style": "inicio",
      "duration_target": "5-7 minutes",
      "include_hooks": true
    },
    "tts": {
      "provider": "kokoro",
      "voice": "default",
      "speed": 1.0,
      "emotion": "neutral"
    },
    "images": {
      "provider": "pollinations",
      "style": "cinematic",
      "resolution": "1920x1080",
      "per_chapter": 2
    },
    "video": {
      "resolution": "1920x1080",
      "fps": 30,
      "quality": "high",
      "transitions": true,
      "subtitles": true
    }
  },
  "progress": {},
  "version": "1.0"
}