{
  "pipeline_id": "6e19dff7-53c7-4769-a34a-081a3babc259",
  "timestamp": "2025-08-22T20:29:26.013496",
  "current_step": "tts",
  "completed_steps": [
    "extraction",
    "titles",
    "premises",
    "scripts"
  ],
  "results": {
    "extraction": {
      "channel_info": {},
      "titles": [
        {
          "video_id": "v-djT7RdoBA",
          "title": "MILIONÁRIO FLAGRA FAXINEIRA PROTEGENDO SUA FILHA CEGA… E NÃO ACREDITA NO QUE VÊ!",
          "description": "MILIONÁRIO FLAGRA FAXINEIRA PROTEGENDO SUA FILHA CEGA… E NÃO ACREDITA NO QUE VÊ!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasdesuperação...",
          "thumbnail": "",
          "duration": "7826.0s",
          "views": 8660,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=v-djT7RdoBA"
        },
        {
          "video_id": "dLGBChmJ6Pc",
          "title": "\"PODEMOS COMER COM VOCÊ?\" — MENINA COM SUA IRMÃ NO COLO OLHA PARA O MILIONÁRIO E ELE MUDA TUDO!",
          "description": "\"PODEMOS COMER COM VOCÊ?\" — MENINA COM SUA IRMÃ NO COLO OLHA PARA O MILIONÁRIO E ELE MUDA TUDO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históri...",
          "thumbnail": "",
          "duration": "7989.0s",
          "views": 3051,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=dLGBChmJ6Pc"
        },
        {
          "video_id": "f8heWcgZ7Zc",
          "title": "\"EU FALO 8 IDIOMAS\" – A MENINA DISSE ORGULHOSA, TODOS RIRAM… MENOS O MILIONÁRIO, QUE FICOU EM CHOQUE",
          "description": "\"EU FALO 8 IDIOMAS\" – A MENINA DISSE ORGULHOSA, TODOS RIRAM… MENOS O MILIONÁRIO, QUE FICOU EM CHOQUE\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras...",
          "thumbnail": "",
          "duration": "7907.0s",
          "views": 1919,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=f8heWcgZ7Zc"
        },
        {
          "video_id": "dSGvesGrEtM",
          "title": "EMPREGADA GRÁVIDA DESMAIA NA MANSÃO DO MILIONÁRIO E O QUE ESCONDIA NO VENTRE SURPREENDE A TODOS!",
          "description": "EMPREGADA GRÁVIDA DESMAIA NA MANSÃO DO MILIONÁRIO E O QUE ESCONDIA NO VENTRE SURPREENDE A TODOS!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #história...",
          "thumbnail": "",
          "duration": "7480.0s",
          "views": 20493,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=dSGvesGrEtM"
        },
        {
          "video_id": "GSLCE9f4CKg",
          "title": "\"SUA FILHA PODERIA ANDAR, MAS SUA NOIVA NÃO DEIXA!\"… DESABAFOU O MENINO POBRE AO MILIONÁRIO",
          "description": "\"SUA FILHA PODERIA ANDAR, MAS SUA NOIVA NÃO DEIXA!\"… DESABAFOU O MENINO POBRE AO MILIONÁRIO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasdes...",
          "thumbnail": "",
          "duration": "7448.0s",
          "views": 39911,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=GSLCE9f4CKg"
        },
        {
          "video_id": "D3wVC2ekfaM",
          "title": "MENINO POBRE IMPLORA AO MILIONÁRIO POR LEITE PARA O IRMÃO... E A REAÇÃO DELE TRANSFORMA TUDO",
          "description": "MENINO POBRE IMPLORA AO MILIONÁRIO POR LEITE PARA O IRMÃO... E A REAÇÃO DELE TRANSFORMA TUDO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasde...",
          "thumbnail": "",
          "duration": "8020.0s",
          "views": 4039,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=D3wVC2ekfaM"
        },
        {
          "video_id": "7WjJ-Sd0HSk",
          "title": "MILLIONÁRIO VÊ SEU FILHO AJUDANDO A COZINHEIRA A PREPARAR A COMIDA E PRESENCIA ALGO INESPERADO!",
          "description": "MILLIONÁRIO VÊ SEU FILHO AJUDANDO A COZINHEIRA A PREPARAR A COMIDA E PRESENCIA ALGO INESPERADO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #históriasd...",
          "thumbnail": "",
          "duration": "8324.0s",
          "views": 4137,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=7WjJ-Sd0HSk"
        },
        {
          "video_id": "exfN4z55B-I",
          "title": "\"PAI, AQUELES DOIS MENINOS DORMINDO NO LIXO SÃO PARECIDOS COMIGO\", DISSE O GAROTO AO MILIONÁRIO!",
          "description": "\"PAI, AQUELES DOIS MENINOS DORMINDO NO LIXO SÃO PARECIDOS COMIGO\", DISSE O GAROTO AO MILIONÁRIO!\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #histórias...",
          "thumbnail": "",
          "duration": "7267.0s",
          "views": 181746,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=exfN4z55B-I"
        },
        {
          "video_id": "u8XYfdgQAcE",
          "title": "MILIONÁRIO COMPRA TODA MERCADORIA DE UMA CRIANÇA VENDENDO DOCES NA RUA E FAZ UM PEDIDO INESPERADO",
          "description": "MILIONÁRIO COMPRA TODA MERCADORIA DE UMA CRIANÇA VENDENDO DOCES NA RUA E FAZ UM PEDIDO INESPERADO\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras #história...",
          "thumbnail": "",
          "duration": "8335.0s",
          "views": 3556,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=u8XYfdgQAcE"
        },
        {
          "video_id": "1zGtqccmwmg",
          "title": "MILIONÁRIO, EM SEUS ÚLTIMOS DIAS, ADOTA DOIS GÊMEOS MENDIGOS… SEM IMAGINAR O IMPACTO EM SUA VIDA",
          "description": "MILIONÁRIO, EM SEUS ÚLTIMOS DIAS, ADOTA DOIS GÊMEOS MENDIGOS… SEM IMAGINAR O IMPACTO EM SUA VIDA\n\n#historias #historiasreais #histórias #históriasemocionantes #historiasinspiradoras...",
          "thumbnail": "",
          "duration": "7637.0s",
          "views": 7672,
          "likes": 0,
          "published_at": "",
          "url": "https://www.youtube.com/watch?v=1zGtqccmwmg"
        }
      ],
      "total_extracted": 10,
      "method_used": "yt-dlp",
      "extraction_time": "2025-08-22T20:28:19.582735"
    },
    "titles": {
      "generated_titles": [
        "Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre!"
      ],
      "source_titles_count": 10,
      "provider_used": "gemini",
      "style": "viral",
      "generation_time": "2025-08-22T20:28:23.545808"
    },
    "premises": {
      "selected_title": "Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre!",
      "premise": "Este vídeo, direcionado a um público que gosta de histórias inspiradoras de superação e reviravoltas de destino, acompanha a jornada improvável de dois gêmeos idênticos, João e Pedro, que vivem nas ruas em total pobreza.  O vídeo, com um tom otimista e esperançoso, mas também com momentos de emoção genuína, mostra como a vida deles muda drasticamente após um encontro casual com um milionário excêntrico, Arthur, que é profundamente tocado pela história dos irmãos.  Arthur, um homem de negócios bem-sucedido, mas solitário, vê em João e Pedro a oportunidade de retribuir à sociedade e encontra neles uma conexão inesperada.  O vídeo documentará a transformação dos gêmeos, desde a ajuda financeira inicial de Arthur até o desenvolvimento de suas habilidades e o processo de construção de um futuro independente e digno.  Pontos-chave incluem o impacto da pobreza extrema na vida dos gêmeos, a revelação do caráter bondoso e resiliente deles, o desenvolvimento de uma relação improvável entre os irmãos e Arthur, e o processo de adaptação e crescimento pessoal que transforma a vida deles para sempre.  O vídeo culminará em um final emocionante, mostrando a realização dos sonhos dos gêmeos e a demonstração de que, mesmo em circunstâncias adversas, a esperança e a bondade podem mudar completamente o curso de uma vida.\n",
      "word_count": 211,
      "provider_used": "gemini",
      "generation_time": "2025-08-22T20:28:25.980430"
    },
    "scripts": {
      "title": "Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre!",
      "premise": "Este vídeo, direcionado a um público que gosta de histórias inspiradoras de superação e reviravoltas de destino, acompanha a jornada improvável de dois gêmeos idênticos, João e Pedro, que vivem nas ruas em total pobreza.  O vídeo, com um tom otimista e esperançoso, mas também com momentos de emoção genuína, mostra como a vida deles muda drasticamente após um encontro casual com um milionário excêntrico, Arthur, que é profundamente tocado pela história dos irmãos.  Arthur, um homem de negócios bem-sucedido, mas solitário, vê em João e Pedro a oportunidade de retribuir à sociedade e encontra neles uma conexão inesperada.  O vídeo documentará a transformação dos gêmeos, desde a ajuda financeira inicial de Arthur até o desenvolvimento de suas habilidades e o processo de construção de um futuro independente e digno.  Pontos-chave incluem o impacto da pobreza extrema na vida dos gêmeos, a revelação do caráter bondoso e resiliente deles, o desenvolvimento de uma relação improvável entre os irmãos e Arthur, e o processo de adaptação e crescimento pessoal que transforma a vida deles para sempre.  O vídeo culminará em um final emocionante, mostrando a realização dos sonhos dos gêmeos e a demonstração de que, mesmo em circunstâncias adversas, a esperança e a bondade podem mudar completamente o curso de uma vida.\n",
      "script": "Capítulo 1: ## Milionário Chocado: Gêmeos Mendicantes Mudam Su...\n\n## Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre! - Roteiro (Parte 1)\n\n**Duração estimada:** 4-5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**Local:** Apartamento de cobertura luxuoso de Artur. Janela panorâmica com vista para a cidade.  Chuva forte.  Artur (60 anos, aparência distinta, mas com um ar de profunda melancolia) está sentado em uma poltrona de couro, observando a chuva cair. O ambiente é sofisticado, mas solitário. A decoração é minimalista, mas opulenta.  Música ambiente suave e melancólica.\n\n**(Voz em off, narrador):** Artur, um milionário excêntrico, construiu um império. Mas a riqueza não preencheu o vazio em seu coração.  Sua vida, um labirinto de luxo e solidão.  Até que uma noite chuvosa, seu mundo mudou para sempre.\n\nArtur pega uma taça de uísque, mas não a leva aos lábios.  Seus olhos estão fixos na rua abaixo, onde dois jovens, Zé e Luís (20 anos), gêmeos idênticos, mal cobertos contra a chuva, tentam se abrigar debaixo de uma marquise.  A câmera foca nos gêmeos, mostrando a pobreza em seus trajes, a expressão de exaustão em seus rostos.\n\n**(Voz em off, narrador):** Zé e Luís, gêmeos idênticos, sobrevivendo nas ruas, um reflexo da crueldade da pobreza.  Sua resiliência, um grito silencioso contra a indiferença.\n\nArtur observa-os por um longo tempo, um misto de compaixão e fascínio em seu olhar.  Ele finalmente pega o telefone, hesita, e depois o desliga.\n\n**Cena 2:** (1:00-2:30)\n\n**Local:** Rua molhada. Zé e Luís se abrigam, tremendo de frio.  Zé tenta animar Luís, que está mais abatido.  Zé tenta vender alguns poucos lenços usados.\n\n**Zé:** (Voz rouca, mas com um toque otimista)  Vamos, Luís. Mais uma noite. Amanhã, quem sabe?  Talvez encontremos algo melhor.\n\n**Luís:** (Voz baixa, sem esperança)  Não tem mais nada, Zé.  Só... chuva e frio.\n\nUm carro luxuoso para ao lado deles. É Artur, que os observa pela janela.  Ele desce do carro, um guarda-chuva o protegendo da chuva.  Zé e Luís se assustam, pensando em algo ruim.\n\n**Artur:** (Voz calma, mas firme)  Boa noite, rapazes.  Vocês... estão bem?\n\nZé e Luís trocam olhares, hesitantes.\n\n**Zé:** (Cauteloso)  Sim, senhor.  Obrigado.\n\n**Luís:** (Sussurra)  Estamos bem...\n\nArtur se aproxima, oferecendo o guarda-chuva.\n\n**Artur:**  A chuva está forte.  Por que não vêm comigo?  Tenho um lugar seco onde vocês podem se aquecer.\n\n**Zé:** (Surpreso)  Com o senhor...?\n\n**Luís:** (Incrêdulo)  Não sei...\n\n**Artur:** (Com um sorriso gentil)  Não precisam temer.  Só quero ajudá-los.\n\n**Cena 3:** (2:30-4:00)\n\n**Local:** O luxuoso apartamento de Artur. Zé e Luís estão sentados em um sofá enorme, olhando para tudo com incrédula espanto.  Artur oferece chocolate quente e um cobertor.\n\n**Artur:**  Vocês devem estar famintos.  Há comida suficiente para todos nós.\n\nZé e Luís hesitam em comer, observando tudo ao redor.  A riqueza incomoda Luís, que mantém o olhar fixo no chão.  Zé, no entanto, demonstra mais abertura.\n\n**Zé:** (Agradecido)  Muito obrigado, senhor.  É... é muito generoso da sua parte.\n\n**Luís:** (Quieto, desconfiado)  Obrigado.\n\n**Artur:**  Chame-me de Artur.  E por favor, comam.  Vocês precisam recuperar as forças.\n\nArtur observa os gêmeos, percebendo suas diferenças. Zé é mais aberto, receptivo; Luís fechado, traumatizado.\n\n**Cena 4:** (4:00-5:00)\n\n**Local:** Quarto de hóspedes no apartamento de Artur. Zé e Luís tentam dormir em camas confortáveis. Luís não consegue, revivendo memórias de sua vida na rua, enquanto Zé dorme profundamente após a refeição e a exaustão.  Luís encontra uma carta antiga e antiga e desgastada, meio escondida em seus poucos pertences. Ele tenta ler, mas o conteúdo permanece obscuro.\n\n**(Voz em off, narrador):** A mudança drástica de vida trouxe novos desafios.  A riqueza de Artur confrontou a dura realidade dos gêmeos, criando um triângulo de afeto e dependência, mas um mistério emerge...\n\nA câmera foca na carta antiga nas mãos de Luís, com uma música de suspense.  Um close na letra ilegível.  Um som de vidro quebrando em algum lugar na cobertura... sugerindo a presença de outra pessoa.\n\n**(FIM DA PARTE 1)**\n\nCapítulo 2: ## Milionário Chocado: Gêmeos Mendicantes Mudam Su...\n\n## Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre! - Capítulo 1: O Encontro\n\n**Duração Estimada:** 6 minutos\n\n\n**[CENA 1]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE CHUVOSA**\n\nUm imenso apartamento de cobertura, decorado com um estilo minimalista e frio, mas com vistas deslumbrantes da cidade.  ARTHUR (60s, bilionário excêntrico, vestindo um roupão de seda), observa a chuva torrencial através de uma janela panorâmica.  Seu rosto, marcado por linhas de preocupação e solidão, reflete um vazio profundo.  Ele toma um gole solitário de uísque, o gelo tilintando no copo como um som metálico em seu silêncio.  A música clássica toca baixo, quase inaudível.\n\n**ARTHUR (V.O.)**\nA riqueza, descobri, é uma ilha deserta.  Rodeada de luxo, mas incrivelmente solitária.\n\nA câmera se move para mostrar um quadro antigo, parcialmente escondido, no canto da sala. Um detalhe sutil, mas que insinua um passado misterioso.\n\n**[CENA 2]**\n\n**EXT. RUA ABAIXO DO APARTAMENTO - NOITE CHUVOSA**\n\nZé e Luís (20s, gêmeos idênticos, vestidos com roupas rasgadas e sujas), mendigam na chuva, protegendo-se como podem com pedaços de papelão.  Apesar da situação miserável, os gêmeos exibem uma resiliência e um olhar de esperança, mesmo que enfraquecidos pela fome e frio.  Eles falam em voz baixa, quase sussurrando, compartilhando suas poucas posses e se confortando mutuamente.\n\n**ZÉ**\nMais uma noite… pelo menos estamos juntos, Luís.\n\n**LUÍS**\nSim… (tosse)  Espero que amanhã seja melhor.\n\n**[CENA 3]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE CHUVOSA**\n\nArthur observa os gêmeos da sua janela.  A chuva bate contra o vidro, mas ele mal a percebe, absorto na cena abaixo.  A imagem dos gêmeos, frágeis e persistentes, o comove profundamente.  Ele percebe uma certa ressonância em suas histórias, um reflexo de sua própria solidão e necessidade de conexão.\n\n**ARTHUR (V.O.)**\nEu os vi… dois pontos minúsculos, perdidos na imensidão da cidade.  Mas seus olhos… eles tinham uma chama que minha riqueza nunca conseguiu acender.\n\n**[CENA 4]**\n\n**EXT. RUA ABAIXO DO APARTAMENTO - NOITE CHUVOSA**\n\nArthur, inesperadamente, desce até os gêmeos.  Ele se aproxima com hesitação, oferecendo-lhes um guarda-chuva. Zé e Luís ficam assustados, desconfiados de suas intenções.\n\n**ARTHUR**\nVocês… precisam de ajuda.  Venham comigo.\n\nZé e Luís trocam olhares nervosos, hesitantes em aceitar a ajuda de um estranho tão rico e distinto.\n\n**LUÍS**\nQuem… quem é você?\n\n**ARTHUR**\nMeu nome é Artur.  E eu posso ajudar vocês.\n\n**[CENA 5]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - MAIS TARDE NA NOITE**\n\nZé e Luís, limpos e alimentados, sentam-se em um sofá luxuoso, ainda desconfiados, mas claramente aliviados.  Artur oferece-lhes um jantar quente e confortável.  O contraste entre a miséria de suas vidas anteriores e o luxo que os cerca é gritante.\n\n**ZÉ**\nEu… não sei o que dizer.  Obrigada, senhor.\n\n**ARTHUR**\nChame-me de Artur.  Não preciso de agradecimentos.  Só quero ajudar.\n\n**[CENA 6]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - DIA SEGUINTE**\n\nArtur apresenta aos gêmeos um plano para ajudá-los a se reerguerem.  Oferece-lhes aulas, terapia, e uma oportunidade para começar uma nova vida.  Zé, imediatista e prático, abraça a oportunidade com entusiasmo.  Luís, porém, permanece retraído, com um olhar distante e traumatizado.\n\n**LUÍS**\n(Em voz baixa)\nÉ muita coisa… muito rápido.\n\nLuís então descobre, acidentalmente, uma velha carta escondida em seus pertences - uma carta que sugere uma ligação surpreendente entre os gêmeos e o passado de Artur, um segredo do qual ninguém tinha conhecimento.\n\n\n**[CENA 7]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE**\n\nEnquanto os gêmeos dormem, Artur examina a carta antiga com atenção. Uma expressão de preocupação e perplexidade toma seu rosto. Uma série de ruídos estranhos e passos furtivos são ouvidos do lado de fora do apartamento, criando uma atmosfera de suspense. A câmera se concentra na fechadura da porta, insinuando a presença de uma figura misteriosa que observa seus passos. A cena termina com Artur em alerta, a carta em suas mãos, o mistério e a ameaça pairando no ar.\n\nCapítulo 3: A chuva caía em finas gotículas, refletindo a mela...\n\nA chuva caía em finas gotículas, refletindo a melancolia que pairava sobre a cobertura de Artur. Zé, agora com um sorriso confiante, apresentava um projeto de aplicativo de delivery para pequenos negócios locais, enquanto Luís, apesar de ainda hesitante, demonstrava maestria em design gráfico, criando o logo e a identidade visual do app.  Artur, observando-os, sentia um aperto no peito, um misto de orgulho e medo. O sucesso dos gêmeos representava a superação da sua própria solidão, mas também o risco de perdê-los.\n\nA carta antiga, mencionando um \"acordo antigo\" e um \"herdeiro perdido\", continuava um enigma.  Um detetive particular, contratado por Artur, havia descoberto que a carta estava relacionada a um antigo caso de desaparecimento, envolvendo uma família rica e um testamento contestado.  As pistas eram escassas, mas a sombra da dúvida pairava. Os pequenos incidentes – um pneu furado no carro de Zé, uma ameaça anônima deixada no apartamento, a tentativa de roubo de dados do projeto – se intensificaram.  A sensação de que eram observados era palpável.\n\nUma noite, enquanto revisavam o aplicativo, um blackout atingiu a cidade. No escuro, uma figura sombria entrou no apartamento, revelando-se como Ricardo, o herdeiro legítimo da fortuna de Artur, que o havia declarado morto para se apoderar de sua herança, mantendo o segredo da existência dos gêmeos, que eram filhos ilegítimos do próprio Artur e de uma antiga amante.  Ele alegou que Zé e Luís representavam uma ameaça ao seu plano, mas ao confrontá-los, o peso da verdade se impôs. Zé e Luís, apesar do medo inicial, se mostraram resistentes. A lealdade dos gêmeos, sua bondade inabalável, mesmo diante de ameaças diretas, comoveram Ricardo, mostrando a força da ligação inesperada que se formou entre eles e Artur.\n\nA verdade sobre a origem dos gêmeos causou um terremoto emocional, mas ao invés de destruir a harmonia construída, serviu para fortalecê-la.  Artur, finalmente, encontrou a família que sempre desejou,  enquanto Zé e Luís descobriram suas raízes e um futuro seguro e promissor, sem abdicar da humildade e da generosidade que os definia.  Ricardo, arrependido, se dispôs a testemunhar perante as autoridades, revelando sua tentativa de fraude e devolvendo a legítima herança a Artur. O detetive, após conseguir o restante das provas, ajudou a deter os cúmplices de Ricardo, que planejavam sequestrar os gêmeos.\n\nO aplicativo dos gêmeos, lançado com o apoio financeiro de Artur, tornou-se um sucesso imediato, melhorando a vida de centenas de pequenos empresários. Zé e Luís, agora com suas vidas consolidadas, dedicaram parte dos lucros para ajudar outros jovens em situação de vulnerabilidade, inspirando-os com sua história de superação. O final mostra os três reunidos, numa cena familiar e calorosa, na nova cobertura de Artur – um lar compartilhado, permeado por risos, conquistas e a certeza de que a bondade, a resiliência e a força do amor familiar podem superar qualquer obstáculo.  A câmera se concentra nos olhos de Artur, finalmente cheios de paz e significado, refletindo uma compreensão profunda da verdadeira riqueza da vida. Um close nos gêmeos, seus sorrisos largos iluminando seus rostos, finaliza a narrativa, transmitindo a mensagem de esperança e transformação, reafirmando que mesmo no caos e no medo, a bondade pode prevalecer e florescer, mesmo que nem todos os dias sejam ensolarados. A trilha sonora, emotiva e inspiradora, acompanha a cena final, selando o poderoso impacto da história.",
      "chapters": [
        {
          "chapter_number": 1,
          "title": "Capítulo 1: ## Milionário Chocado: Gêmeos Mendicantes Mudam Su...",
          "content": "## Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre! - Roteiro (Parte 1)\n\n**Duração estimada:** 4-5 minutos\n\n**Cena 1:** (0:00-1:00)\n\n**Local:** Apartamento de cobertura luxuoso de Artur. Janela panorâmica com vista para a cidade.  Chuva forte.  Artur (60 anos, aparência distinta, mas com um ar de profunda melancolia) está sentado em uma poltrona de couro, observando a chuva cair. O ambiente é sofisticado, mas solitário. A decoração é minimalista, mas opulenta.  Música ambiente suave e melancólica.\n\n**(Voz em off, narrador):** Artur, um milionário excêntrico, construiu um império. Mas a riqueza não preencheu o vazio em seu coração.  Sua vida, um labirinto de luxo e solidão.  Até que uma noite chuvosa, seu mundo mudou para sempre.\n\nArtur pega uma taça de uísque, mas não a leva aos lábios.  Seus olhos estão fixos na rua abaixo, onde dois jovens, Zé e Luís (20 anos), gêmeos idênticos, mal cobertos contra a chuva, tentam se abrigar debaixo de uma marquise.  A câmera foca nos gêmeos, mostrando a pobreza em seus trajes, a expressão de exaustão em seus rostos.\n\n**(Voz em off, narrador):** Zé e Luís, gêmeos idênticos, sobrevivendo nas ruas, um reflexo da crueldade da pobreza.  Sua resiliência, um grito silencioso contra a indiferença.\n\nArtur observa-os por um longo tempo, um misto de compaixão e fascínio em seu olhar.  Ele finalmente pega o telefone, hesita, e depois o desliga.\n\n**Cena 2:** (1:00-2:30)\n\n**Local:** Rua molhada. Zé e Luís se abrigam, tremendo de frio.  Zé tenta animar Luís, que está mais abatido.  Zé tenta vender alguns poucos lenços usados.\n\n**Zé:** (Voz rouca, mas com um toque otimista)  Vamos, Luís. Mais uma noite. Amanhã, quem sabe?  Talvez encontremos algo melhor.\n\n**Luís:** (Voz baixa, sem esperança)  Não tem mais nada, Zé.  Só... chuva e frio.\n\nUm carro luxuoso para ao lado deles. É Artur, que os observa pela janela.  Ele desce do carro, um guarda-chuva o protegendo da chuva.  Zé e Luís se assustam, pensando em algo ruim.\n\n**Artur:** (Voz calma, mas firme)  Boa noite, rapazes.  Vocês... estão bem?\n\nZé e Luís trocam olhares, hesitantes.\n\n**Zé:** (Cauteloso)  Sim, senhor.  Obrigado.\n\n**Luís:** (Sussurra)  Estamos bem...\n\nArtur se aproxima, oferecendo o guarda-chuva.\n\n**Artur:**  A chuva está forte.  Por que não vêm comigo?  Tenho um lugar seco onde vocês podem se aquecer.\n\n**Zé:** (Surpreso)  Com o senhor...?\n\n**Luís:** (Incrêdulo)  Não sei...\n\n**Artur:** (Com um sorriso gentil)  Não precisam temer.  Só quero ajudá-los.\n\n**Cena 3:** (2:30-4:00)\n\n**Local:** O luxuoso apartamento de Artur. Zé e Luís estão sentados em um sofá enorme, olhando para tudo com incrédula espanto.  Artur oferece chocolate quente e um cobertor.\n\n**Artur:**  Vocês devem estar famintos.  Há comida suficiente para todos nós.\n\nZé e Luís hesitam em comer, observando tudo ao redor.  A riqueza incomoda Luís, que mantém o olhar fixo no chão.  Zé, no entanto, demonstra mais abertura.\n\n**Zé:** (Agradecido)  Muito obrigado, senhor.  É... é muito generoso da sua parte.\n\n**Luís:** (Quieto, desconfiado)  Obrigado.\n\n**Artur:**  Chame-me de Artur.  E por favor, comam.  Vocês precisam recuperar as forças.\n\nArtur observa os gêmeos, percebendo suas diferenças. Zé é mais aberto, receptivo; Luís fechado, traumatizado.\n\n**Cena 4:** (4:00-5:00)\n\n**Local:** Quarto de hóspedes no apartamento de Artur. Zé e Luís tentam dormir em camas confortáveis. Luís não consegue, revivendo memórias de sua vida na rua, enquanto Zé dorme profundamente após a refeição e a exaustão.  Luís encontra uma carta antiga e antiga e desgastada, meio escondida em seus poucos pertences. Ele tenta ler, mas o conteúdo permanece obscuro.\n\n**(Voz em off, narrador):** A mudança drástica de vida trouxe novos desafios.  A riqueza de Artur confrontou a dura realidade dos gêmeos, criando um triângulo de afeto e dependência, mas um mistério emerge...\n\nA câmera foca na carta antiga nas mãos de Luís, com uma música de suspense.  Um close na letra ilegível.  Um som de vidro quebrando em algum lugar na cobertura... sugerindo a presença de outra pessoa.\n\n**(FIM DA PARTE 1)**",
          "word_count": 641
        },
        {
          "chapter_number": 2,
          "title": "Capítulo 2: ## Milionário Chocado: Gêmeos Mendicantes Mudam Su...",
          "content": "## Milionário Chocado: Gêmeos Mendicantes Mudam Sua Vida Para Sempre! - Capítulo 1: O Encontro\n\n**Duração Estimada:** 6 minutos\n\n\n**[CENA 1]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE CHUVOSA**\n\nUm imenso apartamento de cobertura, decorado com um estilo minimalista e frio, mas com vistas deslumbrantes da cidade.  ARTHUR (60s, bilionário excêntrico, vestindo um roupão de seda), observa a chuva torrencial através de uma janela panorâmica.  Seu rosto, marcado por linhas de preocupação e solidão, reflete um vazio profundo.  Ele toma um gole solitário de uísque, o gelo tilintando no copo como um som metálico em seu silêncio.  A música clássica toca baixo, quase inaudível.\n\n**ARTHUR (V.O.)**\nA riqueza, descobri, é uma ilha deserta.  Rodeada de luxo, mas incrivelmente solitária.\n\nA câmera se move para mostrar um quadro antigo, parcialmente escondido, no canto da sala. Um detalhe sutil, mas que insinua um passado misterioso.\n\n**[CENA 2]**\n\n**EXT. RUA ABAIXO DO APARTAMENTO - NOITE CHUVOSA**\n\nZé e Luís (20s, gêmeos idênticos, vestidos com roupas rasgadas e sujas), mendigam na chuva, protegendo-se como podem com pedaços de papelão.  Apesar da situação miserável, os gêmeos exibem uma resiliência e um olhar de esperança, mesmo que enfraquecidos pela fome e frio.  Eles falam em voz baixa, quase sussurrando, compartilhando suas poucas posses e se confortando mutuamente.\n\n**ZÉ**\nMais uma noite… pelo menos estamos juntos, Luís.\n\n**LUÍS**\nSim… (tosse)  Espero que amanhã seja melhor.\n\n**[CENA 3]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE CHUVOSA**\n\nArthur observa os gêmeos da sua janela.  A chuva bate contra o vidro, mas ele mal a percebe, absorto na cena abaixo.  A imagem dos gêmeos, frágeis e persistentes, o comove profundamente.  Ele percebe uma certa ressonância em suas histórias, um reflexo de sua própria solidão e necessidade de conexão.\n\n**ARTHUR (V.O.)**\nEu os vi… dois pontos minúsculos, perdidos na imensidão da cidade.  Mas seus olhos… eles tinham uma chama que minha riqueza nunca conseguiu acender.\n\n**[CENA 4]**\n\n**EXT. RUA ABAIXO DO APARTAMENTO - NOITE CHUVOSA**\n\nArthur, inesperadamente, desce até os gêmeos.  Ele se aproxima com hesitação, oferecendo-lhes um guarda-chuva. Zé e Luís ficam assustados, desconfiados de suas intenções.\n\n**ARTHUR**\nVocês… precisam de ajuda.  Venham comigo.\n\nZé e Luís trocam olhares nervosos, hesitantes em aceitar a ajuda de um estranho tão rico e distinto.\n\n**LUÍS**\nQuem… quem é você?\n\n**ARTHUR**\nMeu nome é Artur.  E eu posso ajudar vocês.\n\n**[CENA 5]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - MAIS TARDE NA NOITE**\n\nZé e Luís, limpos e alimentados, sentam-se em um sofá luxuoso, ainda desconfiados, mas claramente aliviados.  Artur oferece-lhes um jantar quente e confortável.  O contraste entre a miséria de suas vidas anteriores e o luxo que os cerca é gritante.\n\n**ZÉ**\nEu… não sei o que dizer.  Obrigada, senhor.\n\n**ARTHUR**\nChame-me de Artur.  Não preciso de agradecimentos.  Só quero ajudar.\n\n**[CENA 6]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - DIA SEGUINTE**\n\nArtur apresenta aos gêmeos um plano para ajudá-los a se reerguerem.  Oferece-lhes aulas, terapia, e uma oportunidade para começar uma nova vida.  Zé, imediatista e prático, abraça a oportunidade com entusiasmo.  Luís, porém, permanece retraído, com um olhar distante e traumatizado.\n\n**LUÍS**\n(Em voz baixa)\nÉ muita coisa… muito rápido.\n\nLuís então descobre, acidentalmente, uma velha carta escondida em seus pertences - uma carta que sugere uma ligação surpreendente entre os gêmeos e o passado de Artur, um segredo do qual ninguém tinha conhecimento.\n\n\n**[CENA 7]**\n\n**INT. APARTAMENTO DE COBERTURA DE ARTUR - NOITE**\n\nEnquanto os gêmeos dormem, Artur examina a carta antiga com atenção. Uma expressão de preocupação e perplexidade toma seu rosto. Uma série de ruídos estranhos e passos furtivos são ouvidos do lado de fora do apartamento, criando uma atmosfera de suspense. A câmera se concentra na fechadura da porta, insinuando a presença de uma figura misteriosa que observa seus passos. A cena termina com Artur em alerta, a carta em suas mãos, o mistério e a ameaça pairando no ar.",
          "word_count": 647
        },
        {
          "chapter_number": 3,
          "title": "Capítulo 3: A chuva caía em finas gotículas, refletindo a mela...",
          "content": "A chuva caía em finas gotículas, refletindo a melancolia que pairava sobre a cobertura de Artur. Zé, agora com um sorriso confiante, apresentava um projeto de aplicativo de delivery para pequenos negócios locais, enquanto Luís, apesar de ainda hesitante, demonstrava maestria em design gráfico, criando o logo e a identidade visual do app.  Artur, observando-os, sentia um aperto no peito, um misto de orgulho e medo. O sucesso dos gêmeos representava a superação da sua própria solidão, mas também o risco de perdê-los.\n\nA carta antiga, mencionando um \"acordo antigo\" e um \"herdeiro perdido\", continuava um enigma.  Um detetive particular, contratado por Artur, havia descoberto que a carta estava relacionada a um antigo caso de desaparecimento, envolvendo uma família rica e um testamento contestado.  As pistas eram escassas, mas a sombra da dúvida pairava. Os pequenos incidentes – um pneu furado no carro de Zé, uma ameaça anônima deixada no apartamento, a tentativa de roubo de dados do projeto – se intensificaram.  A sensação de que eram observados era palpável.\n\nUma noite, enquanto revisavam o aplicativo, um blackout atingiu a cidade. No escuro, uma figura sombria entrou no apartamento, revelando-se como Ricardo, o herdeiro legítimo da fortuna de Artur, que o havia declarado morto para se apoderar de sua herança, mantendo o segredo da existência dos gêmeos, que eram filhos ilegítimos do próprio Artur e de uma antiga amante.  Ele alegou que Zé e Luís representavam uma ameaça ao seu plano, mas ao confrontá-los, o peso da verdade se impôs. Zé e Luís, apesar do medo inicial, se mostraram resistentes. A lealdade dos gêmeos, sua bondade inabalável, mesmo diante de ameaças diretas, comoveram Ricardo, mostrando a força da ligação inesperada que se formou entre eles e Artur.\n\nA verdade sobre a origem dos gêmeos causou um terremoto emocional, mas ao invés de destruir a harmonia construída, serviu para fortalecê-la.  Artur, finalmente, encontrou a família que sempre desejou,  enquanto Zé e Luís descobriram suas raízes e um futuro seguro e promissor, sem abdicar da humildade e da generosidade que os definia.  Ricardo, arrependido, se dispôs a testemunhar perante as autoridades, revelando sua tentativa de fraude e devolvendo a legítima herança a Artur. O detetive, após conseguir o restante das provas, ajudou a deter os cúmplices de Ricardo, que planejavam sequestrar os gêmeos.\n\nO aplicativo dos gêmeos, lançado com o apoio financeiro de Artur, tornou-se um sucesso imediato, melhorando a vida de centenas de pequenos empresários. Zé e Luís, agora com suas vidas consolidadas, dedicaram parte dos lucros para ajudar outros jovens em situação de vulnerabilidade, inspirando-os com sua história de superação. O final mostra os três reunidos, numa cena familiar e calorosa, na nova cobertura de Artur – um lar compartilhado, permeado por risos, conquistas e a certeza de que a bondade, a resiliência e a força do amor familiar podem superar qualquer obstáculo.  A câmera se concentra nos olhos de Artur, finalmente cheios de paz e significado, refletindo uma compreensão profunda da verdadeira riqueza da vida. Um close nos gêmeos, seus sorrisos largos iluminando seus rostos, finaliza a narrativa, transmitindo a mensagem de esperança e transformação, reafirmando que mesmo no caos e no medo, a bondade pode prevalecer e florescer, mesmo que nem todos os dias sejam ensolarados. A trilha sonora, emotiva e inspiradora, acompanha a cena final, selando o poderoso impacto da história.",
          "word_count": 554
        }
      ],
      "chapters_generated": 3,
      "estimated_duration": 12.473333333333333,
      "style": "inicio",
      "generation_time": "2025-08-22T20:28:59.095208",
      "partial": false
    }
  },
  "config": {
    "extraction": {
      "enabled": true,
      "method": "yt-dlp",
      "rapidapi_key": ""
    },
    "titles": {
      "enabled": true,
      "provider": "gemini",
      "count": 1,
      "style": "viral",
      "language": "pt-BR",
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "premises": {
      "enabled": true,
      "provider": "gemini",
      "style": "educational",
      "target_audience": "general",
      "word_count": 200,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "scripts": {
      "enabled": true,
      "provider": "gemini",
      "chapters": 3,
      "duration_target": "3 minutes",
      "include_intro": true,
      "include_outro": true,
      "custom_prompts": false,
      "custom_inicio": "",
      "custom_meio": "",
      "custom_fim": ""
    },
    "tts": {
      "enabled": true,
      "provider": "kokoro",
      "voice": "af_bella",
      "language": "en",
      "speed": 1,
      "pitch": 1
    },
    "images": {
      "enabled": true,
      "provider": "pollinations",
      "style": "realistic",
      "quality": "high",
      "count_per_chapter": 2,
      "custom_prompt": false,
      "custom_instructions": ""
    },
    "video": {
      "enabled": true,
      "resolution": "1920x1080",
      "fps": 30,
      "format": "mp4",
      "include_subtitles": true,
      "transition_duration": 0.5
    },
    "prompts": {
      "titles": {
        "viral": "Crie títulos virais e envolventes para o vídeo sobre: {topic}. Os títulos devem ser chamativos, despertar curiosidade e incentivar cliques.",
        "educational": "Crie títulos educacionais e informativos para o vídeo sobre: {topic}. Os títulos devem ser claros, diretos e indicar o valor educacional.",
        "professional": "Crie títulos profissionais e sérios para o vídeo sobre: {topic}. Os títulos devem transmitir autoridade e credibilidade."
      },
      "premises": {
        "narrative": "Crie uma premissa narrativa envolvente para um vídeo sobre: {title}. A premissa deve contar uma história cativante em aproximadamente {word_count} palavras.",
        "educational": "Crie uma premissa educacional estruturada para um vídeo sobre: {title}. A premissa deve apresentar os pontos de aprendizado em aproximadamente {word_count} palavras.",
        "informative": "Crie uma premissa informativa e objetiva para um vídeo sobre: {title}. A premissa deve apresentar fatos e informações relevantes em aproximadamente {word_count} palavras."
      },
      "scripts": {
        "inicio": "# Prompt — Início\n\nEscreva uma narrativa de {genre} intitulada \"{title}\".\n\nPremissa: {premise}\n\nEste é o INÍCIO da história. Deve estabelecer:\n- Personagens principais e suas motivações\n- Cenário e atmosfera da história\n- Conflito principal que moverá a narrativa\n- Tom inicial da narrativa\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na descrição de cenários, personagens, ações e diálogos.",
        "meio": "# Prompt — Meio\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEsta é a continuação do MEIO da história. Deve:\n- Continuar a narrativa de forma orgânica e coerente\n- Desenvolver os personagens e suas relações\n- Intensificar o conflito principal\n- Adicionar novos elementos de tensão\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso. Cada capítulo deve ter conteúdo substancial e rico em detalhes.",
        "fim": "# Prompt — Fim\n\nContinue a narrativa de {genre} intitulada \"{title}\".\n\nCONTEXTO ANTERIOR:\n\"{previousContent}\"...\n\nEste é o FIM da história. Deve:\n- Resolver o conflito principal estabelecido no início\n- Proporcionar conclusão satisfatória para todos os personagens principais\n- Entregar o clímax esperado da história\n- Fechar a história de forma impactante\n\n**IMPORTANTE:** Seja detalhado, extenso e minucioso na conclusão. Garanta um fechamento rico e satisfatório."
      },
      "images": {
        "cinematic": "Crie uma descrição cinematográfica para uma imagem que represente: {scene_description}. A imagem deve ter qualidade cinematográfica, boa iluminação e composição profissional.",
        "minimalist": "Crie uma descrição minimalista para uma imagem que represente: {scene_description}. A imagem deve ser limpa, simples e com foco no elemento principal.",
        "artistic": "Crie uma descrição artística para uma imagem que represente: {scene_description}. A imagem deve ser criativa, expressiva e visualmente impactante."
      }
    }
  },
  "progress": {},
  "version": "1.0"
}